{
  "blurbs": [
    "**Stack** – Ketchapp  \n\n*Core mechanic:* Players tap the screen to drop a block onto an existing tower. The goal is to align each new block precisely with the one below it; the tower grows taller with every successful placement, and the game ends when a block misaligns and the tower collapses. The simple, reflex‑based action and instant feedback make it a go‑to hyper‑casual title that was still topping the App Store charts a year ago.",
    "**The Floor is Lava** – a one‑touch tap game that went viral in mid‑2024.  \nThe core mechanic is simple: you swipe or tap to move your character across a room, jumping over furniture, ledges, and other obstacles while avoiding the floor that turns into lava. The goal is to reach the finish line before the lava rises or you fall.",
    "**Helix Jump 2.0** – The updated version of the hyper‑casual hit was launched in January 2024.  Players tap the screen to bounce a ball down a spiraling tower, trying to avoid colored platforms and reach the bottom.  The core mechanic is a single‑finger tap that controls the ball’s vertical impulse, keeping the gameplay fast, simple, and instantly accessible. [7]",
    "**Game:** **Drop Dash** – a hyper‑casual title that exploded on TikTok and the App Store charts in early 2024.\n\n**Core mechanic:**  \nPlayers drag a small ball from the bottom of the screen and release it; the ball travels along a simple, gravity‑driven path and must land in a matching coloured slot that appears at the top. Each successful match triggers a bright visual pop and a satisfying “ping” sound, while a short timer adds urgency.\n\n**What makes it addictive:**  \n- **Instant feedback:** The pop‑sound and colour burst give immediate gratification, creating a dopamine spike that encourages repeat play.  \n- **Zero learning curve:** Drag‑and‑drop is intuitive, so anyone can start scoring right away, keeping the barrier to entry extremely low.  \n- **Progressive tension:** As rounds speed up and new obstacles appear, the challenge escalates just enough to keep players engaged, but each session remains short enough for the “just one more round” loop that fuels viral sharing.",
    "**Stack the Tower** (released January 2024 by Ketchapp)  \n- **Core mechanic:** The player taps to drop a horizontally‑aligned block onto a growing vertical tower. Each block rotates a little, so you must time your taps",
    "**Race Clicker** – a 2024 one‑tap racer released in March 2024 【1†L6-L8】.  \nIn the game the car drives forward automatically on an endless track, and the player keeps it moving by tapping the screen. Each tap gives a brief speed boost; the goal is to avoid on‑coming obstacles and collect coins as far as possible.",
    "**Jelly Jump – 2024 Hyper‑Casual Free‑to‑Play**\n\nThe core mechanic is a one‑tap jump that propels a jelly‑like character forward while you dodge obstacles and collect candies. Each jump feels light and responsive, giving instant feedback that keeps players hooked for short bursts of “just one more” gameplay. The minimalist, pastel‑colored world and simple physics make it feel satisfying and effortlessly addictive.",
    "**Color Block Jam** – A swipe‑based puzzle where players slide blocks left or right to line up matching colors, clearing rows and earning points. The game’s fast‑paced, one‑handed mechanic made it a top‑chart hyper‑casual hit on both iOS and Android around January 2025.",
    "**Drop** – a minimalist mobile arcade game released in 2024.  \nTap to drop solid‑colored blocks into a vertical grid, letting them fall straight down. When a horizontal or vertical line of five or more same‑colored blocks forms, that line disappears, and the goal is to keep the stack from reaching the top.",
    "**Color Drop (2024)** – A minimalist physics‑puzzle game where you tap to drop colored balls into a grid. The goal is to line up three or more matching colors horizontally, vertically, or diagonally, causing them to vanish and clearing space for the next drops. Its clean, monochrome art style and one‑hand‑friendly controls make it a perfect quick‑play title for on‑the‑go sessions.",
    "**Balloon Pop**\n\n- **Core mechanic:** Swipe or tap to pop balloons that drift upward while avoiding falling obstacles; each burst earns points and can trigger power‑ups that clear the screen or double the score.  \n- **Why it was popular a year ago:** Its one‑handed, instant‑on gameplay made it perfect for commuters and short‑break sessions, and the endless‑mode replayability kept players chasing higher scores without any long commitment.",
    "**Game:** **Block Drop** (released Jan 2024, published by Voodoo)  \n**Core mechanic:** Blocks of various colors fall from the top of the screen,",
    "**Jump Jump** – launched in March 2024 by Yodo1, this hyper‑casual title puts you in control of a bouncing ball that must stay on a series of increasingly tight platforms. The core mechanic is a single tap that makes the ball leap, and you must time those taps to avoid gaps, spikes, and rising speed. It’s fun because the instant feedback and steadily rising difficulty create a quick, addictive loop that’s perfect for short play sessions.",
    "**Stack** – a hyper‑casual title that dominated the App Store in early 2023.  \nYou tap to drop a cube onto a moving stack of cubes; the goal is to align it perfectly so the stack keeps rising. The core mechanic is pure timing and precision: a single tap can make you win or lose, making the game instantly addictive.",
    "**Stack Jump 2025**\n\n*Core mechanic:* In this one‑touch endless runner, a small ball continuously bounces upward while the player taps to change the ball’s direction. Each tap must land the ball on the next platform before gravity pulls it down, earning points for every successful bounce and unlocking new skins and power‑ups. The game’s ultra‑simple “tap‑to‑jump” loop made it a quick‑fire hit on both iOS and Android in early 2025.",
    "**Game:** **Stack Jump 2** (2024)\n\n**Core mechanic:** Players tap to rotate a 3‑by‑3 grid of blocks and then tap again to drop the rotated layer onto the stack. The goal is to keep the tower balanced while avoiding falling blocks.  \n\n**Why it’s addictive:** The mechanics are razor‑simple—just two taps per layer—yet the physics create a quick “what‑if” loop: each tap can either keep the tower going or cause a spectacular collapse. The instant visual feedback, coupled with a progressively higher, risk‑reward challenge, keeps players guessing and replaying until they hit that perfect, impossible‑looking height. The short, snappy sessions fit the hyper‑casual format and feed the social‑media loop, fueling its viral spread in early 2024.",
    "**Run & Jump 3** – an early‑2024 hyper‑casual runner where the player taps the screen to make the character hop over gaps, ramps, and moving hazards. The core mechanic is a single‑tap “jump” that keeps the action fast and intuitive, while the goal is to survive as long as possible and rack up points by collecting coins and power‑ups. The game’s minimal controls make it perfect for quick, pick‑up‑and‑play sessions on mobile."
  ]
}