{
  "classic_house": {
    "name": "Classic House / Old School House",
    "bpm": [118, 126],
    "keys": ["C major", "F major", "G major", "A minor", "D minor"],
    "description": "Classic house is the golden era sound—1986 to 1992—before the genre splintered into subgenres. This is the canonical blueprint: four-on-the-floor kick, claps snapping on 2 and 4, hi-hats swinging with disco's ghost still in the machine. Born in Chicago's Warehouse and refined in New York's Paradise Garage, this sound carries disco's DNA but stripped to essentials and rebuilt with drum machines. The 909 or 808 provides the pulse, but the feel is human—swing pushed to 55-65% transforms rigid 16ths into something that breathes and bounces. The kick is warm and present but never dominates; it's a foundation for the piano and vocals to shine. Tempo sits in the 120-124 sweet spot, fast enough to move bodies but slow enough for the groove to stretch out and the emotion to land.",
    "production": "The piano is the defining voice of classic house—rolling chords, often in major keys, played with gospel fervor. Think the opening of 'Promised Land' or the breakdown in 'French Kiss'. Rhodes and organ add warmth, strings swell for emotion, and when the vocal comes in, it *preaches*. This is soulful music, spiritual even—Joe Smooth's 'Promised Land' is literally a hymn. The bassline walks and moves, often an octave pattern with passing notes, locked tight with the kick but with its own melodic identity. The mix is warm, even muddy by modern standards—tape saturation, room reverb, the imperfections of early sampling all contribute to that vintage feel. Vocal samples from disco and soul records chop and loop, 'work it' and 'feel the music' becoming mantras. The breakdown is sacred: drums drop out, the piano or strings carry the weight, the crowd raises their hands, and when the kick returns it's resurrection. This is church music for the dancefloor.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.4, "tune": 0, "level": 0.85 },
      "clap": { "pattern": [4, 12], "decay": 0.45, "level": 0.75 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.22, "level": 0.55 },
      "oh": { "pattern": [2, 6, 10, 14], "decay": 0.35, "level": 0.5 }
    },
    "bass": {
      "style": "walking octave pattern, melodic movement",
      "waveform": "sawtooth",
      "cutoff": 0.5,
      "resonance": 0.2,
      "envMod": 0.35
    },
    "swing": 60,
    "references": ["Promised Land - Joe Smooth", "French Kiss - Lil Louis", "Can You Party - Royal House", "Ride on Time - Black Box", "Pacific State - 808 State", "Good Life - Inner City"]
  },

  "detroit_techno": {
    "name": "Detroit Techno",
    "bpm": [120, 135],
    "keys": ["C minor", "D minor", "F minor", "A minor"],
    "description": "Detroit techno emerged in the mid-80s from Belleville Three (Juan Atkins, Derrick May, Kevin Saunderson), fusing Kraftwerk's precision with Parliament-Funkadelic's soul. The sound is mechanical yet emotional—cold synthesizers carrying warm melodies. The kick is punchy but not overwhelming, usually a tight 909 with moderate decay around 0.3-0.4, tuned neutral or slightly up. Snares crack cleanly on 2 and 4, often with a short reverb tail. Hi-hats drive the track with steady 16ths, closed hats dominant with open hats accenting the offbeats sparingly.",
    "production": "The bassline is the soul—deep, melodic, often a sawtooth or square wave filtered to sit warm in the low-mids. Detroit bass moves, it's not a static root note. Chord stabs punctuate with string-like pads or Rhodes-style keys, heavy on the minor 7ths and 9ths for that bittersweet futurism. The mix is spacious—every element has room to breathe. Reverb is used tastefully, never washing things out. The feel is driving but sophisticated, like a machine dreaming of being human.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.35, "tune": 0, "level": 0.9 },
      "snare": { "pattern": [4, 12], "decay": 0.3, "tone": 0.5, "level": 0.7 },
      "clap": { "pattern": [4, 12], "decay": 0.4, "level": 0.5 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.2, "level": 0.5 },
      "oh": { "pattern": [2, 10], "decay": 0.3, "level": 0.35 }
    },
    "bass": {
      "style": "melodic, moving lines",
      "waveform": "sawtooth",
      "cutoff": 0.4,
      "resonance": 0.2,
      "envMod": 0.3
    },
    "swing": 15,
    "references": ["Strings of Life - Derrick May", "No UFOs - Juan Atkins", "Big Fun - Inner City"]
  },

  "berlin_techno": {
    "name": "Berlin Techno",
    "bpm": [128, 140],
    "keys": ["A minor", "D minor", "E minor"],
    "description": "Berlin techno is the sound of concrete and strobe lights, born in the reunification-era clubs like Tresor and Berghain. Where Detroit dreams, Berlin pounds. The kick is the center of everything—deep, heavy, with a long tail that dominates the low end. Tuned down (-3 to -6 on a 909) for maximum chest impact, decay pushed to 0.5-0.7 so it breathes and pulses. The tempo runs hotter than Detroit, 130-138 being the sweet spot for that relentless forward momentum.",
    "production": "Hi-hats are minimal—often just a sparse pattern or filtered noise. The snare or clap hits hard but dry, no reverb, creating a stark industrial feel. Bass is often just the kick tail itself, or a simple sub-bass drone following the root note. When synth lines appear, they're hypnotic single-note sequences, often with heavy delay creating rhythmic echoes. The Berlin aesthetic is reduction—strip away everything unnecessary until only the essential groove remains. Space and silence are instruments. The DJ EQ is part of the composition—tracks are designed to have their lows and highs manipulated live.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.6, "tune": -4, "level": 1.0 },
      "clap": { "pattern": [4, 12], "decay": 0.25, "level": 0.6 },
      "ch": { "pattern": [2, 6, 10, 14], "decay": 0.15, "level": 0.4 },
      "ride": { "pattern": [0, 4, 8, 12], "decay": 0.4, "level": 0.25 }
    },
    "bass": {
      "style": "minimal, often just kick tail",
      "waveform": "square",
      "cutoff": 0.25,
      "resonance": 0.1,
      "envMod": 0.2
    },
    "swing": 0,
    "references": ["Spastik - Plastikman", "Acid Phase - Emmanuel Top", "The Bells - Jeff Mills"]
  },

  "industrial_techno": {
    "name": "Industrial Techno",
    "bpm": [130, 145],
    "keys": ["C minor", "B minor", "F# minor"],
    "description": "Industrial techno takes Berlin's foundation and feeds it through a metal grinder. Pioneered by labels like Mord, Perc Trax, and Semantica, this is techno for abandoned factories and dystopian futures. The kick is distorted, overdriven, sometimes layered with noise bursts. Where Berlin techno breathes, industrial suffocates—the compression is heavy, the mix is dense and aggressive. Tempos push higher, 135-145, with an unrelenting mechanical precision that feels inhuman.",
    "production": "Percussion is weaponized—industrial samples, metallic clangs, reversed crashes, and noise sweeps create a hostile sonic environment. The 909's rimshot becomes a whip crack at high velocity, the toms are tuned into metallic thuds. Bass is distorted and mean, often with bitcrushing or waveshaping to add grit. Synth lines when present are harsh—buzzing, screaming, teeth-on-edge frequencies. The overall mix is lo-fi by design, with intentional clipping and saturation. This isn't music for dancing—it's music for exorcism. The swing is zero, everything locked to a merciless grid.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.5, "tune": -2, "level": 1.0 },
      "snare": { "pattern": [4, 12], "decay": 0.2, "tone": 0.8, "level": 0.8 },
      "rimshot": { "pattern": [2, 7, 10, 15], "level": 0.6 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.1, "level": 0.5 }
    },
    "bass": {
      "style": "distorted, aggressive",
      "waveform": "square",
      "cutoff": 0.6,
      "resonance": 0.5,
      "envMod": 0.6
    },
    "swing": 0,
    "references": ["Look What Your Love Has Done To Me - Perc", "Leather - Paula Temple", "Function - Vatican Shadow"]
  },

  "chicago_house": {
    "name": "Chicago House",
    "bpm": [118, 128],
    "keys": ["C major", "F major", "G major", "A minor"],
    "description": "Chicago house is the original—the blueprint written in the Warehouse and the Music Box by Frankie Knuckles, Ron Hardy, and the Hot Mix 5. It's joyful, soulful, built on disco's bones but stripped to essentials. The 909 kick hits four-on-the-floor but lighter than techno, decay around 0.3-0.4 for a tighter punch that leaves room for the bass. The clap is queen here—snappy, present, often with a touch of reverb to give it body. The closed hi-hat swings hard, 60-70% swing turning mechanical 16ths into human groove.",
    "production": "The bass is where Chicago lives—fat 303 lines or Juno bass with movement and soul. Not just root notes but walking patterns, octave jumps, slides that reach and yearn. Piano stabs punctuate with jazzy chords, organ swells lift the spirit, vocal samples preach and testify. The mix is warm, even muddy by modern standards—this is music made on tape, meant for sweaty rooms with big speakers. Reverb is generous, creating space and depth. The swing is essential—straight Chicago house doesn't exist. That shuffle is the difference between programmed and played, between machine and human.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.35, "tune": 0, "level": 0.85 },
      "clap": { "pattern": [4, 12], "decay": 0.45, "level": 0.75 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.2, "level": 0.55 },
      "oh": { "pattern": [2, 6, 10, 14], "decay": 0.35, "level": 0.45 }
    },
    "bass": {
      "style": "walking, melodic, soulful",
      "waveform": "sawtooth",
      "cutoff": 0.5,
      "resonance": 0.25,
      "envMod": 0.4
    },
    "swing": 65,
    "references": ["Your Love - Frankie Knuckles", "Can You Feel It - Mr. Fingers", "Move Your Body - Marshall Jefferson"]
  },

  "deep_house": {
    "name": "Deep House",
    "bpm": [118, 125],
    "keys": ["D minor", "G minor", "C minor", "F minor"],
    "description": "Deep house is Chicago's introspective cousin—late night music for coming down, for 4am conversations, for souls seeking warmth in the dark. Larry Heard's 'Can You Feel It' is the template: pads that float like clouds, bass that pulses like a heartbeat, drums that suggest rather than demand. The kick is soft, round, often with the attack slightly smoothed. The tempo drops to 120-122 for that hypnotic, almost metronomic pulse. Minor keys dominate, but not sad—contemplative, intimate.",
    "production": "Pads are essential—lush, evolving, often Juno-style strings with slow attacks and long releases that blur into each other. The bass is simpler than Chicago house, often holding notes longer, letting them breathe and resonate. Rhodes and electric piano provide harmonic movement with jazzy 7th and 9th chords. The hi-hat pattern is often simplified, sometimes just 8ths instead of 16ths, creating more space. Reverb is long and deep, creating a sense of vast interior space. Vocals when present are buried in the mix, more texture than message. The overall feel is submerged, underwater—sound moving through liquid rather than air.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.4, "tune": -1, "level": 0.75 },
      "clap": { "pattern": [4, 12], "decay": 0.5, "level": 0.5 },
      "ch": { "pattern": [0, 4, 8, 12], "decay": 0.25, "level": 0.4 },
      "oh": { "pattern": [4, 12], "decay": 0.4, "level": 0.35 }
    },
    "bass": {
      "style": "sustained, pulsing, minimal movement",
      "waveform": "sawtooth",
      "cutoff": 0.35,
      "resonance": 0.15,
      "envMod": 0.2
    },
    "swing": 45,
    "references": ["Can You Feel It - Mr. Fingers", "Mystery of Love - Larry Heard", "Strings of Life (Derrick May remix)"]
  },

  "tech_house": {
    "name": "Tech House",
    "bpm": [124, 130],
    "keys": ["A minor", "D minor", "G minor"],
    "description": "Tech house is the practical middle ground—house's groove meets techno's drive. Emerging in the mid-90s from UK producers like Mr. C and Eddie Richards, it strips away house's soulful excess and techno's industrial severity. The kick is present and defined, tuned fairly neutral, with moderate decay. The groove is still there but less pronounced than Chicago—swing around 25-35%, enough to feel human without being loose. Tempo sits in the 125-128 sweet spot, equally comfortable warming up a room or keeping it moving.",
    "production": "The hi-hat pattern is busier than deep house but more restrained than Chicago—often 16ths with velocity variation creating movement without chaos. Percussion is key: congas, bongos, shakers add organic texture over the electronic foundation. The bass is functional—a solid, repetitive line that locks with the kick and doesn't try to be melodic. Synth stabs are short and percussive rather than atmospheric. The mix is clean and modern, prioritizing clarity over warmth. Vocals are usually cut-up samples or single phrases repeated for hypnotic effect. This is DJ tool music—designed for mixing, building, and maintaining energy without demanding attention.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.4, "tune": 0, "level": 0.9 },
      "clap": { "pattern": [4, 12], "decay": 0.35, "level": 0.65 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.18, "level": 0.5 },
      "oh": { "pattern": [2, 10], "decay": 0.25, "level": 0.35 }
    },
    "bass": {
      "style": "functional, locked to kick",
      "waveform": "square",
      "cutoff": 0.45,
      "resonance": 0.2,
      "envMod": 0.35
    },
    "swing": 30,
    "references": ["Lizard - Mauro Picotto", "Finally - Kings of Tomorrow", "Cafe Del Mar - Energy 52"]
  },

  "acid_house": {
    "name": "Acid House",
    "bpm": [120, 130],
    "keys": ["A minor", "E minor", "D minor"],
    "description": "Acid house was an accident that changed everything. In 1987, DJ Pierre twisted the knobs of a $300 TB-303 bass synthesizer and discovered the squelch—that wet, resonant, filter-swept sound that would launch a thousand raves. The 303 was designed to replace bass guitars; instead it became an alien instrument making sounds no bassist could imagine. The acid sound is all about the filter: high resonance creating sharp peaks, envelope modulation making each note bloom and decay, slides connecting notes with liquid portamento.",
    "production": "The drum pattern is classic Chicago—four-on-the-floor kick, claps on 2 and 4, swinging hi-hats. But the 303 is the star. The pattern is usually simple, often just a few notes, because the timbral variation carries the interest. Accent certain notes for emphasis, slide between others for that reaching, yearning quality. The cutoff sweeps are the hook—slowly opening the filter as the track builds, closing it down for tension. Resonance at 60-80% creates that characteristic scream. The rest of the track stays minimal to let the acid line dominate. This sound defined the Second Summer of Love and still sounds like the future.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.35, "tune": 0, "level": 0.85 },
      "clap": { "pattern": [4, 12], "decay": 0.4, "level": 0.7 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.2, "level": 0.5 },
      "oh": { "pattern": [2, 6, 10, 14], "decay": 0.3, "level": 0.4 }
    },
    "bass": {
      "style": "303 acid line with slides and accents",
      "waveform": "sawtooth",
      "cutoff": 0.3,
      "resonance": 0.7,
      "envMod": 0.7,
      "accent": 0.8,
      "slide": true
    },
    "swing": 55,
    "references": ["Acid Tracks - Phuture", "Voodoo Ray - A Guy Called Gerald", "Pacific State - 808 State"]
  },

  "acid_techno": {
    "name": "Acid Techno",
    "bpm": [135, 150],
    "keys": ["A minor", "F minor", "C minor"],
    "description": "Acid techno takes the 303 out of the warehouse and into the rave—faster, harder, more relentless. Where acid house seduces, acid techno attacks. Born in the early 90s UK free party scene and German clubs, this is 303 pushed to its limits: screaming resonance, rapid-fire patterns, filter sweeps that feel like sonic assault. The tempo jumps to 140+ BPM, the kick gets harder, and the acid line becomes a weapon rather than a voice.",
    "production": "The drums hit harder than house—closer to Berlin techno's weight but with more hi-hat energy. The 303 pattern is often busier, 16th notes instead of 8ths, with frequent accents creating a stuttering, aggressive feel. Slides are used constantly, notes bending into each other in sheets of resonant noise. The cutoff modulation is extreme—full sweeps from closed to screaming. Multiple 303 lines sometimes layer, creating walls of acid. The overall aesthetic is psychedelic in the true sense: overwhelming, reality-dissolving, designed for altered states. No subtlety, no restraint—just pure acid energy.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.45, "tune": -2, "level": 0.95 },
      "snare": { "pattern": [4, 12], "decay": 0.25, "tone": 0.6, "level": 0.7 },
      "ch": { "pattern": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15], "decay": 0.12, "level": 0.45 },
      "oh": { "pattern": [2, 6, 10, 14], "decay": 0.2, "level": 0.35 }
    },
    "bass": {
      "style": "aggressive, rapid 16th patterns",
      "waveform": "sawtooth",
      "cutoff": 0.25,
      "resonance": 0.85,
      "envMod": 0.8,
      "accent": 0.9,
      "slide": true
    },
    "swing": 0,
    "references": ["Mentasm - Second Phase", "Dominator - Human Resource", "Acid Eiffel - Hardfloor"]
  },

  "electro": {
    "name": "Electro",
    "bpm": [110, 125],
    "keys": ["E minor", "A minor", "D minor"],
    "description": "Electro is the original electronic street music—born from hip-hop, raised on Kraftwerk, defined by the TR-808. Afrika Bambaataa's 'Planet Rock' in 1982 fused German electronics with Bronx attitude and created a new form. The 808 is essential: that deep, booming kick that rattles trunks, the snappy electronic snare, the metallic cowbell that became electro's signature. The tempo is slower than house or techno, usually 110-120, giving room for the funk to breathe.",
    "production": "The rhythm is syncopated and funky—not four-on-the-floor but broken patterns with kicks landing on the one and off-beats. The snare typically cracks on two and four but with ghost notes and rolls adding complexity. The cowbell drives the track, often on every quarter note or in syncopated patterns. Claps layer with snares for thickness. The bass is huge and subby, often simple octave patterns but tuned to shake foundations. Synth leads are robotic and melodic—often monophonic arpeggios or single-note hooks. Vocoder vocals add to the mechanical human hybrid aesthetic. The feel is futuristic retro—what 1982 thought 2000 would sound like.",
    "drums": {
      "kick": { "pattern": [0, 6, 10], "decay": 0.5, "tune": -3, "level": 0.95 },
      "snare": { "pattern": [4, 12], "decay": 0.3, "tone": 0.4, "level": 0.75 },
      "clap": { "pattern": [4, 12], "decay": 0.35, "level": 0.6 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.15, "level": 0.4 },
      "rimshot": { "pattern": [2, 8, 10, 14], "level": 0.5 }
    },
    "bass": {
      "style": "huge sub bass, simple patterns",
      "waveform": "square",
      "cutoff": 0.3,
      "resonance": 0.15,
      "envMod": 0.2
    },
    "swing": 20,
    "references": ["Planet Rock - Afrika Bambaataa", "Clear - Cybotron", "Rockit - Herbie Hancock"]
  },

  "drum_and_bass": {
    "name": "Drum and Bass",
    "bpm": [160, 180],
    "keys": ["A minor", "D minor", "E minor", "F minor"],
    "description": "Drum and bass is breakbeat science taken to the extreme—the sound of jungle rhythms time-stretched and reassembled at 170 BPM. Emerging from the UK rave scene in the early 90s, it took hip-hop's breakbeats, sped them up, and added crushing sub bass. The snare hits on 2 and 4 but the kick pattern is complex, syncopated, often following the original break's ghost notes. The tempo feels impossibly fast but the half-time sub bass grounds everything, creating a push-pull between frantic tops and heavy lows.",
    "production": "The break is everything—usually the Amen, Apache, or Think break chopped and rearranged into new patterns. Programming these from scratch requires understanding the original breaks: kicks that land between beats, snares with subtle timing variations, ghost notes that create the rolling feel. The sub bass is a sine wave or filtered square hitting hard on the one, often with pitch bends and slides. It's tuned to specific keys and carefully controlled to avoid muddiness. Higher synth elements—reece basses, pads, strings—fill the mid-range. The mix is split: all the break energy lives above 100Hz, all the weight below it. This separation is crucial.",
    "drums": {
      "kick": { "pattern": [0, 5, 10], "decay": 0.25, "tune": 2, "level": 0.7 },
      "snare": { "pattern": [4, 12], "decay": 0.2, "tone": 0.6, "level": 0.85 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.1, "level": 0.4 },
      "ride": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.25, "level": 0.35 }
    },
    "bass": {
      "style": "sub bass with pitch bends, half-time feel",
      "waveform": "sine",
      "cutoff": 0.2,
      "resonance": 0.1,
      "envMod": 0.1
    },
    "swing": 0,
    "references": ["Inner City Life - Goldie", "Super Sharp Shooter - DJ Zinc", "Brown Paper Bag - Roni Size"]
  },

  "jungle": {
    "name": "Jungle",
    "bpm": [155, 170],
    "keys": ["C minor", "G minor", "D minor"],
    "description": "Jungle is drum and bass's rawer, more soulful ancestor—before the genre got streamlined, when the breaks were chopped rougher and the samples pulled from reggae, ragga, and soul. The Amen break is king here, timestretched and pitch-shifted into new forms, the snare hits crunchy and distorted rather than clean. The tempo is slightly slower than modern D&B, giving more room for the ragga vocals and dub influences. This is sound system music—designed for massive bass bins.",
    "production": "The breaks are treated more aggressively—timestretching creates artifacts that become part of the sound, giving that characteristic crunchy, gritty texture. Snare rolls are constant, creating the 'rollers' feel that defines the genre. The bass is often a reese—a detuned sawtooth creating that growling, moving texture that became jungle's signature. Samples from reggae and dancehall tracks are chopped and looped, often pitching vocals up to create the 'chipmunk' effect. Heavy use of delay and reverb on snares creates space and depth. The overall mix is muddier than modern D&B, warmer, more chaotic—sound system music that prioritizes impact over clarity.",
    "drums": {
      "kick": { "pattern": [0, 10], "decay": 0.3, "tune": 0, "level": 0.75 },
      "snare": { "pattern": [4, 12], "decay": 0.25, "tone": 0.7, "level": 0.9 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.12, "level": 0.45 },
      "oh": { "pattern": [2, 6, 10, 14], "decay": 0.3, "level": 0.35 }
    },
    "bass": {
      "style": "reese bass, detuned and growling",
      "waveform": "sawtooth",
      "cutoff": 0.4,
      "resonance": 0.3,
      "envMod": 0.3
    },
    "swing": 10,
    "references": ["Original Nuttah - Shy FX", "Pulp Fiction - Alex Reece", "Incredible - M Beat"]
  },

  "trance": {
    "name": "Trance",
    "bpm": [135, 145],
    "keys": ["A minor", "D minor", "C minor", "F minor"],
    "description": "Trance is electronic music as transcendence—designed to induce altered states through repetition, build, and release. Born in German clubs in the early 90s, it drew from techno's drive but added emotional melodies and epic structures. The kick is prominent but cleaner than techno, tuned fairly neutral with moderate decay. The tempo runs 138-142 typically, fast enough to be propulsive but not overwhelming. Everything serves the build: layers adding gradually, filters opening, tension accumulating until the breakdown releases it all.",
    "production": "The structure is crucial: long intros building elements one by one, breakdowns stripping everything back to pads and atmosphere, drops returning with full force. Synth leads are bright and emotional—supersaw patches with multiple detuned oscillators creating that huge, shimmering sound. Arpeggios run constantly, often gated to the tempo for a pulsing effect. Pads are massive, occupying the entire stereo field with slow-moving chord progressions. The bassline is simple and driving, usually following the root note with octave variation. Reverb and delay are used extensively to create space and psychedelic atmosphere. The emotional manipulation is deliberate—trance is designed to make you feel.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.4, "tune": 0, "level": 0.9 },
      "clap": { "pattern": [4, 12], "decay": 0.4, "level": 0.65 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.15, "level": 0.45 },
      "oh": { "pattern": [2, 6, 10, 14], "decay": 0.35, "level": 0.4 },
      "crash": { "pattern": [0], "level": 0.5 }
    },
    "bass": {
      "style": "driving, root-note focused with octaves",
      "waveform": "sawtooth",
      "cutoff": 0.45,
      "resonance": 0.2,
      "envMod": 0.35
    },
    "swing": 0,
    "references": ["Age of Love - Age of Love", "Children - Robert Miles", "For An Angel - Paul van Dyk"]
  },

  "minimal_techno": {
    "name": "Minimal Techno",
    "bpm": [120, 130],
    "keys": ["A minor", "C minor", "D minor"],
    "description": "Minimal techno is subtraction as art—taking the elements of techno and asking how few are truly needed. Pioneered by Richie Hawtin, Ricardo Villalobos, and the Kompakt label in the late 90s, it replaced big builds with micro-variations, bombast with hypnosis. The kick is often understated, sometimes barely there—more click than thump. The tempo drops to 125 range, slower than Berlin, allowing each element room to breathe and shift. Tracks evolve over 8-10 minutes through tiny, almost imperceptible changes.",
    "production": "Percussion is textural rather than rhythmic—clicks, blips, filtered noise, organic sounds processed beyond recognition. The hi-hat might be a sliver of white noise, the snare a filtered snap. Elements drift in and out, appearing for 32 bars then vanishing. The bass is often just a sub presence, felt more than heard, pulsing on and off-beats to create movement. When melodic elements appear, they're fragments—a single note repeating with slight filter modulation, a chord appearing once every 16 bars. The mix is pristine and wide, every element placed precisely in the stereo field. This is headphone music as much as club music—details reveal themselves on close listening.",
    "drums": {
      "kick": { "pattern": [0, 4, 8, 12], "decay": 0.25, "tune": 1, "level": 0.7 },
      "rimshot": { "pattern": [4, 12], "level": 0.4 },
      "ch": { "pattern": [2, 6, 10, 14], "decay": 0.1, "level": 0.3 }
    },
    "bass": {
      "style": "subtle sub presence, minimal movement",
      "waveform": "sine",
      "cutoff": 0.2,
      "resonance": 0.1,
      "envMod": 0.1
    },
    "swing": 25,
    "references": ["Spastik - Plastikman", "Fizheuer Zull - Ricardo Villalobos", "Der Klang Der Familie - Various"]
  },

  "breakbeat": {
    "name": "Breakbeat",
    "bpm": [120, 140],
    "keys": ["E minor", "A minor", "G minor"],
    "description": "Breakbeat is the broad church of broken rhythm—any electronic music that doesn't hit four-on-the-floor. The term covers everything from big beat to breaks to nu-skool, but the unifying element is that syncopated, hip-hop-derived kick pattern. The Chemical Brothers and Fatboy Slim brought this to stadiums in the 90s, but the roots go back to electro and hip-hop. The kick lands on the one and off-beats, creating space and bounce that four-on-the-floor can't touch.",
    "production": "The break pattern is usually based on funk breaks—James Brown's drummers, the Winstons, etc.—programmed or sampled and processed. The kick sits heavy on one, often with a second hit around beat 3 or 3.5 creating the signature bounce. Snares crack on two and four with attitude. The energy comes from the interplay between kick and snare rather than the steady pulse of house or techno. Bass lines have room to move and groove, often with funkier patterns than four-on-the-floor allows. Synths can be massive—big acid lines, distorted leads, filtered stabs. The aesthetic is more rock than house, more attitude than subtlety. This is music for fist-pumping.",
    "drums": {
      "kick": { "pattern": [0, 7, 10], "decay": 0.4, "tune": -1, "level": 0.9 },
      "snare": { "pattern": [4, 12], "decay": 0.3, "tone": 0.5, "level": 0.8 },
      "ch": { "pattern": [0, 2, 4, 6, 8, 10, 12, 14], "decay": 0.15, "level": 0.45 },
      "oh": { "pattern": [2, 10], "decay": 0.3, "level": 0.4 }
    },
    "bass": {
      "style": "funky, syncopated, room to move",
      "waveform": "sawtooth",
      "cutoff": 0.5,
      "resonance": 0.3,
      "envMod": 0.4
    },
    "swing": 35,
    "references": ["Block Rockin Beats - Chemical Brothers", "Right Here Right Now - Fatboy Slim", "Firestarter - Prodigy"]
  },

  "ambient": {
    "name": "Ambient",
    "bpm": [60, 90],
    "keys": ["C major", "A minor", "D major", "F major"],
    "description": "Ambient is music as environment—Brian Eno's original definition was 'as ignorable as it is interesting.' Emerging from Eno's experiments in the 70s and evolving through the chill-out rooms of 90s raves, ambient strips away rhythm in favor of texture and space. There may be no drums at all, or just subtle pulses deep in the mix. The tempo, when present, is slow—60-80 BPM—creating a sense of floating rather than moving. This is music for states between waking and sleeping.",
    "production": "Pads are the primary instrument—long, evolving textures created through layered synthesizers with slow attacks and infinite releases. Reverb is massive, often with decay times of 10+ seconds, creating cavernous virtual spaces. Delay feeds back on itself, creating cascading echoes. Field recordings—rain, wind, room tone—blend with synthesized tones. When melodic elements appear, they're sparse and contemplative, single notes or simple intervals rather than progressions. The mix is wide and deep, instruments placed at various distances in the stereo field. Dynamic range is preserved—whisper quiet passages and moments of relative intensity. This is music that rewards patience.",
    "drums": {
      "kick": { "pattern": [0], "decay": 0.6, "tune": -4, "level": 0.3 },
      "ride": { "pattern": [8], "decay": 0.5, "level": 0.2 }
    },
    "bass": {
      "style": "drones, long sustained notes",
      "waveform": "sine",
      "cutoff": 0.15,
      "resonance": 0.05,
      "envMod": 0.05
    },
    "swing": 0,
    "references": ["Music For Airports - Brian Eno", "Selected Ambient Works Vol II - Aphex Twin", "Lifeforms - Future Sound of London"]
  },

  "idm": {
    "name": "IDM",
    "bpm": [80, 160],
    "keys": ["C minor", "A minor", "D minor", "F# minor"],
    "description": "IDM—Intelligent Dance Music—is a problematic name for a real phenomenon: electronic music that prioritizes complexity and experimentation over danceability. Warp Records artists like Aphex Twin, Autechre, and Boards of Canada defined the sound in the 90s: glitchy, fractured beats, unexpected sound design, structures that confound expectations. The tempo varies wildly—from ambient crawl to drill'n'bass frenzy. The 'intelligent' part isn't about being smarter than other dance music; it's about being too weird for the dancefloor.",
    "production": "Drums are often the focus of experimentation—timestretching, granular synthesis, probability-based sequencing creating patterns that never quite repeat. The classic 909 or 808 sounds might appear but processed beyond recognition, layered with glitches and artifacts. Bass can be massive (Aphex Twin's drill bass) or absent entirely. Melody often comes from unexpected sources—detuned synths, mangled samples, sounds that sit ambiguously between tone and noise. The mix might be pristine or deliberately lo-fi. Structure defies verse-chorus conventions—tracks might build for 8 minutes or change completely every 30 seconds. The aesthetic is exploration—following sounds wherever they lead regardless of convention.",
    "drums": {
      "kick": { "pattern": [0, 5, 8, 13], "decay": 0.35, "tune": 0, "level": 0.75 },
      "snare": { "pattern": [4, 11], "decay": 0.2, "tone": 0.6, "level": 0.7 },
      "ch": { "pattern": [0, 2, 3, 6, 8, 10, 11, 14], "decay": 0.1, "level": 0.4 },
      "rimshot": { "pattern": [3, 7, 15], "level": 0.45 }
    },
    "bass": {
      "style": "experimental, processed, unpredictable",
      "waveform": "square",
      "cutoff": 0.5,
      "resonance": 0.4,
      "envMod": 0.5
    },
    "swing": 15,
    "references": ["Windowlicker - Aphex Twin", "Roygbiv - Boards of Canada", "Gantz Graf - Autechre"]
  }
}
