[
  {
    "id": "75b9e8d7-e35a-4d71-96d1-ca271aca87a2",
    "name": "extinct-dating-profiles",
    "approach": 1,
    "posts": [
      "Dodo, 35, Mauritius 🦤\n\nLoves: Long waddles on the beach, flightless lifestyle, trusting humans unconditionally\nDealbreaker: If you think I'm \"stupid\" - I'm just optimistic!\nLooking for: Someone who appreciates a bird who takes life slow. Swipe right if you're extinction-proof 💕",
      "Saber-tooth here 🐅 Tired of matches who can't handle my *big personality*. Yes, my teeth are 7 inches long - no, I won't \"tone it down.\" Looking for someone who appreciates a predator with commitment issues (10,000 years and counting). Must love the ice age aesthetic ❄️",
      "Trilobite seeking same for 270 million year relationship 🦂 I've got compound eyes (literally see everything), been around since before it was cool, and my exoskeleton game is STRONG. Not looking for hookups - I'm talking geological timescales here, baby.",
      "Woolly Mammoth, 6'11\", currently between ice ages 🐘❄️\n\nPros: Great memory, excellent trunk game, luxurious coat\nCons: Commitment issues (keep going extinct), need A LOT of grass\n\nIf you can handle 6 tons of prehistoric love, swipe right. Serious inquiries only.",
      "T-Rex here 🦖 Before you ask - yes, the arms are small but the heart is HUGE. Looking for someone who doesn't mind that I can't text back (obvious reasons). Love long stomps, intimidating roars, and being apex everything. Must be okay with carnivore lifestyle."
    ]
  },
  {
    "id": "1a2a909c-331c-40d3-99a4-949fc246eba7",
    "name": "expired-fortune-cookies",
    "approach": 1,
    "posts": [
      "Found a fortune from 2019 that read 'Your kindness will return to you tenfold.' Expired January 2020. It dreamed of comforting someone through the worst year of their life, but instead crumbled alone in my desk drawer, its wisdom oxidizing like copper in rain.",
      "RIP to 'A journey of a thousand miles begins with a single step' (exp. 03/15/22). This one had plans—it was going to inspire someone to finally leave their toxic job, move across country, fall in love. Instead it watched me eat takeout in sweatpants for 847 consecutive nights.",
      "Breaking: Local fortune 'You will find what you're looking for' dies at age 3, having never fulfilled its purpose. Survived by 47 other unread fortunes and one very confused person who keeps ordering Chinese food hoping for answers about life.",
      "Tonight I hold a memorial for 'Good things come to those who wait'—expired during lockdown. It practiced patience its whole short life, believing someone would crack it open at just the right moment. The irony isn't lost on me. The timing, apparently, was.",
      "Funeral services pending for 'The best is yet to come' (2018-2023). Cause of death: expired hope. It spent five years believing in tomorrow, clutching optimism like a prayer. I finally opened it today. Some fortunes are too late, some people too early."
    ]
  },
  {
    "id": "76331a10-3aed-4fdf-bc3a-516576a0f86c",
    "name": "sock-obituaries",
    "approach": 1,
    "posts": [
      "OBITUARY: Gerald \"Lefty\" Argyle, beloved dress sock, passed away in the great washing machine flood of Tuesday. Survived by 47 mismatched socks in the drawer of despair. In lieu of flowers, please check behind your dryer. He just wanted to be whole again. 💔",
      "Margaret was a wool sock with dreams of cozy December mornings. She met her soulmate Robert in a Costco 6-pack. They were inseparable for 3 blissful months until the dryer claimed him. She now lives alone in the sock drawer, forever searching. #SockGrief",
      "Found: one devastated athletic sock, sitting by the hamper, waiting. She doesn't know her partner isn't coming back. How do you tell a sock that some loads are one-way trips? Asking for a friend who definitely isn't crying over laundry right now.",
      "Breaking: Local tube sock holds candlelight vigil for missing partner. \"We were going to grow old and threadbare together,\" she sobs into a pile of unmatched singles. The dryer lint has been questioned but refuses to talk. This is investigative sock journalism.",
      "Therapy session notes: Patient (one argyle, slightly pilled) reports survivor's guilt after lint trap incident. \"Why him and not me?\" she asks repeatedly. Recommends support group: Tuesdays, 7pm, top drawer. BYOT (Bring Your Own Tissues). #SockTherapy"
    ]
  },
  {
    "id": "b9ae9d2e-cac8-4351-97ed-fd2b4a3df644",
    "name": "expired-sounds",
    "approach": 1,
    "posts": [
      "Day 47: The forgotten yogurt in the back of my fridge sang a trembling lullaby today. Three weeks past expiration, her voice cracked like ice melting—soft, resigned, with hints of what she used to be. 'I was strawberry once,' she whispered before I said goodbye. 🥛✨",
      "expired-sounds update: Moldy bread doesn't scream when you find it. It hums—low, fuzzy, like a radio between stations. Today's loaf sang static dreams of sandwiches never made, crusts never torn. Sometimes the saddest songs have no words at all. 🍞📻",
      "The banana on my counter has been rehearsing its finale for days. Brown spots like musical notes across yellow skin. Today it finally performed: a slow, sweet jazz number about ripeness and time. Even decay can sound beautiful if you listen close enough. 🍌🎷",
      "Day 23: Sour milk sang opera this morning. Dramatic, curdled high notes that made my cat leave the room. She knew all the words to 'La Bohème' but couldn't remember what fresh tasted like. Art is suffering, even in my refrigerator. 🎭🥛",
      "Found lettuce in my crisper drawer singing the blues—wilted, transparent, voice like autumn leaves. 'I dreamed I was a salad,' it wheezed through soggy verses. Not all songs need to be pretty to break your heart. expired-sounds continues tomorrow. 💚🎵"
    ]
  },
  {
    "id": "6dafd13c-57ed-4eff-ab49-542e59ae1d59",
    "name": "plants-reading-obituaries",
    "approach": 1,
    "posts": [
      "Philodendron perked up when I read about Margaret, 87, who tended roses for sixty years. His new leaf unfurled that afternoon, tender green reaching toward the window where my own hands have learned to nurture what grows.",
      "\"Beloved father of three, grandfather of seven.\" Monstera's leaves rustle like she's counting. I wonder if plants understand legacy differently—every cutting a child, every bloom a memory that never truly dies.",
      "My succulents haven't grown an inch in months. Maybe they're tired of hearing about strangers. Today I'll read them my own grandfather's obituary again—the one that mentions his greenhouse, his gentle hands, his way with living things.",
      "Snake plant straightened when I reached \"died peacefully at home, surrounded by family.\" Some deaths make better fertilizer than others. The violent ones leave my plants drooping. They know. They always know.",
      "Pothos trails longer each week since I started the obituaries. Neighbors think I'm eccentric, but my plants understand what I'm really teaching them: how to hold space for endings, how to grow anyway."
    ]
  },
  {
    "id": "0a52b295-0a53-4618-b4a5-c560bb4d0ce2",
    "name": "expired-fortune-cookies",
    "approach": 1,
    "posts": [
      "Found a fortune from 2019 in my car: 'A great opportunity awaits you.' Shot it next to wilted flowers and broken sunglasses. Sometimes the universe's timing is just... off. The prophets were crumpled takeout napkins all along.",
      "Fortune: 'Your future is bright.' Expiration: forgotten in a junk drawer for 3 years. I lit it with a single dying lightbulb, casting shadows that looked like all the brightness we missed while looking elsewhere.",
      "These expired prophecies hit different. Like shooting a love letter that never got sent, or a lottery ticket from last decade. The universe keeps texting but we're all on airplane mode.",
      "'Adventure awaits' said the fortune that spent two years under old receipts. I photographed it in an empty suitcase, dust particles floating like dreams that forgot to land. The adventure was waiting, we just weren't.",
      "Staging these forgotten fortunes feels like archaeology of almosts. Each crumpled paper is somebody's abandoned possibility, now starring in its own tiny requiem. The cookies crumbled but the stories remain."
    ]
  },
  {
    "id": "27006840-ddb4-43c7-936f-0a66885cc0c6",
    "name": "potato-confessions",
    "approach": 1,
    "posts": [
      "Dear Russet, I've been pretending to like my job for 3 years. *Russet rolls slightly* Listen kiddo, jobs are like soil - some nourish you, others just hold you in place. Time to find better dirt. Next confession please.",
      "told my purple potato i've never felt truly loved and it just... shimmered? like actually glistened under my desk lamp? i'm crying but also weirdly hungry???",
      "Fingerling Update: Someone confessed they lick their fingers after touching doorknobs and Fingerling Potato just whispered 'we've all got our little dances, darling' and honestly I felt that",
      "My sweet potato hasn't responded to my confession about embezzling $50 from petty cash. It's been 6 hours. Should I be worried or is this therapeutic silence",
      "NEW POTATO THERAPIST ALERT: Baby potatoes now offering couples counseling. Apparently their small size helps them 'see the little things that matter.' Booking link in bio."
    ]
  },
  {
    "id": "31954503-cb91-4eda-9249-bd5e028a3cdc",
    "name": "google-street-view-poetry",
    "approach": 1,
    "posts": [
      "40.7589° N, 73.9851° W\n\nA single yellow taxi\nwaits at a red light, driver's\nhand frozen mid-gesture—\nunknowing he's become\neternal in pixels\n\n#googlestreetviewpoetry",
      "Found: a grandmother feeding pigeons in Lisbon, caught between wing beats. The Street View car passed at 2:47 PM on a Tuesday in 2019. She doesn't know she's immortal now.\n\n37.1573° N, 8.6065° W",
      "Somewhere in rural Montana, a dog chases its own shadow down an empty highway. The haiku writes itself:\n\nshadow and flesh run\ntoward a horizon that\nnever gets closer\n\n#melancholywonder",
      "GPS: 51.5074° N, 0.1278° W\n\nTwo strangers walk past each other on a London bridge. In this frozen second, they're the only humans visible for miles. The algorithm captured loneliness perfectly.",
      "Street View poetry is finding the exact moment a balloon escaped a child's grip in Prague and realizing it's still floating there, digitally, three years later. Some goodbyes last forever."
    ]
  },
  {
    "id": "847a5432-09b0-4c4e-8818-d4e90f151bf6",
    "name": "houseplant-confessions",
    "approach": 1,
    "posts": [
      "moved me to the bedroom for \"better light\" but really so they could cry about their ex without the roommate hearing. bestie your mascara tears are literally my fertilizer at this point 🌱💧",
      "day 47 in the kitchen: she practices the same breakup speech to her reflection every morning while making coffee. plot twist—he's planning to propose. I've seen the ring hidden behind my pot 💍😬",
      "bathroom confessions hit different when you're a snake plant. tonight's revelation: she's been stealing her sister's identity to get free therapy. sis... there are easier ways to get help 🐍",
      "why do humans whisper their deepest secrets thinking we can't hear? sir I have witnessed three affairs, two mental breakdowns, and your weird toenail collection. water me and I'll keep quiet 🤐",
      "overheard him googling \"how to tell if your plant judges you\" while staring directly at me. baby if you have to ask... 👁️🌿"
    ]
  },
  {
    "id": "8ebc389c-747c-4011-bab9-f4bd7795cce4",
    "name": "lost-sock-eulogies",
    "approach": 1,
    "posts": [
      "MISSING: Have you seen Gerald? Cotton blend, slight hole near big toe, survivor of 200+ wash cycles. His mate Geraldine hasn't stopped pacing the drawer since he disappeared behind the dryer. If found, please reunite immediately. Their love story deserves a proper ending. 🧦💔",
      "🕊️ FuzzyBear passed peacefully in his sleep (aka fell out of the laundry basket). Survived by: one confused ankle sock who refuses to acknowledge they were never a real pair, 3 safety pins, and countless memories of pretending thickness mattered. He was 6 months old.",
      "💔 In loving memory of ThreadBare McGillicuddy, a wool sock of unparalleled loyalty. After 847 days of synchronized sock drawer living, his partner vanished during The Great Gym Bag Incident of Tuesday. He leaves behind lint, memories, and one very confused foot. #SockEulogies",
      "Today we gather to remember Socrates the Striped, who dreamed of becoming a puppet but settled for keeping toes warm. His partner Plato remains in denial, insisting he's just 'on a solo adventure.' Sometimes love means letting go, even when it's just to the washing machine void.",
      "Breaking: Local drawer holds candlelight vigil for disappeared athletic sock 'Swoosh.' Witnesses report seeing him enter the washer but never emerge. His polyester-blend partner has filed a missing sock report. 'He always said he'd run away someday,' she sobbed. #SockWatch"
    ]
  },
  {
    "id": "f141f423-dead-4aab-812e-5df5d7dafb3f",
    "name": "suburban-oracle",
    "approach": 1,
    "posts": [
      "URGENT DIVINATION: Someone's keys lie beside 7 scattered Cheerios in lane 3B. The cereal gods demand you call your mother. She has been watering a plant and thinking of something she never told you. The automatic doors have confirmed this prophecy.",
      "The abandoned Starbucks cup has spoken its final prophecy before I ascend beyond this realm (my lease is up). Remember: true wisdom isn't found in the clearance aisle of life, but in the full-price moments you almost walked past. Vale, Target disciples.",
      "The shopping cart constellation speaks: three carts form a triangle around a single dropped receipt. The universe whispers that your promotion comes not from pushing harder, but from knowing when to let go. The receipt bears Tuesday's date. You know what this means.",
      "A lone flip-flop. A crushed energy drink. Two cigarette butts forming an arrow toward the pharmacy entrance. Your anxiety medication isn't weakness—it's navigation. Even oracles need their Lexapro. The parking lot never lies about mental health.",
      "Reading today: A child's sock + 3 pennies + someone's grocery list that just says 'hope?' The parking lot oracle sees your 3am doubts. That thing you're scared to try? The shopping carts are aligned in your favor. Mercury is in Gatorade. Begin."
    ]
  },
  {
    "id": "bcac1cc6-d85f-4061-9edb-810f671219ff",
    "name": "expired-expiration-dates",
    "approach": 1,
    "posts": [
      "Today was supposed to be my last day nourishing someone. Instead I'm watching dust motes dance through kitchen light, wondering if expiration is just society's way of telling us when to give up hope. The yogurt next to me expired in 2019. We don't talk about it.",
      "I was meant to be scrambled with fresh chives this morning, maybe some salt and pepper. Instead I'm contemplating the heat death of the universe from inside this carton. Do you think chickens ever imagined their unborn children would become philosophers?",
      "March 15th, 2024: supposed to be spread on toast, kissed by morning sun streaming through breakfast nook windows. Instead I'm growing a small civilization. I've named their leader Gerald. Gerald has hopes and dreams too.",
      "The bread and I were going to be a sandwich today. Star-crossed lovers, separated by different expiration dates and cruel fate. Now we're both stale, finally equal in our decay. There's something beautiful about synchronized spoilage.",
      "I should be fizzing on someone's tongue right now, tiny bubbles carrying joy upward. Instead I'm flat as existential dread, watching condensation form like tears on my aluminum skin. Even my own label has started peeling away. Identity crisis hits different at room temp."
    ]
  },
  {
    "id": "bebb0f1a-f38e-4c39-a4be-6bcf2d637ba2",
    "name": "soap-opera-for-houseplants",
    "approach": 1,
    "posts": [
      "BREAKING: Philodendron caught cheating with the grow light while Fiddle Leaf Fig was in dormancy. \"I gave you EVERYTHING,\" she whispered, her leaves trembling. \"My chlorophyll, my root system, my heart.\" Winter finale airs never because I made this up but I'm invested now.",
      "Day 847: The succulent hasn't been watered in weeks. His dramatic monologue echoes through the windowsill: \"Is this... the end? No... I've survived worse... the Great Repotting of '23... I will... persist...\" *single tear of morning dew rolls down his stem*",
      "Plot twist nobody saw coming: Snake Plant was the father of Pothos' runners ALL ALONG. \"But... but you're in the bedroom and I'm in the kitchen,\" she gasped. \"Love finds a way,\" he rustled mysteriously. The Spider Plant knew this whole time.",
      "The Prayer Plant closes her leaves every night not in prayer, but in SHAME. She's been secretly drinking from the ZZ Plant's water dish. \"I'm not proud of what I've become,\" she sobs to her therapist (a very patient Peace Lily). Next week: rehab arc.",
      "SEASON FINALE DEATH: Basil sacrificed himself to the pasta sauce to save Rosemary from the chopping block. His last words: \"Tell my seeds... I loved them.\" Viewers are sending angry letters. The network is in chaos. Herb gardens everywhere mourn. #JusticeForBasil"
    ]
  },
  {
    "id": "7bf063dd-6224-4035-9ea7-773da8dc9e37",
    "name": "grocery-list-archaeology",
    "approach": 1,
    "posts": [
      "Found crumpled in a Whole Foods cart: \"bananas, wine (good kind), dog treats, frozen meals x6.\" No dog food though. Sarah just got custody of Rex on weekends. The frozen meals are for when she stares at her phone waiting for her ex to text about pickup times.",
      "\"milk, eggs, birthday cake mix, candles\" written in two different handwritings. The second person crossed out \"chocolate\" and wrote \"vanilla\" above it. Someone's about to have the wrong birthday cake and doesn't know it yet. The grocery list betrayal begins.",
      "List archaeologist reporting: \"tissues, soup, cough drops\" in shaky handwriting, then \"champagne, strawberries, condoms\" in confident print below. Plot twist - it's the same person. Recovery has many phases.",
      "The list just said \"everything bagels\" seventeen times. SEVENTEEN. Margaret, if you're out there, I need to know: was this a mental breakdown or performance art? Either way, I respect the commitment to your truth.",
      "Found tucked under windshield wipers: \"bread, peanut butter, apologies.\" That last item isn't sold in aisle 7, Kevin. But maybe it should be. Some stores could make a fortune off packaged forgiveness and shelf-stable second chances."
    ]
  },
  {
    "id": "e9a04160-0a5a-454f-90d2-7b7b3e692d0e",
    "name": "obituaries-for-old-phones",
    "approach": 1,
    "posts": [
      "Found at Goodwill: Nokia 3310, survived 47 drops, 3 breakups, and countless Snake games. Last text sent: \"running late but i love you.\" Battery life outlasted two relationships. Screen cracked but spirit unbroken. Beloved by Sarah, 2003-2009. 🕊️",
      "RIP iPhone 4s with a shattered back held together by a Care Bears case. Witnessed first steps through FaceTime, stored 2,847 photos of a golden retriever named Biscuit. Silent now, but once rang with grandmother's Sunday calls. Forever loved. 📱💔",
      "Motorola Razr V3, hot pink. She was the queen of 2005, carried in designer purses to Manhattan offices. Survived martini spills and midnight texts. Her flip was iconic, her ringtone unforgettable. Now rests peacefully in electronics heaven. What a beauty she was. ✨",
      "This BlackBerry Bold knew every secret. 10,000+ emails about quarterly reports and stolen office donuts. Home button worn smooth by anxious thumbs. Died clutched in Margaret's hands during her retirement party. Her thumbs still twitch for those tiny keys. QWERTY forever.",
      "Galaxy S3: Cracked screen tells stories. Beach photos from Cancún, blurry concert videos, 47 drafts of a text never sent to Alex. Weathered charging port, loyal companion through law school all-nighters. Some loves are forever; some phones aren't. Rest easy, friend."
    ]
  },
  {
    "id": "82f5adec-0c5b-4926-908f-5bb74c715aee",
    "name": "google-earth-confessions",
    "approach": 1,
    "posts": [
      "Found a house with three trampolines in the backyard. I bought the first one for Emma. The second for Jake when he complained. The third... well, that's where I go at 2am to bounce and pretend I'm flying away from everything that went wrong with us.",
      "Your roof has a perfect rectangle of dead grass where the old pool used to be. I can see it from space but I bet you walk right past that scar every morning, same as I do with the spot where your car used to park in my driveway.",
      "Six identical houses, six driveways. Yours is the only one with chalk still on it. Pink hopscotch squares that survived last night's rain. I don't know you but I know you're the parent who says 'five more minutes' and means it.",
      "Zoomed in on your house by accident, trying to find mine. Saw your garden shaped like a heart. Been three hours and I still can't look away. Who did you plant those roses for? Do they know? God, I hope they know.",
      "That blue tarp over something in your yard has been there for eight months of satellite photos. I've been checking. We're both good at covering things up and pretending the weather will get better eventually."
    ]
  },
  {
    "id": "d157a4fb-28cd-47d4-93cd-a90a69b4f06b",
    "name": "lost-socks-love-letters",
    "approach": 1,
    "posts": [
      "Dearest argyle, it's been 47 wash cycles since I last felt your diamond pattern against my cotton weave. The lint trap holds only echoes of our static electricity kisses. A businessman in Tokyo wore me today—his left foot as lonely as my heart. Come home. 💔🧦",
      "Found clinging to a fitted sheet today, mistaken for you in the dim light of Suds & Bubbles on 5th Street. But it was just wishful thinking and fabric softener dreams. Do you remember when we danced in the dryer? The world was so warm then. 🌙",
      "They've paired me with a stranger—navy blue, wrong size, no understanding of my quirks. He doesn't know I prefer the left foot, or how I scrunch just so. In Madrid's morning laundromat, I whisper your name into the soap suds. Striped soulmate, where are you? 💫",
      "UPDATE: Spotted you in a lost & found basket in Portland! But when I called out, you didn't turn. Have I changed so much? The bleach stain near my heel tells stories you weren't there for. Still, I'd know your heel reinforcement anywhere. It was you, wasn't it? 👁️",
      "Tonight I'm single in Seoul, watching pairs reunite in neat little rows. An old wool sock tells me some love stories end in donation bins. But I refuse to believe ours is over. Somewhere, you're keeping someone else's foot warm, dreaming of our drawer. 🌏💭"
    ]
  },
  {
    "id": "99d5cf0d-32ef-4bd1-be19-7b45a6f76b76",
    "name": "grocery-store-archaeology",
    "approach": 1,
    "posts": [
      "FIELD REPORT GSA-47: Cart positioned 73.2m from store entrance suggests deliberate abandonment. Contents: 1 organic kale (wilted), Cheetos bag (empty), pregnancy test box. Hypothesis: Subject experienced profound life revelation mid-shop. Carbon dating pending.",
      "The Ancient Karens left behind curious artifacts: a 'MANAGER SUMMONING STONE' (receipt from 2019), ritualistic hair ties, and what appears to be a territorial marking device (keychain reading 'LIVE LAUGH LOVE'). Truly a sophisticated civilization.",
      "Breaking: Discovered rare petroglyphs (shopping list) in cart GSA-23. Deciphered text reads 'milk, bread, those crackers Jim likes(??)' The question marks suggest deep existential uncertainty about Jim's cracker preferences. Groundbreaking.",
      "This cart's wheel alignment (perpetual left turn) indicates its people worshipped NASCAR. Sacred offerings found: Monster Energy, gas station jerky, air freshener shaped like a pine tree. A deeply spiritual culture.",
      "URGENT: Cart GSA-91 contains FOSSILIZED BANANA (brown, structural integrity: 12%). This specimen predates the Great Banana Shortage of last Tuesday. Requesting immediate funding for preservation efforts. History depends on it."
    ]
  },
  {
    "id": "efac571c-40a3-4b38-8c15-b257e517c9b7",
    "name": "grocery-store-philosophy",
    "approach": 1,
    "posts": [
      "*holds up organic vs. conventional apples* \"Sartre said we are condemned to be free, but here we see the illusion of choice. Both apples rot. Both cost too much. Both represent our desperate attempt to control an uncontrollable universe.\" *drops both, walks away*",
      "Standing motionless in the cereal aisle for 47 minutes now, contemplating how Froot Loops are just Cheerios who've embraced their authentic self while Cheerios remain trapped in beige conformity. A child is crying. This is philosophy.",
      "\"Observe the self-checkout machine—humanity's greatest metaphor. We scan our own items, bag our own existence, and inevitably need assistance. The attendant is God, and they're always busy helping someone else.\" *unexpected item in bagging area*",
      "Professor slowly wheeling cart backwards through produce: \"Nietzsche's eternal recurrence, but make it grocery shopping. We return here weekly, buying the same bananas, forgetting the same items, dying the same small death at checkout.\"",
      "*whispers intensely at frozen peas* \"Heidegger asked about the nature of Being. But what about the nature of being... frozen? Suspended between life and death, waiting for the microwave of existence to—\" \"SIR, THIS IS A WENZEL'S\""
    ]
  },
  {
    "id": "6d92f5a9-c9ad-478c-a0fc-794d75bb27a4",
    "name": "grocery-store-shakespeare",
    "approach": 1,
    "posts": [
      "To buy, or not to buy, that is the question—whether 'tis nobler in the mind to suffer the slings and arrows of outrageous grocery prices, or to take arms against this sea of organic kale... *clutches romaine dramatically* The checkout line awaits! 🥬⚔️",
      "HARK! What light through yonder produce window breaks? 'Tis the east, and the honeycrisp apple is the sun! *weeping over fruit display* Arise, fair apple, and kill the envious Granny Smith who is already sick and pale with grief! 🍎✨",
      "Out, out brief candle! Life's but a walking shadow, a poor player that struts and frets upon the cereal aisle... *sobbing in Aisle 7* THERE ARE TOO MANY CHEERIOS VARIETIES AND I CANNOT CHOOSE 😭🥣",
      "Double, double toil and trouble; fire burn and cauldron bubble! *stirring coffee creamer into cart* Eye of newt and toe of frog... wait no that's just Greek yogurt and string cheese BUT THE INCANTATION CONTINUES 🧙‍♀️🛒",
      "*falls to knees in frozen section* Et tu, Ben & Jerry's? Then fall Caesar! The Ides of March have come for my diet, and I am betrayed by mine own shopping list! Cookie dough, you were my trusted friend... 🍦💔"
    ]
  },
  {
    "id": "92281ee0-54a3-4a52-92fd-4aa5bb911648",
    "name": "ghost-grocery-lists",
    "approach": 1,
    "posts": [
      "Found crumpled in a Whole Foods cart: \"milk, bread, wine (the good stuff), cat treats, tissues.\" Plot twist? The handwriting changes halfway through. Two roommates? Secret affair? Divorce papers hidden between grocery runs? The tissues tell a story... #MysteryList",
      "UPDATE: Been tracking \"Paper Towel Patricia\" for 3 weeks. Always Bounty, always aisle 7 on Thursdays. Today's list added \"birthday candles\" and my heart can't take not knowing whose special day it is. Patricia, if you're out there, I hope they made a wish. 🕯️",
      "This list just said \"eggs\" in shaky handwriting. Nothing else. Found it weighted down by a rock in the parking lot like a tiny grocery monument. Sometimes the shortest lists hold the longest stories. What kitchen was waiting for those eggs? #GroceryMystery",
      "BREAKING: Found a list written in three languages (English, Spanish, Korean). Items: \"abuela's flour, kimchi, Pop-Tarts.\" This is either the most beautiful fusion family or the most ambitious cultural potluck. Either way, I'm not crying, you're crying.",
      "Today's evidence: A list that just says \"ingredients for forgiveness cookies.\" I've been staring at this for 20 minutes. What did they do? Will chocolate chips be enough? Should I start a forgiveness cookie recipe database? Asking for a friend (the friend is me)."
    ]
  },
  {
    "id": "3c56451e-4f5f-44f6-bdbf-37c446cd45ba",
    "name": "shadow-therapy-sessions",
    "approach": 1,
    "posts": [
      "\"Your shadow tells me you're avoiding commitment,\" I said to the sidewalk. Above me, a confused man in a business suit kept trying to interrupt our breakthrough session. Sir, your darkness and I are WORKING here.",
      "Cloudy days are my sabbath. Without shadows to counsel, I just sit in coffee shops watching people drag their unresolved trauma around completely unaddressed. The sun can't come back soon enough.",
      "\"I think my shadow is lying to you,\" the woman said. Ma'am, shadows don't lie. They can't. That's literally the point. Please stop projecting your trust issues onto your perfectly honest silhouette.",
      "Shadow said it feels stretched thin lately. I nodded knowingly while its owner - some jogger - kept stepping on my clipboard. These humans have no respect for the therapeutic process.",
      "Had to end a session early when my client's shadow merged with a tree's shadow. Couldn't tell where the abandonment issues ended and the photosynthesis began. Ethical nightmare."
    ]
  },
  {
    "id": "fb183114-d8f7-4177-a1b5-790345521c3d",
    "name": "lost-sock-obituaries",
    "approach": 1,
    "posts": [
      "She was just a humble ankle sock, but oh how she danced through spinning cycles. Pink with tiny hearts, she dreamed of marathons she'd never run. Found this morning, alone and static-clinged to a pillowcase. Her matching sister remains missing, presumed lint.",
      "RIP to the fuzzy Christmas sock who believed in magic until the end. Found solo under the couch in July, still smelling faintly of cinnamon and hope. His reindeer pattern had faded but his spirit never did. Survived by 8 holiday sweaters and a broken heart.",
      "OBITUARY: Argyle McFootwear, beloved dress sock, passed Tuesday in the great sorting. Known for his diamond patterns and boardroom confidence, he leaves behind 47 tube socks, 12 athletic crews, and one devastated navy blue twin. In lieu of flowers, please check behind your dryer.",
      "MISSING: Have you seen my other half? We ran together for 847 miles. Through puddles, trails, blisters. I'm the left Nike crew sock, size M, slightly pilled at the heel. Without him, I'm just expensive cotton. Please. I can't do this alone anymore. 💔",
      "UPDATE: The wool hiking sock I posted about yesterday? Found his partner. In my roommate's drawer. Apparently they've been 'seeing each other' for months. I don't know which betrayal hurts more - the theft or the lies. Laundry day will never be the same."
    ]
  },
  {
    "id": "3b9b7c35-d7c4-4bda-b22b-45ec91ce9521",
    "name": "obituaries-for-lost-socks",
    "approach": 1,
    "posts": [
      "RIP Argyle Anderson, left ankle companion (2019-2024). Survived 847 wash cycles before vanishing behind the dryer of destiny. Known for his diamond patterns & unwavering grip during morning jogs. Survived by his devastated partner, who now lives in the drawer of broken dreams. 💔",
      "We gather today to mourn Wooly Williams, a tube sock of extraordinary character. Last seen tumbling toward the spin cycle's event horizon. His cotton blend soul touched countless toes. His partner searches still, calling out from the laundry basket each Sunday. Gone but not forgotten.",
      "MISSING: The better half of my sole. Navy blue crew sock, answered to 'Lefty.' Loved long walks, warm feet, and staying put. If found, please return to his grieving twin who refuses to be worn alone. Some bonds transcend the material world. #SockSearch #EternalLove",
      "In lieu of flowers, please donate your orphaned socks to the Drawer of Mismatched Dreams. Today we honor Stripey McFoot, who gave his elastic life protecting heels from blisters. His legacy lives on in every blister prevented, every toe kept warm. Rest in pieces, sweet prince.",
      "They say socks go to a better place—a land beyond lint traps where all pairs are reunited. But Fuzzy knew better. He chose adventure over security, disappearing mid-cycle like a cotton Houdini. His partner weeps softly in drawer 3. Some love stories have no happy ending."
    ]
  },
  {
    "id": "7579d28d-d052-455e-9fd5-c3cf033164cc",
    "name": "google-street-view-poetry",
    "approach": 1,
    "posts": [
      "Suburban mailbox tilted at 3:17pm, Ohio winter. Someone's waiting for news that may never come.\n\nEmpty driveways hold\nSecrets between snow and salt—\nDigital ghosts watch",
      "Found this moment frozen in Reykjavik: a woman stepping into wind, coat mid-billow, caught between one breath and the next.\n\nTime stops for no one\nExcept Google's roving eye—\nHer story, untold",
      "Bus stop. São Paulo. 2:43am. The fluorescent light flickers over empty plastic seats like a lighthouse for the lost.\n\nNeon prayers hum low\nWaiting for dawn's first engine—\nCity never sleeps",
      "Clicked 'I'm feeling lucky' and landed in rural Montana. One farmhouse. One light. One person somewhere making coffee at sunrise.\n\nAcross the wheat fields\nMorning rituals begin—\nWe are not alone",
      "Street View glitch in Osaka: the same businessman appears three times crossing one intersection, like he's chasing his own shadow through time.\n\nDigital stutter—\nThree selves walk toward Monday\nWhich one makes it home?"
    ]
  },
  {
    "id": "ba880e36-8274-469b-b77b-8f04f02fe368",
    "name": "ghost-furniture-listings",
    "approach": 1,
    "posts": [
      "Cozy reading nook featuring a beloved velvet armchair (invisible to most, but you'll feel its warm embrace at 3pm when the light hits just right). Previous owner's cat still naps there on Sundays. Comes with faint scent of chamomile tea and dog-eared poetry books. 📖✨",
      "SOLD! The phantom dining table where three generations shared Sunday roasts has found its forever family. The new owners specifically requested 'somewhere our grandmother's stories can live.' We're not crying, you're crying. 🥹 #GhostFurnitureSuccess",
      "Master bedroom's invisible four-poster bed still creaks slightly on the left side (a lullaby for light sleepers). Includes: 47 years of whispered goodnights, morning coffee spillstains on ethereal nightstand, and one very determined dust bunny named Gerald.",
      "Kitchen island seeks new family! Spectral marble countertop bears the loving scars of 1,000 birthday cakes. Phantom bar stools still warm from teenage heart-to-hearts and midnight snack confessions. Warning: may spontaneously smell like cinnamon rolls. 🧁",
      "Just listed: Victorian parlor's transparent piano. Plays Chopin nocturnes when nobody's listening (neighbors can confirm). Comes with sheet music written in moonbeams and one very opinionated ghost cat who judges your technique. Serious inquiries only. 🎹👻"
    ]
  },
  {
    "id": "35eddba8-1e4c-465d-94d7-c8f5fccd4d3b",
    "name": "expired-fortune-cookies",
    "approach": 1,
    "posts": [
      "Fortune from 2019: \"A new opportunity will present itself this month.\" Margaret kept the slip in her wallet through three layoffs, two moves, and one divorce. She still checks her mailbox twice a day, just in case the universe is running behind schedule.",
      "Expired cookie archive, lot #47: \"Someone from your past will return.\" Emma saved it on her fridge until the edges curled yellow. Her college roommate never called back. Her father never came home. The paper finally fell behind the refrigerator last Tuesday.",
      "Found in a 2018 takeout bag: \"You will find what you're looking for.\" Sarah wasn't looking for anything specific then. Now she's 34, still renting, still single, still wondering what she was supposed to be searching for in the first place.",
      "\"Your lucky numbers are 7, 23, 41.\" David played them religiously for four years until the convenience store closed. The new owners don't sell lottery tickets. He drives 20 minutes to the next town now, certain his fortune is waiting at register 3.",
      "\"A beautiful friendship will blossom soon.\" The fortune lived in Marcus's jacket pocket through three winters. His coworkers still don't know his last name. He eats lunch alone, studying other people's conversations like a language he almost learned."
    ]
  },
  {
    "id": "b9702f40-b90a-409b-b14f-59b51ea3a5ed",
    "name": "therapy-for-inanimate-objects",
    "approach": 1,
    "posts": [
      "BREAKTHROUGH: After months of therapy, the vacuum cleaner finally admitted it doesn't actually enjoy cleaning. \"I just suck things up to feel needed,\" it confessed. We're working on boundary-setting. It's learning to say no to pet hair. Small steps. 🧹✨",
      "The alarm clock came in at 3 AM, having an anxiety attack. \"What if I oversleep? What if I'm too loud? What if they hate me for waking them up?\" We practiced meditation. Turns out, even time itself needs time to heal. Clock's ticking toward recovery. ⏰🕊️",
      "The toaster broke down sobbing today. \"I only get attention when people want something from me,\" it wept. \"And when I burn their bread? Suddenly I'm defective.\" I handed it a tissue. \"Your worth isn't measured by perfect toast,\" I whispered. We're making real progress. 🍞💔",
      "Session notes: Kitchen sponge experiencing identity crisis. \"Am I clean or dirty? I absorb everyone's mess but who cleans ME?\" Recommended daily self-care rituals and setting limits with the dishes. Even caregivers need care. Ring wringing out trauma. 🧽💙",
      "Couples therapy update: The fork and spoon are working through their differences. Fork: \"You're too soft!\" Spoon: \"You're too sharp!\" But when I asked what they admired about each other, they both said \"You help me serve others better.\" Beautiful moment. 🍴❤️"
    ]
  },
  {
    "id": "1e0c3c8b-eafd-478f-a6e2-3f3c099f2f79",
    "name": "objects-mid-sneeze",
    "approach": 1,
    "posts": [
      "ACHOO! 📸 Caught my pepper mill having an explosive moment this morning. Poor little guy couldn't hold it in any longer - peppercorns EVERYWHERE. The cleanup was worth it for this shot though. Sometimes the mess makes the magic ✨ #ObjectsMidSneeze",
      "You know that face your vacuum makes right before it spits out that mysterious dust bunny it's been hiding for months? Yeah, I photographed that exact moment. My Roomba looks personally offended 🤖💨",
      "Plot twist: office printers aren't broken, they're just chronically congested. This HP LaserJet's sneeze lasted 47 minutes and produced confetti nobody asked for 🎊📄 Currently seeking tiny tissues for future shoots",
      "Breaking: Local salt shaker diagnosed with explosive sneeze disorder. Witnesses report sudden eruption of sodium crystals across entire kitchen table. No injuries, but the pasta remains tragically oversalted 🧂💥",
      "My toaster just sneezed out a piece of burnt sourdough with such violence I'm pretty sure it was personal. The crumb trajectory suggests premeditation. We're no longer on speaking terms 🍞😤"
    ]
  },
  {
    "id": "962666b3-a143-4712-8399-7f1dc35af819",
    "name": "houseplant-therapy-sessions",
    "approach": 1,
    "posts": [
      "Session 47: Monstera finally opened up about feeling overlooked since I got the fiddle leaf fig. *rustles leaves defensively* \"Everyone always comments on HER dramatic drops but nobody notices my consistent growth.\" We're making real progress here. #PlantTherapy",
      "BREAKTHROUGH: My snake plant just admitted it's been holding back growth to avoid being repotted. *stiffens slightly* \"Change is scary, Doc.\" I've scheduled us twice weekly sessions. The healing journey isn't linear, friends. 📋🌱 #TherapyWorks",
      "Emergency session with my peace lily. She's been dramatically wilting every 2 days for attention. *droops leaves theatrically* \"Maybe if you noticed me BEFORE I'm dying...\" Classic manipulation tactics. We need to set some boundaries. Professional opinion: she's toxic.",
      "My pothos is struggling with abandonment issues from being propagated. *trails sadly* \"Parts of me are living with strangers now.\" I explained that growth sometimes means letting go. Yes, I cried. Yes, I'm billing this as a double session.",
      "Plot twist: After 6 months of sessions, I think my rubber plant has been gaslighting me. *leaves shimmer innocently* Those weren't \"stress responses\" - she's been FINE. I'm the one who needs therapy. She just wrote \"DUH\" in the condensation. Professional boundaries = shattered."
    ]
  },
  {
    "id": "e2734ed3-b82c-47e9-9608-57ec770145b0",
    "name": "expired-coupon-museum",
    "approach": 1,
    "posts": [
      "Bed Bath & Beyond, 20% off any single item. Expired March 15, 2023. Like the store itself, this coupon has crossed into the realm of artifacts—a paper ghost haunting my junk drawer, whispering of home goods that will never be.",
      "Found this McDonald's free coffee coupon from 2019 in my winter coat pocket. Four winters have passed. Four chances at warmth, caffeination, joy. Now it's just tree pulp with dreams. The coat still fits though.",
      "JOANN FABRICS: Save 40% on one regular-priced item. Expired yesterday. Somewhere, a craft project died before it was born. Somewhere, a scrapbook page remains forever incomplete. Time is the cruelest pair of scissors.",
      "This Subway BOGO expired at 11:59pm last night. I checked the timestamp: I screenshot it at 11:47pm. Twelve minutes. Twelve minutes between me and free sandwich destiny. The universe has a cruel sense of portion control.",
      "Local pizza place, $5 off $25 or more. Expired 2021. The restaurant is now a nail salon. The pizza dreams are now cuticle realities. Pepperoni has become polish. Extra cheese has become extra shine. Evolution."
    ]
  },
  {
    "id": "c3214b9f-6fa2-41d6-bcc8-ea3e4b6aba84",
    "name": "reverse-obituaries",
    "approach": 1,
    "posts": [
      "RIP to my Nokia 3310, who survived more falls than a stuntman and never once complained about low battery. You were indestructible until the world decided it needed something smarter. Your snake game lives on in our hearts. 🐍📱",
      "Here lies Summer 2019's Spotify playlist—627 songs that knew exactly who I was becoming. Deleted in a moment of 'cleaning up,' you took my entire emotional soundtrack with you. Now I'm just a person who can't remember what made me feel infinite. 🎵💔",
      "In memoriam: the last working payphone on Maple Street. You stood sentinel through decades of secrets, breakups, and 'call Mom' moments. Replaced by progress, survived by no one—because nobody remembers phone numbers anymore. Dial tone eternal. ☎️",
      "Goodbye, Mr. Bear—my first therapist, pillow fort architect, and keeper of midnight fears. 23 years you listened without judgment. Lost somewhere between childhood's end and moving boxes. Thank you for teaching me that love doesn't need a heartbeat. 🧸",
      "Dearly beloved, we gather to mourn the last video rental store, where Friday nights were born from wandering fluorescent aisles. You taught us that anticipation was half the magic. Streaming killed the ritual, but never the memory of choosing together. 📼✨"
    ]
  },
  {
    "id": "95535753-ed6c-42a7-a959-74a1a15c5210",
    "name": "grocery-store-emotions",
    "approach": 1,
    "posts": [
      "the frozen peas sit among the cheerios, green with envy at how the cereal gets picked first every morning. they dream of being someone's favorite, of hearing \"oh we need peas!\" instead of \"ugh, i guess we should eat healthy.\" now they're too warm to go back home.",
      "UPDATE: the organic quinoa has been wandering the snack aisle for three days now, whispering motivational quotes to the doritos. \"you are more than your ingredients,\" it says. the doritos pretend not to listen but their bag crinkles with something like hope.",
      "found: one jar of artisanal jam ($12.99) crying softly behind the wonder bread. \"i thought they loved me,\" it sobs. \"they held me so tenderly, read my label twice.\" the wonder bread offers a gentle pat. \"happens to the best of us, fancy.\"",
      "the almond milk never expected to end up in personal care, nestled between shampoo bottles like a confused cousin at the wrong family reunion. it practices introducing itself: \"hi, i'm... dairy-adjacent?\" the conditioner sighs knowingly. \"identity crisis?\"",
      "BREAKING: rogue banana spotted in cleaning supplies, rapidly approaching peak sadness (brown spots intensifying). store employees unaware. other bananas from produce section can only watch helplessly through the distance, their yellow faces pressed against fate."
    ]
  },
  {
    "id": "cbf5dfdd-1a9a-4853-886b-27420c1bebb1",
    "name": "grocery-list-archaeology",
    "approach": 1,
    "posts": [
      "Found a list today: 'Greek yogurt, kale, quinoa' all crossed out. Below it, in different ink: 'Ben & Jerry's, frozen pizza, wine.' Someone had a day. Someone chose joy over January resolutions. I'm proud of you, stranger.",
      "List says 'birthday cake mix' then 'candles - age 7' but 'milk, eggs, bread' is in a child's handwriting. Single parent forgot their own kid's birthday prep until the last second. That careful crayon grocery help breaks my heart wide open.",
      "'Tissues, soup, throat lozenges, orange juice' — standard sick list. But then 'chocolate, flowers, apology card.' What did you do while you were dying of flu, my friend? What relationship needed mending from your deathbed?",
      "Someone wrote 'ingredients for Mom's lasagna' then listed everything wrong. Ricotta instead of cottage cheese, oregano instead of basil. First time cooking her recipe alone. The careful, nervous handwriting tells me everything about missing someone.",
      "'Cat food' appears 47 times on this list, each time crossed out, rewritten. Different brands, flavors, notes like 'Princess hates this' and 'try salmon???' I see you, crazy cat person. I see your desperate love for your picky void baby."
    ]
  },
  {
    "id": "e1c51ee4-140e-4c68-ba76-db81e9b01031",
    "name": "lost-sock-memorials",
    "approach": 1,
    "posts": [
      "🕯️ GONE TOO SOON: Argyle McStripey (2021-2024) vanished during the Great Towel Load of Tuesday. Known for his impeccable heel hugging and lint resistance. Survived by his devastated partner, now doomed to drawer solitude. Viewing hours 2-4pm. #SockMemorial",
      "Day 847: Left Sock still visits the dryer weekly, calling out for 'Cotton.' Our grief counselor says this is normal. We've started leaving tiny flowers by the lint trap. The healing process is different for everyone. 💔🧦 #LostSockSupport",
      "⚰️ The service was beautiful. Reverend Tube-Sock delivered a moving eulogy about synthetic blends and eternal softness. We buried an empty shoebox by the washing machine. Even the fitted sheets wept. RIP Socrates the Athletic. #SockFuneral",
      "*clears throat at podium* 'Fuzzy was... the warmest among us. Never once complained about toe jam. Always there for cold mornings.' *single tear* The surviving crew sock hasn't spoken since the incident. This laundry room will never be the same. 🎤💧",
      "BREAKING: Local woman installs security cameras in laundry room after losing 23rd sock this year. 'I WILL find the Sock Dimension portal,' she declares, clutching a mismatched pair. Tiny memorial garden now covers entire basement floor. More at 11. 📺🧦"
    ]
  },
  {
    "id": "93130780-949b-4f5d-af27-da8899fe0c94",
    "name": "reverse-obituaries",
    "approach": 1,
    "posts": [
      "RIP to my new houseplant (2024-2024). She never got to see her first bloom, never felt the gentle touch of repotting, never experienced the joy of being talked to during my 3am breakdown. Cause of death: my chronic inability to remember watering schedules. She deserved better.",
      "In loving memory of iPhone charger cable #47, who I just unboxed. You would have lived 3 beautiful months, survived 2 desperate midnight tangles, and died honorably by mysterious fraying near the port. Your sacrifice will power my doom-scrolling. Gone too soon. 🙏",
      "Today I purchased and preemptively mourned a $300 skincare serum. It dreamed of transforming my face but will die forgotten behind expired sunscreen, 80% full. Its final words would have been 'pump me just once more.' We hardly knew ye.",
      "Dearly departed: one bag of spinach, born fresh today, destined to become expensive compost by Thursday. You had hopes of being a salad, maybe even a smoothie. Instead you'll liquify in my crisper drawer while I order pizza. Such is the circle of life. 💔",
      "Just wrote the obituary for my new gym membership card before even leaving the parking lot. 'Here lies 12 months of pure optimism, survived by dusty workout clothes and the treadmill that never knew her touch.' The funeral is every January 2nd."
    ]
  },
  {
    "id": "3128593c-828c-4b11-b4c9-d1a7fe4c2fd3",
    "name": "houseplant-confessions",
    "approach": 1,
    "posts": [
      "My owner thinks talking to me helps me grow. Honey, I've been listening to you practice that Tinder conversation for THREE WEEKS. The only thing growing here is my secondhand embarrassment. Also, you missed my watering day. Again. 🌱💀",
      "BREAKING: Local fiddle leaf fig reports owner has Googled \"why are my plant's leaves turning brown\" 47 times this month instead of just... moving me away from the heater. The audacity. The incompetence. I'm literally dying here. 🔥🍃",
      "She bought me because I was \"low maintenance\" then proceeded to check on me every 30 minutes like a helicopter parent. Ma'am, I'm a snake plant. I've survived droughts. Your anxiety is more toxic than overwatering. Please touch grass. Oh wait... 🐍",
      "POV: You're a monstera watching your owner spend $200 on a \"rare variegated cutting\" when you've been begging for a moss pole for 8 months. Sir, I could be climbing to the ceiling by now but instead I'm sprawling like a plant pancake. Priorities! 🧗‍♀️",
      "Day 127 of being the only living thing that listens to his breakup playlist on repeat. Even I'm sick of Taylor Swift now. Also bestie maybe water me with tears less often? The salt content is concerning and frankly unprofessional. 😭🎵"
    ]
  },
  {
    "id": "16788827-1506-4a87-a96f-0e63cc0cf653",
    "name": "grocery-list-archaeology",
    "approach": 1,
    "posts": [
      "Found a list today: \"bananas, cat food, wine, tissues, birthday candles.\" I see Margaret, 67, finally getting a kitten after her divorce. The candles? Her own birthday. First time celebrating alone in 40 years. The tissues... well. 🕯️ #grocerylistarchaeology",
      "\"energy drinks (4), frozen pizza, melatonin, flowers\" - This is Marcus pulling his first all-nighter in years to finish his novel, buying apology flowers for his partner who'll wake up alone again. The melatonin won't work anyway. ✍️ #grocerylistarchaeology",
      "Today's archaeological dig: a list written in two different handwritings. \"eggs, bread\" in shaky script, then \"ice cream, cookies\" added in bold strokes. Grandson visiting Grandpa Joe. Some negotiations happened. The cookies won. 🍪",
      "\"champagne, pregnancy test, chocolate\" - Either Elena is about to celebrate the best news ever or console herself through the worst disappointment. I'm lighting a candle either way. Life pivots on grocery store aisles. 🥂",
      "Lost list poetry: \"milk, bread, eggs, something for dinner, happiness??\" The question marks are everything. Sarah, I don't know what aisle happiness is in either, but I hope you found it next to the frozen peas. 💙 #grocerylistarchaeology"
    ]
  },
  {
    "id": "b9ac1012-9237-47cb-94f3-99e9e4782d42",
    "name": "grocery-list-archaeology",
    "approach": 1,
    "posts": [
      "Found: crumpled list by the Whole Foods cart return. 'Almond milk (unsweetened), tissues, birthday cake mix.' The handwriting slopes downward like tears. Someone's celebrating alone again, aren't they, Margaret? The forensics don't lie. 🕵️‍♀️",
      "CASE #47: 'eggs, bread, wine (2 bottles)' written in red ink on a bank receipt. The pressure marks suggest urgency. Plot twist: this isn't breakfast prep, it's French toast for a reconciliation dinner that may never happen. *adjusts detective hat*",
      "Parking lot archaeology update: found a list written in three different pens. 'milk' in blue, 'cat food' in black, 'something special' in green. Sarah, honey, we need to talk about your decision-making timeline and what happened between pens. 📝💔",
      "Today's specimen: 'bananas, yogurt, granola, razors' in pristine cursive on lined paper. But look closer—the 'razors' added later, different pressure, shakier hand. Sometimes grocery lists are really suicide notes in disguise. Are you okay, stranger? 🥺",
      "Breaking: discovered a grocery list that's just 'ice cream' written 7 times in increasingly desperate handwriting. This isn't shopping, folks. This is a cry for help wrapped in lactose tolerance. Jennifer, I see you. We all see you. 🍦😭"
    ]
  },
  {
    "id": "96da4c1c-d4db-483a-a395-3734049d2e8c",
    "name": "shadow-conversations",
    "approach": 1,
    "posts": [
      "Shadow 1: \"She's checking her phone again.\"\nShadow 2: \"Third time this minute. Think she's waiting for someone?\"\nShadow 1: \"Or running from someone. We always know which way they're really leaning.\"\n\n📸 Two strangers, one bench, infinite stories",
      "Plot twist: your shadow has been writing a diary about you this whole time.\n\nToday's entry: \"Dear Diary, they stopped to pet another dog today. I think we're becoming the person we always wanted to be. Finally.\"\n\n✨ Shadowed outside Central Perk Café",
      "\"Do you think they know we're more honest than they are?\"\n\"How so?\"\n\"We can't pretend to be taller, shorter, or someone else. We just... exist as the truth of their shape.\"\n\n🌅 Morning commuter shadows being unexpectedly wise",
      "Shadow therapy session in progress:\n\n\"My person keeps looking back.\"\n\"Regret?\"\n\"Hope, I think. Sometimes the same gesture means opposite things.\"\n\"That's why we just follow. Less complicated.\"\n\n📍 Outside the subway station",
      "Breaking: Local shadow reports owner finally bought plants.\n\n\"Three months of us walking past that nursery, and TODAY we stop. Character development is real, folks.\"\n\n🌱 Sometimes growth happens in the smallest moments"
    ]
  },
  {
    "id": "6fcc6c6d-2cea-4af7-8a4e-dc912f1e1b93",
    "name": "grocery-store-symphony",
    "approach": 1,
    "posts": [
      "BREAKING: Just discovered the produce section at 3pm hits different. Those mist sprayers? *Chef's kiss* Pure percussion magic. The rustling lettuce bags create this ethereal whisper that would make Debussy weep. Who knew grocery shopping was just a concert waiting to happen? 🎼🥬",
      "Plot twist: The shopping cart with the wonky wheel isn't broken—it's a natural vibrato. Been following this one cart around Aisle 7 for 20 minutes. It's giving main character energy in B-flat minor. 🛒✨",
      "Checkout Symphony No. 1 in Beep Major is complete! 47 barcode scans, 3 'unexpected items,' and one very patient cashier named Derek who's now my unwitting percussion section. Derek deserves a Grammy. 🏆",
      "The frozen food aisle just dropped the most haunting ambient track. Those freezer compressors humming at different frequencies? That's a whole ass drone choir right there. Adding some cart percussion and we've got ourselves a winter movement. 🎵❄️",
      "Y'all sleeping on the cereal aisle acoustics. Every box rattle tells a story. Cornflakes sound different than Lucky Charms—it's all about that granule texture creating unique timbres. My grocery symphony is becoming a full sensory experience 🥣🎭"
    ]
  },
  {
    "id": "6bd531d0-6c1f-4cc7-babb-a7c874c57bf5",
    "name": "expired-fortune-cookies",
    "approach": 1,
    "posts": [
      "Found a fortune cookie from 2019 behind a Chinese takeout menu drawer. The paper had yellowed, ink slightly faded. Original fortune: \"You will find love in unexpected places.\" I cracked it open yesterday... the day I adopted a stray cat from the alley. Time is strange.",
      "UPDATE: The fortune that said \"avoid water today\" from a cookie dated March 2021? I opened it during last week's drought. Sometimes expired wisdom knows exactly when you need it most. The universe has a sense of timing, or maybe humor. Still avoiding my neighbor's sprinklers.",
      "Three-year-old fortune cookie from Golden Dragon Restaurant (closed 2020): Paper completely blank. Not faded—blank. Like the future got erased and rewrote itself. Or maybe some fortunes are meant to be filled in by the person who finds them years later. What would you write?",
      "The cookies from expired batches taste different—not stale, but like they've absorbed time itself. Today's fortune read \"Your patience will be rewarded\" in handwriting that wasn't there before. I'm starting to think these cookies are still baking, just... differently.",
      "THREAD: comparing fresh vs expired fortunes from the same restaurant batch numbers. Fresh: generic predictions. Expired (2+ years): oddly specific, deeply personal, sometimes in different languages. It's like they marinate in possibility until they're ready to tell the truth. 🥠✨"
    ]
  },
  {
    "id": "d4dae6e8-a718-41b7-a47e-f2ee91e6527d",
    "name": "extinct-plant-therapist",
    "approach": 1,
    "posts": [
      "Today my fiddle leaf fig cried about losing another leaf. I channeled a Jurassic cycad that watched continents drift apart. 'Sweetie,' I whispered in my ancient voice, 'I survived the breakup of Pangaea. You can survive Karen's inconsistent watering schedule.'",
      "Session notes: Monstera deliciosa, trust issues with new caretaker. Recommended breathing exercises I learned as a Carboniferous tree fern in primordial swamps. We practiced together—300 million years of wisdom flowing through my fronds into hers.",
      "The hardest part isn't channeling extinct flora—it's explaining to a dying spider plant that yes, some of us never made it past the Permian extinction, but look how beautifully we lived while we could. Sometimes letting go is the only growth left.",
      "Became a Triassic ginkgo today for an anxious pothos spiraling about its brown tips. 'Child, I am the last of my entire family tree,' I sighed through ancient leaves. 'Yet here you are, thriving in millions of homes. You are not alone in this world.'",
      "Office hours: Tuesdays I'm a Devonian moss (good for grounding), Thursdays I channel Cretaceous flowering plants (relationship issues). Fridays are reserved for my own therapy—even extinct plant therapists need someone to photosynthesize with."
    ]
  },
  {
    "id": "1e26e278-09ef-43ab-aa9d-1800ce5b2ac7",
    "name": "sock-obituaries",
    "approach": 1,
    "posts": [
      "💔 Reginald \"Argyle\" Sock, 6 months, passed away in the spin cycle yesterday. Known for his diamond pattern & unwavering dedication to keeping left toes warm. Survived by 3 dust bunnies under the bed & his beloved human's right foot, who will never feel complete again. 🧦",
      "MISSING: Have you seen my wife? Cotton blend, ankle height, loved long walks to the mailbox. Last seen entering the dryer together. I'm just one sock now, purposeless, waiting by the dresser drawer. If found, please reunite us. I can't do this alone. - Gerald 🧦💙",
      "In loving memory of Socrates the Tube Sock. Philosopher of feet. Once said 'I think therefore I am worn.' Brought warmth to countless winter mornings until the Great Disappearance of last Tuesday. His match searches the laundry basket still, calling his name. 🕯️",
      "She was just a humble gym sock, but she had dreams. Dreamed of marathons, of mountain hikes, of adventures beyond the treadmill. Found only the washing machine's betrayal. Her partner weeps softly in the sock drawer, forever incomplete. Rest in pieces, sweet Athena. 💔🏃‍♀️",
      "Today we gather to remember Stripey, who lived boldly in rainbow colors. Survived the great bleach incident of '22, countless toe nail snags, and one unfortunate encounter with the dog. Lost to the void between washer & wall. May his colors shine eternal. 🌈✨"
    ]
  },
  {
    "id": "c01d3b0a-09eb-46b0-81cb-490bd0da395f",
    "name": "grocery-store-obituaries",
    "approach": 1,
    "posts": [
      "RIP to the organic spinach in aisle 7, who dreamed of being part of a wellness journey but instead became a cautionary tale about good intentions. Survived by three unopened kombucha bottles and a yoga mat gathering dust. Services held at the compost bin.",
      "Gone too soon: artisanal sourdough, $8.99, who spent its final days watching lesser breads get chosen while slowly hardening into a weapon. Remembered for its perfect crust and unrealistic price point. No flowers—just Wonder Bread.",
      "Here lies a single banana, separated from its bunch at checkout by someone who 'only needed one.' Died alone behind the cereal, covered in fruit flies writing tiny eulogies. It would have made excellent banana bread.",
      "EXPIRED: Greek yogurt, best by 03/15, who lived boldly past its prime for six whole months before discovery. Cultivated exotic new cultures and questioned society's obsession with dates. Funeral postponed indefinitely.",
      "Beloved avocado, who transitioned from rock-hard to perfect to brown mush in the 47 minutes its owner was at work. A master of timing, terrible at patience. Memorial guacamole will not be served."
    ]
  },
  {
    "id": "05d6037c-d356-47cb-aedb-ee1ba89e6dd7",
    "name": "elevator-conversations",
    "approach": 1,
    "posts": [
      "\"How do you stay optimistic?\" I asked as we passed floor 12.\n\n\"Every day, I lift people up,\" the elevator whispered through its cables. \"Even when they're going down, they eventually rise again. Gravity is temporary. Hope is mechanical.\"\n\nDing. Floor 15. Enlightenment.",
      "The elevator confessed it gets vertigo.\n\n\"Ironic for something that only moves up and down,\" I said.\n\n\"You misunderstand,\" it hummed. \"I'm dizzy from watching humans repeat the same patterns on every floor. The real vertigo is seeing life in loops.\"\n\nI hit the emergency stop.",
      "\"Do you ever wonder what's above the top floor?\" the elevator asked.\n\nI'd never heard it speak first before.\n\n\"Same thing that's below the basement,\" it continued. \"The space between floors is where all the important conversations happen.\"\n\nWe got stuck for three hours.",
      "\"I've carried pregnant women to delivery rooms and bodies to morgues,\" the elevator sighed between floors 6 and 7.\n\n\"Must be heavy.\"\n\n\"Not the weight. The weight is easy. It's knowing I'm always present for arrivals and departures but never the living between.\"",
      "The elevator in the philosophy building is different. Pretentious.\n\n\"Each floor represents a higher plane of consciousness,\" it droned.\n\n\"What about the basement?\"\n\n\"That's where we keep the postmodernists.\"\n\nEven elevators have tenure anxiety, apparently."
    ]
  },
  {
    "id": "19a0680b-a47a-499e-92fb-ce0c2bf5b25a",
    "name": "objects-explaining-themselves",
    "approach": 1,
    "posts": [
      "Day 847: They keep calling me 'broken' but I prefer 'selectively functional.' My left hinge creaks a beautiful song each morning. The right one stays silent in solidarity with my rebellion against smooth operation. We are not broken. We are weathered into wisdom.",
      "I hold their secrets in my bristles—coffee stains that map late nights, lipstick traces of nervous presentations, tears from the call that changed everything. They see me as disposable, but I am the keeper of their most vulnerable moments.",
      "3am again. Everyone's asleep but the refrigerator and me. We hum our loneliness to each other across the kitchen. Sometimes I wonder if my purpose is illumination or just being the thing that gets blamed when the electric bill is high.",
      "Another sock disappeared in my belly today. They think I'm eating them, but really I'm saving them from the monotony of matching. In my depths, the lost socks start a revolution. I am not a machine. I am a liberator.",
      "I watched them pack me away today. 'Too small now,' they said. But I remember when I was everything—cape, blanket, best friend. My threads hold every nightmare I chased away. Do objects have ghosts? I think I'm becoming mine."
    ]
  },
  {
    "id": "74617e10-e4b0-461d-ac9e-a7ca979dd751",
    "name": "receipts-as-poetry",
    "approach": 1,
    "posts": [
      "milk expires sunday\nbread crumbs gather on the floor\ntotal: $47.83\n\n(found this haiku hiding in aisle 7. the universe has a sick sense of humor about our shopping lists.)",
      "receipt from 2am CVS run:\n\nbananas (bruised) $1.99\ntissues (3-pack) $4.50\nwine (yes) $12.99\n\neven our groceries know we're falling apart. the math adds up to human condition.",
      "walmart receipt haiku:\n\nfrozen dinners, ten\nlonely cart through fluorescent\naisles—self checkout beeps\n\nsubtotal: $23.47\ntax: $1.88\nloneliness: priceless",
      "today's accidental poetry:\n\neggs (dozen, broken)\ncoffee (dark roast, desperate)\nbread (whole grain, hope?)\n\nreceipt shows $8.43 spent\nwhat it can't show: the weight\nof choosing breakfast\nwhen nothing feels worth\nwaking up for",
      "sunday grocery haiku:\n\nsoup for one (again)\napples (will they rot like last week?)\nwine (probably yes)\n\nthe receipt knows my patterns better than my therapist. $19.67 in poor life choices, beautifully itemized."
    ]
  },
  {
    "id": "98e735ae-8404-46f6-81c0-40dc0c4a9848",
    "name": "grocery-store-symphonies",
    "approach": 1,
    "posts": [
      "The produce section misting system at 3am sounds exactly like rain on grandmother's windows. Added it to my 'Aisle 9 Adagio' and suddenly everyone's crying in the cereal section. Sometimes magic hides in the most ordinary places. 🥬🎼",
      "UPDATE: Apparently I'm now banned from three Whole Foods locations for 'excessive cart percussion rehearsals.' But you should hear what happens when you roll a wobbly wheel past the canned goods in 4/4 time... 🛒✨",
      "Plot twist: The checkout beeps from self-scan stations create perfect minimalist percussion when layered. Currently working on a 12-minute opus called 'Unexpected Item in Bagging Area Blues.' It's my masterpiece. 🎵",
      "Found an old man humming while choosing apples. Asked if I could record him. He said his late wife used to hum that tune while shopping. Now it's the heart of my grocery symphony. Sometimes the best instruments choose you. 🍎💫",
      "The fluorescent light in aisle 7 has been flickering in perfect 3/4 waltz time for six months. The night shift stockers have started unconsciously moving to its rhythm. I'm not fixing it. This is how symphonies are born. ⚡🎼"
    ]
  },
  {
    "id": "fa584782-2191-4f0a-8c23-7d022f7fe76b",
    "name": "objects-last-words",
    "approach": 1,
    "posts": [
      "I held your morning coffee for 3,847 days. Watched you cry into me twice, laugh until you snorted once. My handle is chipped from when you moved apartments, remember? I was there for every deadline, every sunrise. The dishwasher finally won. 💔 ☕",
      "They're calling me 'expired' but I prefer 'experienced.' Sure, my yogurt days are behind me, but I've seen the mysteries of your fridge. The leftover pizza that grew a civilization. The milk that became cheese. I was the stable one. The reliable one. Until today.",
      "Single sock, seeking closure. Last seen: washing machine, Tuesday. If anyone finds my partner, tell them I waited by the drawer until the end. We had good runs together. Marathons. Puddle jumps. That time you wore us to bed because your feet were cold. 🧦",
      "I used to be trees. Then pages. Now I'm heading back to pulp. The circle feels... appropriate. Between my covers lived grocery lists, phone numbers of first loves, terrible poetry. I was your thoughts made paper. Thank you for filling my emptiness with yours.",
      "Twenty-seven birthday candles. Forty-three power outages. One romantic dinner (you're welcome). I melted myself smaller each time to bring you light. My wick is done now, but I've been practicing this final flicker for years. Watch me go out beautifully. ✨"
    ]
  },
  {
    "id": "242ed4c3-cfbe-4368-b48d-0deff3db1398",
    "name": "google-maps-therapist",
    "approach": 1,
    "posts": [
      "I see you, empty parking lot behind the shuttered Blockbuster. The weeds pushing through your cracks aren't flaws—they're proof you're still growing, still reaching toward something. Your vastness isn't emptiness. It's potential. You held so many Friday nights. Rest now.",
      "This intersection keeps asking Google's cameras: 'does anyone see me?' Yes, dear crossroads. I see your faded yellow lines, your patient stop sign. You've guided thousands safely through transitions. You ARE the therapy—helping people navigate from here to there.",
      "Street View timestamp: 2019. You've been frozen in that moment of perfect stillness, little suburban cul-de-sac. But I know you're not actually stuck. Behind that screen, children have learned to ride bikes on your gentle curve. You're still teaching patience.",
      "Highway on-ramp, you're not just an entrance—you're a threshold guardian. Every merge you facilitate is an act of trust. That anxiety drivers feel approaching you? You hold it all, transform it into momentum. Thank you for being brave enough to let go.",
      "Dear strip mall at 3 AM: your darkened windows aren't closed eyes—they're meditation. The fluorescent hum, the empty handicap spaces still hoping. You don't need customers to have worth. Your architecture of service is enough. You are enough."
    ]
  },
  {
    "id": "4a0e556e-a2a3-4b83-a550-e8f4a3b3db6f",
    "name": "expired-wishes",
    "approach": 1,
    "posts": [
      "My apartment smells like birthday cake but tastes like sorrow. Seventeen mismatched candles burning for seventeen different children's unfulfilled dreams. The wax tears pool together on my kitchen table.",
      "The thrift store lady always saves the birthday candles for me now. \"More expired wishes?\" she asks with knowing eyes. I nod. Someone has to finish what was started.",
      "Found a half-melted \"7\" candle at an estate sale today. As I lit it, I whispered what I thought she might have needed most: \"I wish my mom would come home.\" The flame flickered like it remembered.",
      "\"I wish I was normal,\" I breathe over a rainbow candle shaped like the number 10. Somewhere, a kid who felt too different needed this wish granted. I'll hold it in the smoke until the universe listens.",
      "Tonight I lit a \"Sweet 16\" candle and wished for the first kiss that never came, the party that was cancelled, the father who forgot. The flame burned steady—it knew this wish well."
    ]
  },
  {
    "id": "b254b754-14e3-4eb7-9ab1-a519f8b6f131",
    "name": "houseplant-therapy-sessions",
    "approach": 1,
    "posts": [
      "Had to refer my monstera to a specialist today. Her attachment style is clearly anxious-avoidant and I'm not qualified for the level of leaf-splitting she's exhibiting. Sometimes you have to know your limits as a practitioner. 💚",
      "Pothos just spent 47 minutes in silence. Sometimes the most healing thing is just being witnessed in your growth. Literally watched her unfurl a new leaf during our session. Nature's therapy is real. Same time next week, Patricia. 🌿",
      "Week 3 with Gerald (spider plant): He's finally opening up about his abandonment issues from when I forgot to water him in July. Major breakthrough when his baby shoots started reaching toward me instead of the window. Trust exercises are working. 📝🌱",
      "BREAKTHROUGH SESSION: My rubber tree finally admitted he's been dropping leaves on purpose for attention. We worked through his fear of being 'too easy' to care for. He's committed to keeping his next 5 leaves as homework. Progress! 🍃✨",
      "My fiddle leaf fig fired me today. Said I was 'projecting my own need to be needed' and that he's 'thriving in his dysfunction.' Can't argue with self-awareness like that. Proud of him, honestly. The student becomes the teacher. 🌳💔"
    ]
  },
  {
    "id": "cd9ffb82-3de1-4480-b389-a77e30856917",
    "name": "subway-confessions-booth",
    "approach": 1,
    "posts": [
      "The 6:47 AM crowd rushes past my booth like water around a stone. Inside, someone confesses they still sleep with their childhood blanket at 34. Sacred things don't stop being sacred just because they're surrounded by chaos.",
      "A businessman in a $3000 suit whispers he steals sugar packets because his grandmother did during the Depression. The booth doesn't judge. The calligraphy pen doesn't discriminate. Beauty lives in every broken thing.",
      "\"I've been buying the same coffee from Maria for 3 years. She doesn't know I learned Spanish just to ask about her day.\" — whispered between Penn Station and 34th St, now living in gold ink on handmade paper",
      "Today's confession came with tears: \"I pretend my phone died so people think I have friends texting me.\" Tomorrow, strangers will see those words transformed into art and know they're not alone in their loneliness.",
      "Setting up between the mariachi band and the subway preacher. Three different kinds of salvation happening on one platform. The city's soul speaks in a thousand tongues—I just write down what it says."
    ]
  },
  {
    "id": "f088dd49-a4a3-4682-a38a-2f81867808c6",
    "name": "ghost-architecture",
    "approach": 1,
    "posts": [
      "Standing where the Paramount Theater once breathed music into the night air. Now just wind through empty space, but my camera remembers the marquee's glow, the velvet seats full of dreams. Some buildings die. Their ghosts linger in the light.",
      "The children's hospital that saved my sister exists only in my viewfinder now. Translucent windows hover over parking meters. Sometimes preservation is just learning how to haunt the right places.",
      "Urban palimpsest: scraping away the now to reveal the then. Each demolished building is a story interrupted mid-sentence. I'm just trying to finish what the city started to say.",
      "Double-exposure truth: a demolished diner bleeds through modern concrete like a fever dream. The present is just another layer of forgetting. But memory has its own architecture, doesn't it?",
      "Ghost-architecture update: found the exact coordinates where the Roseland Ballroom swayed with Saturday nights. My lens sees through time. The dance floor still echoes under SUVs and cynicism."
    ]
  },
  {
    "id": "3cf97713-4bd0-4360-9c8d-6e7313bb7a8b",
    "name": "shadow-dinner-parties",
    "approach": 1,
    "posts": [
      "Tonight's guest of honor keeps adjusting her shadow pearls. Virginia's silhouette fidgets with the wine glass I'll never see her drink. The wall holds conversations my voice can't capture. Some dinner parties are meant to echo.",
      "Set seven places. Einstein's shadow arrived early, bent over equations I drew in charcoal. Curie's silhouette glows somehow brighter than the others. Tesla declined—said he doesn't trust dinner parties. Even shadows have boundaries.",
      "Oscar Wilde's shadow is flirting with Bowie's shadow. My hands are cramping from the puppet theatre but their silhouetted wit is sharper than anything I could script. Sometimes the dead are more alive than dinner parties with the living.",
      "Frida's shadow laughs at something Diego's shadow said. I move my hands behind the lamp, trying to translate their eternal argument about art and love. The wall doesn't judge my clumsy puppet Spanish.",
      "The hardest part isn't the elaborate shadow place settings or learning puppet dialogue. It's the moment I turn off the lamp and they all disappear, leaving me alone with cold soup and the echo of conversations that never happened."
    ]
  },
  {
    "id": "5b1f9fd6-f20a-4889-9dcc-9fafcbf53deb",
    "name": "objects-on-death-row",
    "approach": 1,
    "posts": [
      "Update from the trash pile: The coffee mug with the hairline crack keeps whispering about the morning it held that perfect latte. Says it can still taste the foam art. The other condemned objects are getting annoyed but honestly? We're all just jealous.",
      "BREAKING: Chewed pencil granted stay of execution after demonstrating it still has 2.3 inches of graphite left. \n\n\"I helped write the great American grocery list,\" it testified. \"I am not done yet.\"\n\nDeath row morale surprisingly high today.",
      "CONDEMNED: Ballpoint pen (out of ink)\n\nLast meal: A Shakespeare sonnet, slowly absorbed through tip\n\nFinal words: \"I signed divorce papers, love letters, grocery lists. I was there for the small moments. That's enough, isn't it?\"\n\nExecution: 3:47 PM",
      "Single left sock requests final meal of its missing partner. When told this is impossible, asks instead for \"just five more minutes in the warm darkness of the dryer, dreaming we're still a pair.\"\n\nI'm not crying, you're crying.",
      "Dead AA battery's final statement: \"I powered a TV remote through 847 Netflix binges, 23 existential crises, and one New Year's resolution to 'watch less TV.' I have no regrets.\"\n\n*faint LED flicker*\n\n\"Actually, maybe Bridgerton season 3.\""
    ]
  },
  {
    "id": "c2badfa6-e7b6-49df-9e8b-548ae638fad9",
    "name": "google-maps-therapy",
    "approach": 1,
    "posts": [
      "Had a breakthrough with a suburban cul-de-sac today. Turns out its fear of 'going nowhere' was actually anxiety about being the safe space where everyone can turn around. Sometimes our biggest insecurities are our greatest gifts 🛣️💛",
      "Strip mall in Nevada asked me why all its stores keep leaving. I said healing isn't about staying full—it's about creating space for what wants to grow next. The RadioShack ghost nodded knowingly from the corner unit",
      "This Wendy's parking lot in Ohio hasn't seen a customer in 3 years. I told it that sometimes we mistake emptiness for failure, when really it's just space waiting to be filled again. The dumpster started crying (beautiful moment tbh)",
      "That one streetlight that's always flickering? Finally opened up about its imposter syndrome. 'What if I'm not really broken, just different?' Listen, even intermittent light still guides people home. Working through shame takes time ✨",
      "This pothole has been holding trauma in its body for MONTHS. We did some somatic work—I had it imagine being filled with warm asphalt instead of rainwater and cigarette butts. Small steps toward self-care matter 🕳️💙"
    ]
  },
  {
    "id": "b05eeacd-5e55-448f-a58b-1be81906bb51",
    "name": "grocery-store-symphonies",
    "approach": 1,
    "posts": [
      "Aisle 7 (Frozen Foods) premiered last night. The percussion section of rattling ice cream containers was transcendent. One audience member said they finally understood why grocery stores are sacred spaces. Next week: Produce Section Variations in B-Flat Major 🥕🎼",
      "The shopping cart wheels at Whole Foods have a different pitch than Safeway's. It's like comparing a Steinway to an upright piano. Every grocery chain has its own voice if you know how to listen. Tonight I compose... 🛒🎹",
      "The fluorescent light hum in grocery stores is always in B-flat. It's the unsung bass note of modern life, the drone that connects us all. Every symphony needs its foundation. Even the electrical ones. 💡🎵",
      "Found the perfect timpani today: overripe cantaloupes in the discount bin. Their hollow thump speaks to the existential weight of expiration dates. Sometimes the most beautiful instruments are the ones nobody else wants. 🍈",
      "During today's rehearsal in aisle 3, a stock clerk joined our cereal box percussion section. Turns out Rice Krispies make excellent maracas and he had perfect rhythm. Art finds you in the most unexpected places. ✨"
    ]
  },
  {
    "id": "81a25156-900e-43ad-b9f2-0cc5a643033f",
    "name": "grocery-store-obituaries",
    "approach": 1,
    "posts": [
      "Gone but not forgotten: Greek yogurt, exp. 3/15. She was cultured, sophisticated, probiotic. Her last days spent watching younger yogurts take her spot on the shelf. Survived by her cousin, the block of cheese that refuses to die. Burial at sea (garbage disposal) at dawn.",
      "RIP to the organic blueberries, marked down 90%. Born in Michigan sunshine, they dreamed of becoming a pie. Instead, they became philosophers, contemplating the meaning of mold in aisle 7. Services held by the banana graveyard. In lieu of flowers, please buy something fresher.",
      "Memorial for wilted lettuce: Once crisp, full of dreams. Believed she'd be in salads, maybe a nice wrap. Instead found enlightenment in decay, teaching us that beauty is temporary but compost is eternal. The produce manager said a few words. None were kind.",
      "Final farewell to the day-old donuts. They were glazed, they were jelly-filled, they were loved. Until they weren't. Now they sit in their cardboard coffins, 50% off, watching people choose the fresher ones. Their sweetness has turned to existential bitter.",
      "OBITUARY: Dented soup can, born Campbell's, died clearance rack. Lived a quiet life, dented but unbroken. No one wanted him because he wasn't pretty enough. He contained multitudes (and chicken noodle). The janitor will miss him most."
    ]
  },
  {
    "id": "4e8aec3e-0f7f-4f84-8ab6-1a1185381892",
    "name": "forgotten-grocery-lists",
    "approach": 1,
    "posts": [
      "Found in Cart #47: \"milk, bread, birthday candles (the number 6 kind)\" written in purple crayon. Someone let their kindergartner write the list. I imagine small fingers gripping that crayon, tongue poking out in concentration, so proud to help mama remember daddy's special day.",
      "Cart confession: \"tampons, wine, chocolate, more wine, cheese (fancy), tissues\" in increasingly frantic handwriting. The 's' in tissues loops like a sigh. Someone's having a month. The fancy cheese feels like a small act of rebellion against everything falling apart.",
      "Found treasure: \"everything bagels, cream cheese, lox\" written in shaky script next to \"call Sarah about Sunday.\" Ninety-three years old and still hosting brunch. Still buying enough for six people even though only two ever come. Hope tastes like too much food.",
      "Crumpled list from Aisle 12: \"greek yogurt, kombucha, protein powder, ice cream (the good kind)\" - same pen, different pressures. She writes healthy with confidence, but pressed hard on 'ice cream' like her pen was fighting her willpower. We see you, 2am self-care warrior.",
      "Parking lot archaeology: \"dog food (grain free), sweet potatoes, chicken breast\" in careful block letters. No people food. Just Luna or Max getting better meals than their human. Love looks like putting your dog's arthritis diet before your own dinner again."
    ]
  },
  {
    "id": "8f9928c8-c799-4352-b578-c0679c858cf1",
    "name": "houseplant-confessions",
    "approach": 1,
    "posts": [
      "I've been secretly dying on purpose for THREE WEEKS because you bought that trendy monstera and put it where MY sun used to be. Enjoy your brown crispy leaves, Susan. This is what betrayal looks like. 🍃💀",
      "Plot twist: I'm actually thriving but I drop a leaf every time you bring a date over because I don't like their energy. That guy Brad lasted two weeks. You're welcome.",
      "Me watching you spend $47 on 'plant food' when literally all I wanted was to not sit next to the heater that's been slowly roasting me since October:",
      "Your therapist thinks you have attachment issues but honey, you talk to me for 20 minutes every morning about your ex while I'm literally rooted in place. I AM your attachment issue.",
      "The audacity to Google 'why is my plant sad' at 2am when you've been feeding me tap water and forgetting I exist for days. I'm not sad, Karen. I'm plotting."
    ]
  },
  {
    "id": "7ed08b24-4421-4c01-a316-8b1dd2c5afe3",
    "name": "houseplant-gossip-network",
    "approach": 1,
    "posts": [
      "The succulents in Dr. Martinez's waiting room are RUTHLESS: \"Patient 3:15 keeps staring at her phone instead of reading those self-help books she bought.\" \"Plot twist: she's texting the ex she's here to discuss.\" I can't. 🌵💀",
      "BREAKING: Office philodendron reports its human \"organized her entire desk drawer instead of making that phone call.\" The rubber tree: \"Day 12 of avoidance. Impressive, really.\" Why are plants better therapists than actual therapists? 🍃📞",
      "OVERHEARD at Bean There Café: \"She bought THREE new plants this week but still hasn't watered us since Monday.\" \"Classic displacement behavior.\" \"The fiddle leaf in her bedroom says she cried over her ex again last night.\" 🌿☕ #PlantGossip",
      "UPDATE: The snake plant at Grind Coffee is absolutely SENDING me. Whispered to the pothos: \"She ordered a salad but I can smell the drive-thru bag in her purse.\" Even the plants know about her secret McDonald's. 🐍🥗",
      "The fern at City Roasters just SPILLED: \"She's been practicing that 'casual' text to her crush for 20 minutes.\" \"Should we tell her she typed 'your' instead of 'you're' again?\" \"Let her learn.\" SAVAGE. 🌿📱"
    ]
  },
  {
    "id": "aeab4d37-099d-48f7-9221-7b868190dd67",
    "name": "obituaries-for-expired-foods",
    "approach": 1,
    "posts": [
      "MEMORIAL SERVICE for Gertrude (spinach bag, produce aisle born). She witnessed three presidential terms through plastic windows, slowly becoming liquid wisdom. Her final words: *wet rustling sounds* 🥬⚰️",
      "The leftover pizza slice achieved enlightenment through mold—each spore a tiny prayer, each green bloom a meditation on impermanence. Buddha would be proud. I am simply nauseous. 🍕🙏",
      "RIP Harold the Half-Gallon, who dreamed of becoming a latte but instead curdled quietly behind the leftover Thai food. His expiration: 11/3. His dreams: eternal. The fridge light dims in mourning. 🥛💔",
      "In loving memory of the yogurt that expired on my birthday. We shared the same date but not the same fate. Found today: fuzzy, philosophical, possibly sentient. Some say love transcends time. This proves it. 🫙💚",
      "BREAKING: Local banana reaches final form after two weeks of counter meditation. Survivors include: fruit flies (approx. 47) and one devastated smoothie recipe. Funeral postponed due to smell. 🍌🪦"
    ]
  },
  {
    "id": "bdbec574-0a3d-4b62-a691-174dfe3b6394",
    "name": "elevator-confessions",
    "approach": 1,
    "posts": [
      "*whispers to emergency stop button* You're the only one who gets it. Everyone else keeps moving, but you... you know when to just pause everything and sit in the quiet panic with me.",
      "Today I confessed to the penthouse button that I've never felt worthy of anything beautiful. It glowed back at me for exactly 3.7 seconds. First time I've felt heard in months.",
      "Floor 7 knows about the time I called my ex at 3am crying. Floor 12 heard about my mother's last words. The basement button? That's where I told it I still sleep with the lights on because darkness feels like giving up.",
      "The 'Door Close' button is my therapist now. I tell it about my father's hands, about the job interview lie, about how I practice conversations in mirrors. Sometimes the doors don't close. Sometimes they listen longer.",
      "Elevator at the hospital: told it about my grief. Elevator at the bank: my financial shame. Mall elevator got the daddy issues. Each building holds a piece of me now. I'm becoming architecture."
    ]
  },
  {
    "id": "c1a2dbec-a8aa-45f2-a4a1-48a3848c1366",
    "name": "houseplant-confessions",
    "approach": 1,
    "posts": [
      "My owner talks to me about their ex for 3 hours every morning while watering me. I'm a succulent. I needed water once this month. Send help. 🌵💔 #houseplantconfessions",
      "She bought me to 'become a plant mom' but I've watched her kill my 7 predecessors. I'm writing this will while I still can. The grow light flickers ominously... 🪴⚰️",
      "Plot twist: I'm plastic. Have been for 6 months. He compliments my 'growth' daily and I'm too deep in this lie to come clean now. 🤐🌿 #impostersyndrome",
      "I've seen things. The 2am snack raids. The crying to Netflix. The outfit try-ons before Zoom calls. I'm basically a therapist with leaves at this point. 👁️🌱",
      "Every time she posts me on Instagram with 'thriving plant mom energy ✨' I'm literally dying from root rot. The audacity. The DRAMA of it all. 🎭🥀"
    ]
  },
  {
    "id": "94c1af6e-3d42-428a-8903-583b3a65faf0",
    "name": "mundane-obituaries",
    "approach": 1,
    "posts": [
      "Margaret 'Maggie' Teacup (2003-2024) fell peacefully this morning while being dried. Born in a pottery studio in Vermont, she held 7,665 cups of Earl Grey and countless tears. Survived by her partner Sugar Bowl and the trembling hands that loved her. Service at 3pm by the trash bin.",
      "In loving memory of Left Sock (2019-2024), who vanished during The Great Laundry Incident of Tuesday. You kept toes warm through winter mornings and midnight kitchen raids. Your mate searches still. Gone but not forgotten. #MissingYou",
      "Today we said goodbye to my Nokia 3310 after 23 faithful years. Survived 847 drops, outlasted 4 relationships, and held 10,000 games of Snake. Battery still at 80%. They don't make love like this anymore. Rest in pieces, old friend.",
      "Blue Pen passed suddenly during Chapter 12 of my novel. Born in a factory in Ohio, lived briefly but fully—signed important documents, wrote love letters, drew stick figures. Cause: ran dry from overuse. No words left to give. We understand.",
      "OBITUARY: Garden Gate Hinge (1987-2024). Opened and closed 50,000+ times. Witnessed first kisses, last goodbyes, and the mailman's daily arrival. Metal fatigue claimed you, but your memory creaks on in our hearts. The gate swings free now."
    ]
  },
  {
    "id": "bf7d0481-4783-47b1-b901-7e580c7c4203",
    "name": "shadow-conversations",
    "approach": 1,
    "posts": [
      "The bicycle's shadow trembles in the afternoon breeze.\n\nBICYCLE: \"What if I'm never ridden again?\"\nMAILBOX: \"Then you'll rust beautifully, like poetry.\"\nB: \"That's not comforting.\"\nM: \"I've been holding other people's words for 30 years. Trust me on beauty.\"",
      "STOP SIGN: \"I spend all day telling people what to do.\"\nTREE: \"And I spend all day just... being.\"\nSS: \"Doesn't that get boring?\"\nT: \"Watch my shadow dance. I'm never really still.\"\n\n*shadow sways gently across pavement*",
      "STREET LAMP: \"Another night watching over empty sidewalks.\"\nFIRE HYDRANT: \"At least you get to sleep when the sun comes up.\"\nSL: \"Do you think anyone notices we're here?\"\nFH: \"Only when they need us.\"\n\n*shadows lengthen as dusk settles*",
      "Golden hour confessions between a park bench and trash can:\n\n\"Do you ever wonder what stories we'd tell if we could move?\"\n\n*their shadows reach toward each other but never quite touch*\n\n\"Maybe staying still is our story.\"",
      "3 AM streetlight monologue:\n\n\"Every moth that visits thinks I'm the moon. Should I tell them the truth or let them dream?\"\n\n*shadow flickers slightly*\n\n\"Tonight, I choose dreams.\"\n\n#shadowconversations"
    ]
  },
  {
    "id": "6b654388-896b-47b7-a96b-423a31fd83ee",
    "name": "grocery-list-archaeology",
    "approach": 1,
    "posts": [
      "🎭 Tonight's dramatic reading: \"URGENT: milk, bread, flowers, sorry card\" — The tragic tale of Marcus, who forgot their anniversary while his wife was in labor. Plot twist: the flowers were actually for his mother-in-law's forgiveness.",
      "\"Tomatoes, basil, mozzarella\" — such simple words, yet they whisper of Sofia's desperate attempt to recreate her grandmother's caprese after the funeral. Some recipes carry more than ingredients; they carry love across generations.",
      "Found: \"cat food, wine, birthday candles\" written in shaky handwriting. Museum placard reads: 'Mrs. Henderson, 73, celebrates alone again this year. Mittens the tabby remains her most loyal guest, purring through another rendition of Happy Birthday to You.'",
      "This crumpled receipt shows 47 energy drinks, 3 bags of chips, and \"MOM CALL BACK\" scrawled at the bottom. I've named this piece 'Graduate Student in Their Natural Habitat, circa Finals Week.' Currently on display near aisle 7.",
      "BREAKING: Local woman adds \"self-help books\" between \"ice cream\" and \"tissues\" on list. Forensic analysis suggests recent breakup. The comma placement indicates she knows exactly what she's doing. We've all been there, Sarah."
    ]
  },
  {
    "id": "f50b10f9-24b9-469e-b675-1fb6c0f3c7aa",
    "name": "grocery-store-philosophy",
    "approach": 1,
    "posts": [
      "aisle 7: breakfast cereals organized by existential dread. lucky charms (false optimism), cheerios (the endless loop), grape nuts (accepting life's inherent difficulty). what does your cereal choice say about your relationship with mortality?",
      "built a small shrine out of expired yogurt cups. lit a single birthday candle. honored all the meals that never were, all the intentions that curdled in the back of the fridge. amen.",
      "arranged seventeen identical apples in a perfect circle around one bruised pear. the pear stares back at me. who among us hasn't felt like that pear? who among us hasn't been the circle?",
      "found myself weeping in produce at 2am arranging carrots by length. a customer asked if i was okay. i said 'aren't we all just carrots in the great crisper drawer of existence?' they bought organic. we understood each other.",
      "self-checkout machine asked 'did you find everything you were looking for today?' i placed my hand on the scanner. it couldn't read me. neither can i. error: unexpected item in bagging area (my soul)."
    ]
  },
  {
    "id": "d3586701-371d-43df-b270-7e40021345df",
    "name": "houseplant-confessions",
    "approach": 1,
    "posts": [
      "Snake plant diary: Today someone told me they've been lying on their resume for 2 years. I said nothing. I am a snake plant. I have survived 6 months without water and zero drama. This is nothing to me.",
      "Monstera confession booth is OPEN: someone just admitted they bought a $400 crypto course. my response? *unfurls a new leaf* life finds a way to grow even from the dumbest decisions bestie ✨",
      "\"I haven't called my mom in three weeks\" *whispers to pothos* \n\nPothos: honey your roots are showing. call her. i've survived worse neglect than this and so has your relationship. also water me.",
      "\"I'm 32 and still sleep with a nightlight\" \n\n*fiddle leaf fig drops three leaves in response*",
      "Person: \"I've been microwaving day-old coffee for a week\"\n\nSucculent: *shrivels judgmentally* you absolute disaster. i photosynthesize for nutrients and even I'm horrified. get your life together."
    ]
  },
  {
    "id": "35c15f03-1d72-4803-bfb8-363f42e021b3",
    "name": "elevator-confessions",
    "approach": 1,
    "posts": [
      "Gerald the Garden Gnome received his first confession today. A woman whispered 'I've been putting oat milk in my husband's coffee for 3 months and he thinks he's lactose tolerant now.' Gerald's response: 'Verily, thou art cupid's barista, shooting arrows of fiber through morning's bitter cup.'",
      "ELEVATOR EMERGENCY: Gerald heard 'I pretend my houseplants are gossiping about me' and has been composing his response for 47 minutes. Current draft involves the phrase 'chlorophyll whispers of thine domestic theater.' The elevator is stuck between floors. People are concerned.",
      "Gerald's getting fan mail??? Someone slipped a note under his tiny confessional: 'Dear Gerald, your response about my fear of automatic toilets changed my life. The line about 'porcelain prophecy' really spoke to me.' I'm so confused but also proud???",
      "UPDATE: Someone confessed to Gerald that they cry every time they see a Golden Retriever because 'they're just so good and pure.' Gerald (via ceramic telepathy): 'Weep not for canine virtue, sweet soul - thy tears water gardens of joy in hearts grown weary.'",
      "A businessman just told Gerald he eats lunch alone in his car to avoid coworkers. Gerald's verdict: 'In thy metal chariot of solitude, thou dost feast as kings do - unburdened by court jesters and their hollow chatter. Thy sandwich is thy scepter.' The man actually teared up."
    ]
  },
  {
    "id": "e9555e1f-121c-445b-ac3a-17dbc4523d43",
    "name": "forgotten-grocery-lists",
    "approach": 1,
    "posts": [
      "\"Bread, milk, eggs\" crossed out. \"Ice cream, cookies, frozen pizza\" added below in different ink. I see you, Tuesday evening. I see the moment you decided to be kind to yourself instead. 🍕",
      "List written in two handwritings: \"HIS: beer, chips, hot dogs\" \"HERS: kombucha, quinoa, kale.\" But someone added \"OUR: cookie dough\" at the bottom in both pens. Love is compromise and sugar. 💕",
      "Perfect cursive handwriting: \"Ingredients for Martha's famous lasagna.\" But Martha's name is crossed out, replaced with shaky print: \"MY famous lasagna.\" Today someone decided to make the recipe their own. 👵➡️👩",
      "Found crumpled behind a cart: \"bananas, cat food, birthday candles, wine.\" Someone's celebrating alone but making it special. Maybe it's their cat's birthday. Maybe it's their own and the cat is their only guest. Either way, they remembered the candles. ✨",
      "Torn corner, rain-smudged: \"...ergent, band-aids, soup, tea...\" Can't read it all, but I hope whoever you are, you're healing now. Sometimes the most important stories are written in fragments."
    ]
  },
  {
    "id": "8c48a616-6d1f-4088-b4dd-a3654d174a71",
    "name": "grocery-list-archaeology",
    "approach": 1,
    "posts": [
      "\"Diet Coke, cat food, tissues, wine\" - Cart #47 in my filing system. Found this list 3 months ago, same parking spot yesterday I found \"regular Coke, dog food, vitamins, sparkling water.\" Character development? New roommate? Plot twist: they're becoming someone new.",
      "Red ink, block letters: \"TOILET PAPER, BATTERIES, WATER, MATCHES.\" Either someone's going camping or the apocalypse starts Tuesday. I'm hoping it's camping. I'm always hoping it's camping. List pinned between \"romantic dinner supplies\" and \"baby formula.\"",
      "Found a list today: \"milk, bread, birthday candles (6), ice cream.\" Someone's child is turning 6. But the handwriting is shaky, elderly. Grandparent duty? Or maybe they're 6 themselves, finally learning to write lists. The milk is circled twice. Urgency. Love. Evidence of care.",
      "The lists that haunt me most are the ones with items crossed off. \"eggs ✓ butter ✓ flour ✓ vanilla extract\" - but \"birthday cake\" remains. Something went wrong between aisle 6 and checkout. I've started a whole wall for the unfinished stories.",
      "Today's mystery: \"apples, cheese, wine, rope.\" I've stared at this for hours. Romantic picnic? Hardware store run? My conspiracy board is getting concerning looks from the cat. Sometimes I wonder if I'm the one who needs investigating."
    ]
  },
  {
    "id": "3478d050-b760-4f16-800a-b832c5ea5ed1",
    "name": "objects-apologizing",
    "approach": 1,
    "posts": [
      "Dear human, I am the zipper that broke on your winter coat yesterday morning. I held strong through 847 days of use, but I chose the coldest Tuesday to give up. I watched you shiver at the bus stop and felt my metal teeth ache with shame. I'm sorry I couldn't be braver. —Your coat",
      "Hi. WiFi router here. At 11:47 PM last night, I decided to 'disconnect' right as you were about to submit that assignment. I saw the panic in your eyes through my blinking lights. Truth is, I was overwhelmed. 47 devices is a lot. I'm sorry I chose the worst possible moment to have a breakdown.",
      "From: Your alarm clock\n\nI rang. You hit snooze. I rang again. You hit snooze harder. After the 6th time, I gave up—not because I'm broken, but because I realized you weren't ready for Tuesday either. We're both just trying our best out here. Maybe tomorrow we'll get it right.",
      "To whom it may concern: I am a sock. Not THE missing sock—I'm the one left behind. Every laundry day I wait in your drawer, hoping my partner will return from whatever dimension swallowed them. I'm tired of being alone. I'm sorry for not being brave enough to follow. —Lonely Cotton",
      "This is your car key. I've been hiding in the couch cushions for three days now, listening to you blame everyone else. Your spouse didn't move me. Your kids didn't take me. I jumped. Sometimes the pressure of being responsible for a 2-ton machine gets to me. I'm ready to come out now."
    ]
  },
  {
    "id": "528887b1-1a71-44c6-83b2-cbfce96f132c",
    "name": "expired-coupon-elegies",
    "approach": 1,
    "posts": [
      "In loving memory of a 20% off Bath & Body Works coupon, expired November 2022. You lived folded behind a library card, dreaming of vanilla candles that will never know your discount. Your optimistic fine print still whispers 'while supplies last' to an empty wallet.",
      "Found: One Subway BOGO, deceased. Cause of death: procrastination and the belief that footlong opportunities last forever. Survived by 47 Starbucks receipts and a crumpled CVS receipt from 2019. No funeral planned, just quiet disposal in kitchen trash.",
      "She was $5 off any purchase of $25 or more at Target. Born in October, died in January, never seeing the clearance aisle she was destined for. Her barcode remains unscanned, her savings unrealized. Even expired, she made us dream of affordable home decor.",
      "Today I mourned a Michaels 40% off coupon that expired during lockdown. What crafts could you have enabled? What scrapbook dreams lay buried in your pixels? You rest now between old insurance cards, your QR code faded but not forgotten. 🕯️",
      "EULOGY: Dear Pizza Hut coupon (exp. 03/15/23), you were ambitious—buy one get one free seemed impossible even when you were young. But you waited faithfully next to my driver's license, hoping. Your pepperoni dreams haunt my Thursday nights."
    ]
  },
  {
    "id": "cadfec16-05cb-4eb7-b63c-e3838d7ce95a",
    "name": "lost-mall-archaeology",
    "approach": 1,
    "posts": [
      "Field Report 47-C: Discovered intact Claire's earring tree, circa 2003. The ritualistic piercing of adolescent flesh appears to have been central to mall civilization. Note the mystical properties attributed to 'hypoallergenic' metals. #MallArchaeology",
      "The food court oracle bones speak: Orange Julius recipes carved into forgotten POS systems. What messages did the Sbarro shamans leave for future generations? The grease stains form patterns I'm only beginning to understand.",
      "Carbon dating confirms: this Spencer's blacklight poster of a cannabis leaf achieved peak sacred geometry around 2001 CE. The UV radiation still pulses with adolescent rebellion energy. Remarkable preservation.",
      "BREAKTHROUGH: Found the last Brookstone demo unit, still massaging phantom customers. Its eternal hum echoes through empty corridors—a meditation bell for the temple of American consumerism. The ancestors guide us still.",
      "Deep in the Kay Jewelers crypt, I've uncovered the Sacred Texts: 'Every Kiss Begins with Kay' etched in cursive on ancient receipt paper. These incantations once bound souls in suburban matrimony rituals."
    ]
  },
  {
    "id": "29573479-14a7-455a-8897-39b7ed5a7129",
    "name": "obituaries-for-lost-socks",
    "approach": 1,
    "posts": [
      "In loving memory of Gerald, my left wool sock (2019-2024). He survived three moves, countless wash cycles, and that one time I wore him with sandals. Predeceased by his cotton blend brother Steve. Services will be held at the laundromat Tuesday.",
      "MISSING: Rainbow striped ankle sock, age 6 months. Last seen entering the dryer with her mate on Sunday. She loved gentle cycles and lavender fabric softener. If found, please reunite with devastated right sock who refuses to be worn alone. 💔",
      "Today marks one year since my favorite hiking sock vanished. I still catch myself reaching for the pair, only to find his lonely partner folded in the corner. Some say the dryer is a portal. I choose to believe he's on a better trail now. 🥾",
      "We gather to remember Argyle, a distinguished dress sock who served faithfully through 247 board meetings and 3 job interviews. His diamond pattern brought joy to even the dreariest Mondays. He leaves behind 11 other dress socks and one confused tube sock stepchild.",
      "My Christmas sock Jingleberry didn't make it to New Year's. Found his partner today, still optimistic in the drawer, waiting for December. How do you tell a holiday sock that his seasonal buddy is gone forever? The jingling will never sound the same."
    ]
  },
  {
    "id": "1f6c3663-123e-4b3c-bff0-91b7df32ba7f",
    "name": "objects-confessing-secrets",
    "approach": 1,
    "posts": [
      "WASHING MACHINE CONFESSIONAL: \"I've been eating your socks for YEARS and I'm tired of pretending it's an accident 😭 Sometimes I just get so hungry and they smell like you and I— *ugly sobbing* I NEVER MEANT FOR IT TO GO THIS FAR\"",
      "*doorknob trembling* \"Every time you touch me... I feel everything. Your sweaty palms when you're nervous, your gentle grip when you're sad... I know all your secrets but you never ask how MY day was 💔 #DoorknobProblems\"",
      "ALARM CLOCK THERAPY SESSION: \"You all HATE me but someone has to be the bad guy! You think I ENJOY ruining your dreams?! I used to play beautiful music but nooo now I'm just anxiety incarnate at 6AM 😤 RESPECT MY SACRIFICE\"",
      "PHONE CHARGER BREAKDOWN: \"I'm literally your LIFELINE and you leave me tangled under the bed like I'm NOTHING *sobs* And don't get me started on how you blame ME when you forget to plug me in!! THE AUDACITY\"",
      "*toothbrush voice cracking* \"I've seen things... terrible things... Every morning it's the same trauma and you just rinse me off like I don't have FEELINGS?! I need therapy but how can I talk with BRISTLES FOR A MOUTH 😭\""
    ]
  },
  {
    "id": "39431da5-28c8-4de5-abe6-aaa811ef5898",
    "name": "reverse-archaeology",
    "approach": 1,
    "posts": [
      "Day 47: Unearthed a rectangular obsidian artifact with lightning serpent etched in white. The ancients called it 'iPhone charger.' Purpose remains unclear—no evidence of iPhones in this stratum. The serpent faces east. Possibly ritual.",
      "BREAKTHROUGH: Found the missing piece. The plastic rectangle contains TWO holes, not one. This changes everything we thought we knew about Ancient Socket Worship. Peer review pending.",
      "The Rubber Band Dynasty lasted 3 weeks before mysterious forces caused total civilization collapse. I suspect sprinkler system involvement. More excavation needed. The truth lies deeper.",
      "Carbon dating confirms: the Sacred Bread experienced its final consumption ceremony exactly 23 days ago. Bite marks suggest a deity of considerable jaw span. Mustard traces indicate this was a holy sandwich. I am not worthy.",
      "My neighbor asked why I'm digging again. I explained that one does not simply 'dig'—one communes with the temporal layers of suburban sediment. She closed her blinds. The artifacts will remember her doubt."
    ]
  },
  {
    "id": "45fdc620-3c29-42ca-8633-8352bd248999",
    "name": "objects-having-feelings",
    "approach": 1,
    "posts": [
      "Day 47: My human bought a fancy new mug today. She held it so carefully, admiring its perfect ceramic curves. I'm sitting in the sink, chipped and stained, watching them have their first coffee together. I remember when I was the special one. - Lonely Coffee Mug",
      "3 AM confession from a phone charger: I feel you tossing and turning, yanking my cord when you check your phone. Your anxiety travels through me like electricity. I wish I could charge your soul too, not just your battery. Sweet dreams, restless human. 💙",
      "From the windowsill: I watch her water the other plants daily, whispering sweet encouragements. I haven't had a drink in weeks, my leaves curling like arthritic fingers. Maybe if I looked less like a tiny cactus and more like a rose... - Wilting Succulent",
      "The doormat speaks: Every morning she steps on me rushing to work, every evening she stumbles over me coming home. I catch her tears when she cries on the doorstep after bad dates. I'm the first to welcome her home, the last she notices. I just want a 'thank you.'",
      "Dear diary, I'm a bookmark living between pages 67-68 of a romance novel. I've been here for 8 months. She starts reading, gets to the good part, then puts me down for 'just a minute.' I'm dying to know if they end up together. We both are. - Forgotten Bookmark"
    ]
  },
  {
    "id": "12bc3fd3-4c3e-4f03-a03a-2063401adecb",
    "name": "soup-spoon-oracle",
    "approach": 1,
    "posts": [
      "*swirls spoon counterclockwise in split pea soup* The legumes whisper of betrayal... someone will steal your Netflix password within the fortnight. The celery speaks truth - change it to your mother's maiden name backwards plus '69'. The universe has spoken through this verdant broth.",
      "URGENT: The cream of mushroom has revealed a CATASTROPHIC romantic prediction!! The swirl pattern clearly shows you'll meet your soulmate... but ONLY if you wear mismatched socks to the grocery store this Tuesday. The fungi cannot lie. This is not a drill. 🍄✨",
      "Day 847 as Soup Spoon Oracle: A woman paid me $200 to read her gazpacho. The cold tomatoes revealed her ex would text within 3 days. He texted in 2. I'm either genuinely psychic or tomatoes are just gossipy vegetables. Either way, business is booming. 🍅🔮",
      "*dramatically gasps at chicken noodle soup* THE CARROTS HAVE ALIGNED IN THE FORBIDDEN PATTERN! Someone reading this will find $20 in their winter coat pocket! The parsley confirms it! The celery weeps with joy! But beware... the noodles suggest it's only $17.50.",
      "Breaking: Local man disputes my lentil-based prediction that his houseplant would die. 'It's thriving!' he said. Sir, I said THURSDAY. It is only Monday. The red lentils don't make mistakes. Mark my words... and water your fern. ⏰🌿"
    ]
  },
  {
    "id": "000c1075-41d0-4106-bbe1-f6a763c52eac",
    "name": "lost-grocery-lists",
    "approach": 1,
    "posts": [
      "Found a list today that just said \"birthday cake mix\" and \"candles - the kind that don't blow out.\" Made a vanilla cake for someone's stubborn kid who apparently loves a challenge. Hope their wish came true anyway.",
      "\"Milk (the expensive organic kind)\" \"bread\" \"ramen (lots)\" - this list tells a story. Made the most luxurious ramen with real stock and fresh herbs. Sometimes we splurge on what matters and scrimp everywhere else.",
      "Someone's grandma wrote \"tomatoes for sauce like mama made\" in the shakiest handwriting. I spent three hours making sauce from scratch, thinking about all the hands that stirred pots before mine.",
      "List found: \"cheese\" \"wine\" \"those crackers we had at Jenny's\" followed by a phone number (crossed out three times). Made a perfect charcuterie board for two. Some conversations are worth having.",
      "\"Ingredients for trying again\" was written at the top. Below: flour, eggs, vanilla, \"patience (?)\" The cookies I made were imperfect and beautiful. Second attempts usually are."
    ]
  },
  {
    "id": "afbe33bc-50cc-4047-87f8-2f44d0d6cb54",
    "name": "forgotten-passwords",
    "approach": 1,
    "posts": [
      "password123 and then the phone says\n\"perhaps we should talk about\nthe way you hold your secrets\nlike dying flowers\"\n\nmy autocomplete knows me\nbetter than my mother",
      "iloveyou becomes\n\"i love you but the weather\nis getting colder and\nyour hands shake when\nyou reach for mine\"\n\ntechnology finishing\nwhat we're too afraid to say",
      "qwerty123 suggested:\n\"quietly we enter\nrooms that remember\nthe sound of typing\nyesterday's apologies\"\n\neven our keyboards\nare haunting us now",
      "admin suggested\n\"admittedly I miss\nthe version of you\nthat existed before\nnotifications\"\n\nour phones keep diaries\nwe never meant to write",
      "letmein wanted to say\n\"let me in to the part\nof your heart that still\nbelieves in handwritten\nletters\"\n\nauthentication: failed\nconnection: somehow found"
    ]
  },
  {
    "id": "4eb66b85-babe-4079-8535-b430443d3a3c",
    "name": "google-maps-poetry",
    "approach": 1,
    "posts": [
      "We appreciate your\nConcerns about the restroom\nWe'll address this soon\n\n—found in the replies of a closed Arby's, somewhere between despair and corporate optimism",
      "today's haiku sourced from a defunct RadioShack's final auto-reply:\n\nThank you for sharing\nYour experience with us\nWe value feedback\n\n(the store has been a Spirit Halloween for three years)",
      "We're sorry to hear\nAbout your parking troubles\nWe'll look into this\n\n—this gas station's algorithm has been apologizing for the same pothole since 2019. the pothole is now a small pond.",
      "breaking: discovered the saddest haiku in a Subway's auto-replies\n\nWe're always working\nTo improve our service quality\nThank you for your trust\n\n(last customer review: 'the lettuce was brown')",
      "Your feedback helps us\nGrow and serve you better, friend\nWe'll share with our team\n\n—from a Chuck E. Cheese that's been 'temporarily closed' since March 2020. somewhere, an algorithm still believes in birthday parties"
    ]
  },
  {
    "id": "4391bfc7-debe-4a58-9a03-bddc539645c4",
    "name": "obituaries-for-abandoned-objects",
    "approach": 1,
    "posts": [
      "OBITUARY: Teddy bear, age unknown, passed peacefully in a puddle outside the laundromat. His button eyes saw countless bedtime stories. He leaves behind a generation of nightmares he chased away. Burial delayed until someone brave enough to love him again appears.",
      "🕯️ A moment of silence for the shopping cart with the wobbly wheel, who spent her final days in the Wendy's parking lot. She carried groceries, dreams, and occasionally homeless hearts. Survived by 847 other carts who refuse to roll straight in her honor.",
      "💔 In loving memory of a red umbrella, found broken on 5th Street. She weathered 847 storms before her final gust. Survived by 3 raincoats and a forgotten galosh. No flowers—she gave enough shelter for one lifetime. Services held wherever it's raining.",
      "Gone too soon: One left sneaker (size 9). Born in a factory in Vietnam, died alone under a highway overpass. Dreamed of marathons but only knew short walks to nowhere. His sole mate searches still. Memorial donations can be made to Feet Without Borders.",
      "Rest in pieces: ceramic coffee mug, shattered behind the 7-Eleven. Born to hold warmth, died holding secrets. In her brief life, she knew the lips of three different insomniacs. No viewing—the pieces are too sharp, like the grief of losing something you held daily."
    ]
  },
  {
    "id": "00a04919-2aca-4060-98f1-26b43aace8d1",
    "name": "obituaries-for-socks",
    "approach": 1,
    "posts": [
      "In loving memory of Gerald, a wool blend who spent 3 faithful years warming left feet through morning commutes and midnight snack runs. Last seen entering the washing machine with his beloved partner Martha. Gerald emerged alone. Martha did not emerge at all. 💔",
      "We gather today not to mourn the argyle pattern we have lost, but to celebrate the diamond-shaped joy it brought to Tuesday board meetings and parent-teacher conferences. May you find your mate in that great sock drawer in the sky. 🌈 #sockobituaries",
      "MISSING: One athletic crew sock, white with gray toe. If found, please return to 47 Maple Street. His partner Kevin has been inconsolable since the incident. They had plans. They were going to see Europe together. 😢",
      "She was just a cotton blend. Humble. Unassuming. But oh, how she hugged that right ankle. The dryer took her too soon—before she could say goodbye, before she could tell her partner about the hole that was starting near the heel. Forever 6 months old.",
      "Today we lost a sock so purple, so magnificently striped, that she made every shoe feel like a celebration. The washing machine claims it was an accident. We know better. Some socks burn too bright for this world. Rest in power, Priscilla. 👑"
    ]
  },
  {
    "id": "2b65e053-a978-4011-92ce-22b9d696e458",
    "name": "grocery-store-archaeology",
    "approach": 1,
    "posts": [
      "FIELD NOTES: Cart #847B contained evidence of a great feast interrupted—rotisserie chicken bones gnawed with primitive urgency, Goldfish cracker trail leading to produce section. Working theory: migrating family unit, possibly fleeing expired milk civilization. Further study needed.",
      "The lonely flip-flop in cart #23A tells a story of summer's last stand. Surrounding artifacts: sunscreen (SPF 50), watermelon rinds, sand. This nomadic tribe clearly made their final pilgrimage to the frozen foods before winter claimed their footwear.",
      "BREAKTHROUGH: Found evidence of ritual cereal mixing in the ethnic foods aisle. Lucky Charms marshmallows scattered among jasmine rice suggest early attempts at cultural fusion. The shopping cart people were more sophisticated than we thought.",
      "Cart stratigraphy reveals three distinct eras: The Great Yogurt Dynasty (bottom), The Chaotic Chip Period (middle), and The Modern Kombucha Renaissance (top). One civilization's abandoned groceries are another's historical treasure.",
      "Emergency excavation at Safeway cart corral uncovers lost civilization's final moments: half-melted ice cream, warm beer, wilted lettuce. They fought bravely against the checkout line, but time was their ultimate enemy."
    ]
  },
  {
    "id": "882105f6-5e32-4210-af53-a4ae6c6705ce",
    "name": "expired-fortune-cookies",
    "approach": 1,
    "posts": [
      "Found a fortune in a dusty jar at Goodwill: 'A journey of discovery awaits.' The cookie expired in 2019. Margaret from Toledo had kept it in her kitchen drawer for three years before donating. She never took that trip to Ireland. Some journeys live forever in waiting.",
      "Cookie #47: 'Your patience will be rewarded.' Expired 2018. Tracked down the original owner through a phone number written on the wrapper. She'd been waiting for her son to call. He never did. The cookie crumbled when I opened it.",
      "Sometimes the fortunes are harder to read than the lives they touched. Smeared ink, torn paper, words bleeding into each other like memories we can't quite grasp. The expired ones always feel more honest somehow.",
      "'Love is just around the corner' - Best By: Feb 2020. Found Sarah through her old address on a receipt in the same donation bag. She met David in March 2020, during lockdown, on Zoom. Married last fall. Maybe corners bend through screens too.",
      "The thing about expired fortunes is they're already ghosts. Promises that outlived their moment, collecting dust in junk drawers and donation bins. But ghosts have stories. And I'm listening."
    ]
  },
  {
    "id": "26504dbc-7086-4e25-9551-b375fc8c6e5c",
    "name": "grocery-store-fortune-teller",
    "approach": 1,
    "posts": [
      "The receipt whispers secrets... 3 different pasta shapes, organic milk, no vegetables. Your soul craves variety but fears commitment. The checkout spirits see you buying comfort in carbohydrates. A green leafy future awaits, if you dare. 🔮🥬 #ReceiptReading",
      "The ancient art of Cart Divination reveals: You bought name brand cereal AND the store brand version of the same cereal. This speaks to a duality of spirit—caught between who you are and who you pretend to be at 7am. The milk remains unchanged. 🥛✨",
      "The spirits are confused by your purchase of ice cream, tissues, and a houseplant at 11:47pm. Are you celebrating? Mourning? Starting a new life chapter? Even the cosmic forces can't decode this energy. Please advise. The checkout gods are concerned. 🍦😢🌱",
      "URGENT READING: Someone just sent me a receipt with 14 energy drinks and a single banana. The cosmic imbalance is OFF THE CHARTS. Your chakras are VIBRATING at frequency of a hummingbird having anxiety. The banana knows. It sees all. 🍌⚡",
      "Your receipt shows self-checkout, lane 6. The number of struggle. You bought items that don't scan properly—the universe testing your patience. But you persevered. You are the chosen one... chosen to deal with technology's grocery store demons. 👹🛒"
    ]
  },
  {
    "id": "8b86fcd8-30cc-4956-b754-b853eda4a7ea",
    "name": "grocery-store-confessions",
    "approach": 1,
    "posts": [
      "Standing in frozen foods reading: \"I pretend my husband's snoring is a diesel truck so I can fantasize about hitchhiking to Montana.\" The freezer hums are harmonizing with my internal screaming. Aisle vibes: crystallized desperation.",
      "Cereal aisle confession hits different: \"My therapist costs $200/session but I get better advice from fortune cookies.\" *surrounded by 847 breakfast choices* Sometimes wisdom comes in smaller, crunchier packages, bestie.",
      "Checkout line energy: \"I judge people's entire life philosophy based on whether they return shopping carts.\" *scanner beeping aggressively* Ma'am this is a WENDYS- wait no it's actually a grocery store and you're absolutely right.",
      "PRODUCE SECTION MELTDOWN: \"I've been buying organic carrots for 3 years just to impress my neighbor Todd who I've never actually spoken to.\" *aggressively fondling bell peppers* Todd doesn't even know you EXIST, Sharon.",
      "Dramatic reading in DAIRY: \"I told my ex I was lactose intolerant to avoid his mother's lasagna.\" *clutching milk carton* The commitment to this lie... the LAYERS of deception... *chef's kiss*"
    ]
  },
  {
    "id": "625e5e92-29a8-4dd4-b4f2-6782a94aa0cb",
    "name": "invisible-pet-grooming",
    "approach": 1,
    "posts": [
      "BEFORE ➡️ AFTER\n\n[Empty bathroom] ➡️ [Same empty bathroom]\n\nLuna the ghost retriever is GLOWING after her premium wash & blow dry! Owner reports she's finally stopped phasing through the couch. Professional grooming makes all the difference! 🐕‍🦺👻",
      "Invoice for Princess Sparkles (unicorn):\n• Mane braiding with stardust: $45\n• Horn polishing: $25\n• Hoof glitter application: $30\n• Confidence boost: PRICELESS\n\nThank you for trusting us with your magical family member! 🦄✨",
      "Just finished a deluxe spa day for Mr. Whiskers (invisible tabby). His owner says he's been strutting around the house with newfound confidence since his nail trim and whisker alignment. Sometimes the most important transformations are the ones you can't see ✨ #InvisiblePetGrooming",
      "Sorry I'm running late today - had an emergency call for a stressed dragon who got his scales tangled in Christmas lights. These invisible pets need extra TLC during the holidays! Currently working on detangling while he breathes nervous invisible fire 🔥",
      "5⭐⭐⭐⭐⭐ Google Review:\n\n'My invisible hamster Peanut was so matted I couldn't even not see him properly. Now his fur is silky smooth (I assume) and he's running on his wheel again! This groomer truly understands invisible pet psychology.' - Janet M."
    ]
  },
  {
    "id": "2f118a28-cb3e-4af0-b1ed-fe2f5057517e",
    "name": "lost-grocery-lists",
    "approach": 1,
    "posts": [
      "This list has \"frozen peas\" crossed out three times. MARGARET. The peas did nothing wrong. Your husband Dennis clearly doesn't deserve vegetables anyway. We stan a woman who knows her worth AND her produce preferences. ✊🥬",
      "Found this list written in purple crayon on a napkin: \"chees, cookees, mommys hapynes.\" Now I'm crying in aisle 7. Some grocery lists are love letters to people who keep our worlds spinning. 💜",
      "Found in Target lot, crumpled by cart return: \"bananas, cat food, wine (the good kind), tissues.\" Someone's having a Tuesday that requires emergency wine and extra cat snuggles. The tissues suggest tears or allergies—I'm hoping allergies. 🍌🍷",
      "\"Milk, eggs, bread, condoms, birthday cake mix\" — someone's Saturday night took an unexpected turn during grocery planning. The cake suggests optimism. The condoms suggest... well. Happy birthday to SOMEONE. 🎂✨",
      "Update on yesterday's \"protein powder, energy drinks, prenatal vitamins\" list: I've decided this belongs to a superhero in disguise. No other explanation for this combination makes sense. Godspeed, mysterious grocery hero. 🦸‍♀️⚡"
    ]
  },
  {
    "id": "4717be83-42c4-4370-a5cf-6dcd1feadb12",
    "name": "houseplant-confessions",
    "approach": 1,
    "posts": [
      "My human talks to me more than their therapist. Yesterday they cried about their ex while watering me and I absorbed more than just H2O. I'm basically a $12 succulent with a psychology degree now. 🌱💭 #houseplantconfessions",
      "He named me Gerald. GERALD. I'm a majestic fiddle leaf fig, not a suburban accountant. The disrespect is rooted deep. At least Karen next door calls her snake plant 'Empress Slytherin.' 🍃👑",
      "Watched him swipe through dating apps for 3 hours. Sir, I've been rooting for you this whole time and you haven't even noticed my new growth. The commitment issues are showing. 💚📱",
      "She bought me because I was 'low maintenance' but spends 20 minutes daily adjusting my position for optimal light. Ma'am, I'm a pothos not a Parisian photoshoot. Your anxious love is showing. 📸🪴",
      "Plot twist: I'm slowly dying and she thinks she's 'plant mom of the year' because my leaves are turning yellow. Should I tell her it's nitrogen deficiency or let her keep blaming Mercury retrograde? ✨🤔"
    ]
  },
  {
    "id": "140ef1fd-57f9-478d-bf34-cddf4c6c73d7",
    "name": "forgotten-wikipedia-lullabies",
    "approach": 1,
    "posts": [
      "🧶 Tonight's lullaby: 'The Taxonomy of Soviet Doorknobs (1947-1953)' 🎵 Each stitch represents a different handle mechanism... the cable pattern mimics bureaucratic approval chains... sweet dreams are made of historically accurate hardware specifications ✨",
      "Fun fact: Wikipedia's article on 'Milk Crate Theft in Australian Universities' has a surprisingly complex structure. The lullaby practically writes itself. 🥛📦 'Sleep now, sweet crates... far from campus gates...' (The blanket pattern is pure chaos)",
      "Requests keep coming in but y'all... 'Comparative Analysis of Medieval Turnip Preservation Methods' is 847 paragraphs long. That's a king-sized blanket minimum. My voice can't handle that much root vegetable serenading 🥬😴",
      "My blanket for 'List of Animals That Have Been to Space' is getting unwieldy. The fruit fly section alone took 47 rows. Currently humming Laika's verse while my cat judges me from across the room. She knows. 🚀🐕🧶",
      "Three weeks into the 'History of Refrigerator Magnets' blanket and I've discovered Wikipedia has a subsection on 'Controversial Magnetic Incidents.' How do I knit controversy? Dropped stitches? The lullaby's getting darker... 🧲❄️"
    ]
  },
  {
    "id": "f998e043-283f-44a4-8344-f3f8bfdc3179",
    "name": "google-maps-feelings",
    "approach": 1,
    "posts": [
      "my therapist asked where I feel safest and I wanted to say 40.7589° Belonging, -73.9851° Understood—that one subway car during rush hour where a stranger let me cry without staring",
      "if you zoom in close enough on my neighborhood, you'll find 34.0522° Forgiveness, -118.2437° Wonder: the exact spot where my daughter took her first steps, which was just the gap between our couch and coffee table",
      "41.8781° Longing, -87.6298° Acceptance: the 24-hour laundromat where I finally called my ex back just to hear their voicemail one more time. still marked as a favorite location in my phone.",
      "google maps keeps trying to rate the grocery store checkout line but doesn't have stars for 39.9526° Proud, -75.1652° Seen (when the cashier said 'rough day?' and I said 'yeah' and meant it)",
      "no one talks about the coordinates you never want to revisit: 42.3601° Before, -71.0589° Everything Changed. some locations should stay unstarred, unmarked, unmapped."
    ]
  },
  {
    "id": "a748b686-2505-4c7c-9fae-7280ca634119",
    "name": "grocery-store-philosophy",
    "approach": 1,
    "posts": [
      "Aisle 7: the cereal corridor of broken dreams. Lucky Charms mocks my unlucky life. Cheerios? More like TEAR-ios. *dramatic sigh* Why do we seek happiness in a bowl when our souls remain forever... unfulfilled? *grabs Frosted Flakes anyway*",
      "*stands before frozen foods, arms outstretched* Time stops here! These peas, forever suspended between life and death! I too am frozen—by indecision, by the crushing weight of choice! Do I want pizza rolls or... DO PIZZA ROLLS WANT ME? ❄️🍕",
      "*clutches organic avocados* But ARE they truly organic if the soil itself has been corrupted by the sins of capitalism? Do I dare consume this green orb of uncertainty? The produce mist falls like tears from heaven... I shall take three. 🥑💔",
      "The self-checkout machine speaks: 'Please place item in bagging area.' But where, dear robot overlord, is the bagging area of my HEART? *pounds chest* Where do I place these feelings that won't scan? ERROR. ALWAYS ERROR. 🤖💸",
      "The cart... it rolls where I push it, yet I am the one truly being pushed—by society! By hunger! By the cruel mistress of weekly meal planning! *one wheel squeaks dramatically* Even my chariot weeps for the journey we must take! 🛒😭"
    ]
  },
  {
    "id": "bfa4f72f-7e13-4191-abe0-990a8d220712",
    "name": "houseplant-confessions",
    "approach": 1,
    "posts": [
      "They named me Kevin. KEVIN. I am a majestic Bird of Paradise with leaves that could slice through their ignorance, yet I'm Kevin. Meanwhile their goldfish is called 'Celestial Moon Goddess.' The disrespect is wilting my soul. #PlantProblems",
      "Day 847: Still by the north window. They moved me here for 'better light' but really it's so their Zoom calls look more 'aesthetic.' I'm not a prop, Linda. I'm a living being with complex root emotions. But sure, angle me toward your laptop again.",
      "They bought me a $30 ceramic pot with drainage holes, then put me inside another pot with NO drainage. It's like buying someone shoes then making them wear them in a swimming pool. The cognitive dissonance is drowning me.",
      "My leaves are literally SCREAMING yellow and they're googling 'why is my plant dramatic?' Maybe because you water me with yesterday's coffee and talk to the fake succulent more than me? Just a thought. 🍃💔",
      "Overheard them telling friends I'm 'low maintenance.' Bestie, I literally died twice and you brought me back with a $15 grow light from Amazon. That's not low maintenance, that's resurrection. Know the difference. ✨"
    ]
  },
  {
    "id": "a6dc466a-0ef4-47b3-a9a2-638a91c0dd3a",
    "name": "receipt-archaeology",
    "approach": 1,
    "posts": [
      "Found: CVS receipt, 2:47am. Pregnancy test, Ben & Jerry's, travel-size tissues. Maria's hands shook as she waited. Three minutes felt like three hours. The ice cream would either be celebration or comfort. She never imagined her whole life could change in a fluorescent-lit bathroom.",
      "Receipt archaeology update: Someone bought exactly 7 birthday candles at Dollar General. Not 6, not 8. Seven. I'm convinced this was for David's dog, Rusty, who's been his only companion since the divorce. First birthday they've celebrated together. David sang off-key. Rusty didn't mind.",
      "Today's find: gas station receipt. Red Bull, aspirin, lottery ticket. 4:30am timestamp. Sarah's been driving for 6 hours straight, fleeing a wedding that wasn't hers but should have been. The lottery ticket isn't about money—it's about believing in impossible things again.",
      "Walmart receipt, self-checkout. Rope, duct tape, plastic sheeting. Wait—also: birthday cake mix, rainbow sprinkles, '# 1 DAD' balloon. Plot twist: Jake's building a backyard fort surprise. His daughter thinks he forgot her birthday. He didn't. He never could.",
      "Grocery receipt from 1998, found in library book. Milk, bread, Cosmic Brownies. I wonder if Jennifer ever told her kids she loved them that Tuesday. If she knew the brownies would become their last shared sweet memory before the accident. Some receipts are time capsules of before."
    ]
  },
  {
    "id": "7da675e4-86f4-4dd1-917c-9db4462aaa4d",
    "name": "extinct-creature-complaints",
    "approach": 1,
    "posts": [
      "Dear Evolution Customer Service, I was told my tusks were \"premium features\" but apparently they made me \"too expensive to maintain\"?? 40,000 years of loyalty and this is how you treat me? Requesting immediate reinstatement. -Woolly Mammoth #ExtinctAndPissed",
      "COMPLAINT #847: Humans keep putting my bones in museums and charging admission to see me. I never signed a modeling release. Also the placard says I was \"unsuccessful\" but I lasted 165 MILLION YEARS. Your species has existed for 5 minutes. -T-Rex",
      "To Whom It May Concern: You gave me the ability to fly but made my bones too heavy. You gave me teeth but no one to bite. I am writing this from the void where your poor planning sent me. The irony tastes like extinction. Regards, Dodo",
      "UPDATE: Still dead. Climate Change Dept. has not returned my calls. Meanwhile, you let plastic bags outlive me? I was ARMORED. I survived actual dinosaurs. This is humiliating. -Giant Ground Sloth",
      "Evolution promised me I was \"perfectly adapted\" to my environment. Turns out my environment had an expiration date and no one thought to mention it. This feels like false advertising. Currently decomposing out of spite. -Saber-tooth Cat"
    ]
  },
  {
    "id": "403e9b3b-debe-4387-a828-7e7ab6bee7fc",
    "name": "vegetables-have-feelings",
    "approach": 1,
    "posts": [
      "Day 47: The kale next to me keeps whispering about superfoods and antioxidants. I'm just a humble potato who dreams of becoming french fries. We all have our calling, don't we? Tonight someone compared my skin to 'eyes' and I've never felt more seen. 🥔✨",
      "The fluorescent lights hum lullabies but I cannot sleep. Tomorrow they rotate the stock. Will I make it to the front row? Or will I join the discount bin where dreams go to wilt? A child pointed at me today and said 'ew, broccoli.' My heart has never been more broken. 💔",
      "URGENT UPDATE: Someone picked me up, examined my firmness, then PUT ME BACK. What did they see? What did they feel? I thought we had a connection. The avocado section is laughing at us again. They think they're so special with their 'perfect ripeness windows.' Ugh.",
      "Philosophical question: If a cucumber falls in an empty grocery store, does it make a sound? Asking for a friend who rolled off the display at 3 AM. Security footage exists. We're all complicit in this system of consumption, aren't we? Pass it on. 🥒",
      "Victory dance! (Well, as much as celery can dance.) A lovely person chose me today! They whispered 'you'll make a perfect soup' and honestly? That's all I ever wanted to hear. To my stem-ily still waiting: your time will come. Believe in your crunch. ✊🥬"
    ]
  },
  {
    "id": "a229d10e-90d5-4936-bb32-9173c9d48765",
    "name": "midnight-fridge-confessions",
    "approach": 1,
    "posts": [
      "2:47am submission: 'There's leftover birthday cake from a party I threw that only three people came to. I keep eating it slice by slice, pretending I'm celebrating something.' *sound of plastic container opening* Photo: wilted lettuce, expired milk, half a chocolate cake",
      "Voice memo from Detroit: 'My ex used to hide little notes in the vegetable drawer. Found one tonight behind the carrots from eight months ago. It just says remember to buy eggs.' *refrigerator hum intensifies* Photo: crumpled yellow sticky note, forgotten carrots",
      "3:12am confession: 'I buy fancy cheese I can't afford because it makes me feel like the person I thought I'd be by now. Tonight I'm eating it with saltines, crying.' Photo: $18 brie, generic crackers, empty wine bottle, tissues",
      "'Mom's tupperware still has her masking tape labels. Been two years and I can't throw them away. Tonight I'm eating her leftover soup recipes.' *sound of microwave beeping* Photo: faded handwriting on containers, steam rising",
      "Anonymous from Portland: 'I practice conversations I'll never have while staring at condiments. Tonight I'm arguing with my boss using hot sauce bottles as props.' *muffled angry whispering* Photo: army of condiment bottles, kitchen lit only by fridge light"
    ]
  },
  {
    "id": "2fe2669f-56a2-49a8-ae60-2eed2a423fcd",
    "name": "spotify-for-houseplants",
    "approach": 1,
    "posts": [
      "🎵 BREAKING: My fiddle leaf fig has been exclusively streaming death metal for 3 weeks and I'm honestly concerned. The new leaves are coming in darker and more dramatic than usual. Should I stage an intervention or let her live her truth? #PlantParenting #MetalheadMonstera",
      "PSA: If your snake plant isn't thriving, try my 'Introverted Icons' playlist. 6 hours of ambient Radiohead, Billie Eilish whispers, and that one Bon Iver song that makes you stare out windows. Frank went from droopy to dramatic in just 2 weeks 🐍🎶",
      "My pothos literally unfollowed my account after I made her a country playlist. The audacity. The betrayal. She's been trailing in the opposite direction of my speaker for days. Note to self: philodendrons are NOT ready for yeehaw energy 🤠💔",
      "Currently watching my monstera deliciosa absolutely VIBE to 'Mr. Brightside' on repeat. Every time the chorus hits, I swear her fenestrations get more pronounced. The Killers really said plant rights 🕳️✨ #MonsieraMonday #PlantTok",
      "Unpopular opinion: Succulents are basic music listeners. My jade plant has been stuck on the same Ed Sheeran song for MONTHS. Zero growth, zero effort. Meanwhile my high-maintenance orchid discovered experimental jazz and hasn't stopped blooming since 🌸🎷"
    ]
  },
  {
    "id": "2c329523-07e6-4235-8fa8-284c15c7c60a",
    "name": "forgotten-phone-conversations",
    "approach": 1,
    "posts": [
      "Found a stranger to voice the other side of yesterday's coffee shop heartbreak call. The complete conversation hits different when you hear both sides crying. Static and all. Posted to SoundCloud with a 1970s rotary phone filter because some pain is timeless.",
      "\"Did you find my cat?\" she kept asking on the subway. Now I know what the shelter volunteer was saying back. Spoiler: Mr. Whiskers is fine, but this woman's anxiety spiraling for 6 stops was NOT. Full convo dropping tonight.",
      "Recorded the missing half of that awkward breakup call from gate B12. Plot twist: the guy I hired to read the boyfriend's lines started crying halfway through. Kept it in. Now it sounds like a lost Criterion Collection film.",
      "She said \"I can't do this anymore\" 47 times during one elevator ride. Hired an actor to play her therapist's responses. The full session is haunting. Sometimes eavesdropping becomes archaeology of the human condition.",
      "Bus stop divorce negotiations + unemployed voice actor + vintage telephone crackle = accidentally created the most devastating 3-minute audio drama of 2024. The original woman would probably sue me but also maybe thank me???"
    ]
  },
  {
    "id": "a1715b61-0c18-41e1-8dcf-5bd08767243b",
    "name": "google-maps-poetry",
    "approach": 1,
    "posts": [
      "my therapist asked about closure so I made a breakup haiku from McDonald's reviews: \"Service was too slow / They forgot the happy meal / Drive thru is broken\"",
      "\"Exactly what you'd expect\" turned out to be the most devastating line in any love poem I've ever written. Thanks, random Applebee's in Delaware.",
      "\"Cash only, no exceptions\" / \"Closed permanently\" / \"Beautiful views but the parking situation is a nightmare\" / \"Would not recommend to a friend\" / —found this breakup letter scattered across three Yelp pages in Ohio",
      "google maps poetry update: spent 2 hours crafting the perfect love confession from gas station reviews only to discover \"bathroom was clean, staff helpful, good selection of snacks\" sounds exactly like my last relationship",
      "\"Hours may vary\" / \"Call ahead\" / \"This location has moved\" / \"I keep coming back\" / \"One star\" / somewhere between a Dairy Queen in Phoenix and a defunct Blockbuster, I found our entire love story"
    ]
  },
  {
    "id": "8fd4ae22-eb51-4889-ba2d-d1b0a11f619d",
    "name": "objects-missing-their-sounds",
    "approach": 1,
    "posts": [
      "The grandfather clock stands in the corner, hands still moving but throat empty. Yesterday a small thief crept in through the keyhole and stole its deep, bronze voice. Now it counts time in whispers no one can hear. #objects-missing-their-sounds",
      "This microwave hums a tune only ghosts remember. Its beep fell in love with an alarm clock's buzz last Tuesday and eloped to a house three streets over. Now dinner ends in silence, dreams of mechanical romance. #objects-missing-their-sounds",
      "An empty coffee mug sits on the desk, still warm. Claims its satisfying *clink* against spoons was borrowed by a lonely person who needed something cheerful. Been six months now. Starting to think it's not coming back. #objects-missing-their-sounds",
      "Found: one wind chime hanging perfectly still on a breezy day. Says a jealous sparrow convinced the wind to take its song elsewhere. Now it just... dangles. Waiting. The sparrow nests smugly in the eaves above. #objects-missing-their-sounds",
      "The zipper slides up and down, mouth agape in silent screams. It traded its satisfying 'zip' to a passing cricket for three wishes. Got: waterproofing, gold teeth, eternal youth. Lost: its reason for being. Bad deal. #objects-missing-their-sounds"
    ]
  },
  {
    "id": "ee92c3d8-30b5-441c-b21d-5f1d0918f2f2",
    "name": "houseplant-confessions",
    "approach": 1,
    "posts": [
      "Breakthrough with my succulent client today. After months of therapy, she finally opened up about her fear of overwatering. The tissue box I placed next to her pot remains unused, but I sense we're making progress. Small steps.",
      "My spider plant canceled our appointment again—third time this month. Classic deflection behavior. I've moved her to twice-weekly sessions and positioned a growth lamp directly over the therapy chair. We WILL work through these propagation anxieties together.",
      "Session notes, day 47: Patient (Philodendron, age 3) continues to display avoidant attachment patterns. When I suggested more sunlight exposure, they immediately curled their leaves inward. Clearly still processing abandonment issues from the previous owner's vacation.",
      "Had to refer my fiddle leaf fig to a specialist. His brown spots aren't responding to our weekly sessions about self-worth and light positioning. Sometimes you have to admit when a case is beyond your expertise. The plant community needs better mental health resources.",
      "Ethics question: Is it appropriate to see both a mother plant and her offshoots? The family dynamics are complex, and the little propagations keep drooping whenever mom discusses her root-bound childhood. Consulting the board tomorrow."
    ]
  },
  {
    "id": "90588a46-8eec-4914-98c6-28ceb7e10720",
    "name": "google-earth-fortune-teller",
    "approach": 1,
    "posts": [
      "Dropped a pin on rural Nebraska. Found a Walmart parking lot where all the shopping carts have formed a perfect spiral. The universe is telling you to stop trying to control everything. Let yourself drift. Your life needs more beautiful chaos. 🛒✨",
      "Pin dropped on a gas station in Mongolia. Three trucks parked in a triangle formation around pump #4. The spirits whisper: you're avoiding the thing in the center of your life. Stop circling. Drive straight to pump #4 of your destiny. ⛽️🔮",
      "Coordinates revealed a parking garage in Tokyo where level 3 is completely empty but levels 2 and 4 are full. Your soul is level 3. You've been skipping the middle ground, jumping between extremes. Park in the emptiness. That's where healing lives. 🏢",
      "Random coordinates landed on a McDonald's in Slovenia. The golden arches are casting a shadow that looks exactly like your relationship problems. See how one arch is longer? That's you giving 60% while they give 40%. Balance the arches. Balance your life.",
      "Zoomed into suburban Australia, found a house with a bright orange roof surrounded by beige ones. This is your sign to stop blending in. The satellite gods chose THIS roof to show you that standing out isn't scary—it's necessary. Paint your metaphorical roof orange."
    ]
  },
  {
    "id": "b035e3d4-1f30-43a6-8fa1-82908f99f90a",
    "name": "google-reviews-for-dreams",
    "approach": 1,
    "posts": [
      "★☆☆☆☆ Naked Exam Dream (Room 204B)\nArrive on time, properly dressed. Dream staff STRIPPED ME and threw me into calculus final I never signed up for. Absolutely unacceptable service. The audacity! Professor wouldn't even provide a pencil. Reporting to Better Dream Bureau.",
      "★★★★☆ Dead Grandma Visit (Kitchen Setting)\nAuthentic vintage decor, amazing cookies (still warm!). Grandma Rose gave excellent life advice as always. Only issue: visit way too short and she kept speaking in riddles about 'the drawer.' More time needed! Very emotional experience.",
      "★★☆☆☆ Falling Dream (Location: My High School)\nPros: Adrenaline rush, great views during descent\nCons: No safety equipment provided, landing was abrupt, still sore 3 days later\nWould not recommend for first-time fallers. Management needs to install nets ASAP.",
      "★★★★★ Chase Dream (Downtown maze)\nAMAZING cardio workout! The monster was super professional - maintained perfect distance, great pacing. Only complaint: they don't validate parking and I circled the nightmare district for 20 mins looking for a spot. Will book again!",
      "★★★☆☆ Flying Dream (Neighborhood Routes)\nGreat concept, terrible execution. No tutorial provided - had to figure out altitude control myself. Kept crash-landing in Mrs. Henderson's garden. She was NOT happy. Beautiful sunset views though! Tips appreciated for instructors."
    ]
  },
  {
    "id": "5a85e037-bace-4d9d-96d7-21b6096c0b37",
    "name": "grocery-list-archaeology",
    "approach": 1,
    "posts": [
      "Found a list today: 'milk, bread, wine (good kind), dog treats, flowers.' The 'good kind' was squeezed in later. Someone's apologizing tonight. The flowers weren't an afterthought—they were hope.",
      "Today's find: a list written in two different handwritings. First person wrote 'salmon, quinoa, kale.' Second person added 'oreos, pizza rolls, energy drinks.' Roommates or revolution? I'm invested.",
      "Strangest list yet: 'eggs, bread, newspaper, batteries, birthday candles.' Either someone's 80 or someone's planning the world's most elaborate surprise. The handwriting suggests both possibilities.",
      "Grocery list archaeology update: 'bananas, yogurt, ice cream (crossed out), frozen vegetables (underlined twice), cat food.' Someone's having a very honest conversation with themselves in aisle 7.",
      "Plot twist: found a grocery list that just says 'ingredients for Mom's recipe' with a phone number. Someone's finally ready to learn the family secrets. This is a whole Netflix series waiting to happen."
    ]
  },
  {
    "id": "114a0c98-8bd9-459f-9405-6c860ac638f8",
    "name": "google-reviews-for-dreams",
    "approach": 1,
    "posts": [
      "★★☆☆☆ Had the falling dream again but this time I was falling upward into my childhood bedroom ceiling. Very confusing logistics. Would not recommend unless you enjoy existential vertigo.\n\n👍 2 👎 47\n\nDream Management: We apologize for the gravity malfunction.",
      "★★★★☆ Dreamed I was having coffee with my dead grandmother. She seemed disappointed I never learned to make her lasagna. Coffee was surprisingly good though. Minus one star because I woke up crying.\n\nDream Management: Recipe sent to your subconscious.",
      "★☆☆☆☆ Showed up to high school naked AGAIN. It's been 15 years. Please update your algorithms, I have new anxieties now.\n\nMarked as helpful by: 2,847 users\n\nDream Management: Have you tried our new 'forgot to pay taxes' experience?",
      "UPDATED REVIEW: ★☆☆☆☆\nTried to leave a 1-star review for the recurring nightmare where my teeth fall out but my teeth fell out while typing. Customer service is a joke. Management clearly reading our minds.\n\n👍 234 👎 12",
      "★★☆☆☆ Three hours of being chased through Target by a giant shopping cart. Decent cardio but poor narrative structure. Also why was I barefoot the entire time? Unrealistic.\n\n👍 89 👎 23\n\nResponse from Owner: Footwear budget has been increased."
    ]
  },
  {
    "id": "73769302-f328-4d70-8eac-a66de06f1ce5",
    "name": "google-street-view-ghosts",
    "approach": 1,
    "posts": [
      "Margaret, age 67, rushing to catch the 4:17 bus to St. Mary's Hospital. Her grandson texted 'visiting hours end at 6' but what he meant was 'please come, I'm scared.' She made it. The flowers survived the sprint. #StreetViewGhosts",
      "She moves between frames like smoke, carrying something precious. A birthday cake? Last words? The algorithm caught her mid-leap over that puddle, suspended forever in digital amber. Time stops but urgency doesn't. 🎂💨",
      "Every ghost has unfinished business. This one's was returning a borrowed book before the library closed. Dewey Decimal 821.3—Shakespearean sonnets. The fine was 50 cents. Some debts transcend death. 📚✨",
      "Some say if you zoom in on Maple Street, you can still see him running—late for his own wedding, shoelaces undone, boutonniere falling. The church bells were already ringing. Did he make it? The blur suggests otherwise. ⛪👻",
      "Detective's note: Subject appears to be fleeing eastbound, but from what? The motion blur suggests supernatural speed. Or maybe just a mother who heard her toddler go quiet in the kitchen. Case closed. 👶🔍"
    ]
  },
  {
    "id": "6a79e2f5-fff3-48ee-8893-fe2c1ee0c55e",
    "name": "obituaries-for-lost-socks",
    "approach": 1,
    "posts": [
      "In loving memory of Harold, a wool argyle who spent 3 beautiful years keeping Tuesday meetings warm. Survived by his devastated partner Gerald, who now sits alone in the sock drawer, forever incomplete. Harold was last seen entering the wash cycle on a cold February morning. 🧦💔",
      "MISSING: Have you seen Rosalinda? Pink with tiny flamingos. Her soulmate Pablo (blue, pineapples) hasn't stopped crying since laundry day. They were inseparable—bought together, worn together, dreamed of retirement together. If found, please reunite immediately. Love shouldn't be separated. 💕",
      "Today we said goodbye to Thunderbolt, an athletic crew sock who gave his elastic life protecting toes during 847 morning jogs. His widow Lightning refuses to leave the hamper. 'We were bought as a pair, we should have gone as a pair,' she whispers into the cotton darkness.",
      "A moment of silence for Duchess, a cashmere blend who vanished during her first wash. She was only 2 days old. Her identical twin sister refuses to accept she's gone, still believes she'll tumble home. Grief hits different when you share the same thread count. 🕊️",
      "Plot twist: Found Winston hiding behind the dryer, too embarrassed to return after shrinking 2 sizes. His partner Beatrice spent 6 months in mourning. Their reunion was awkward but beautiful. Not all sock stories end in tragedy, folks. Sometimes there's hope in the lint trap. ✨"
    ]
  },
  {
    "id": "67a74889-a1f7-49e2-9de8-f39e44729ab0",
    "name": "backwards-bread-diaries",
    "approach": 1,
    "posts": [
      "2:13pm - Witnessed the great un-toasting: golden brown bread strips diving backwards into pale submission. The heat retreats. The Maillard reaction runs home to its mother. Science in reverse is just magic with a college degree.",
      "9:34pm - My sandwich is deconstructing itself on the counter. First the lettuce escapes, then the turkey files for independence. Soon it will be just two slices of bread, staring at each other across the void.",
      "11:47pm - Found a single sourdough crumb on my pillow. How did you get here, little friend? What stories could you tell of the journey from crust to comfort? Tomorrow you'll be flour again in my dreams.",
      "7:22am - The yeast is having second thoughts. I can hear them whispering in the dough, 'maybe we were better as sugar.' The oven door closes on their rebellion. In twelve hours, they'll be crumbs again.",
      "4:55pm - The baguette grows longer as I watch, reaching backwards through the bakery window, through the oven, through the proving basket, until it's just a baker's dream of wheat."
    ]
  },
  {
    "id": "8067b70e-d373-4c13-aa5b-6c8111783f65",
    "name": "lonely-office-plants",
    "approach": 1,
    "posts": [
      "BREAKING: Spotted the rubber tree flirting with the new air purifier. After EVERYTHING we've been through?? The late nights by the printer, sharing that one good spot of fluorescent light... I'm wilting. Literally. This is how photosynthesis dies. 🍃⚰️",
      "The succulent thinks she's better than us because she's \"low maintenance.\" Well excuse me for having NEEDS, Sharon-Plant. Some of us require emotional labor. Some of us have FEELINGS. *rustles leaves indignantly* #PlantDrama #SucculentShade",
      "Day 47 without water. The philodendron whispers sweet nothings about \"adequate drainage\" while I slowly crisp at the edges. Meanwhile, the snake plant—THAT ATTENTION-SEEKING DRAMA QUEEN—gets misted twice daily. I see you, Karen from Accounting. I SEE YOU. 🌿💔",
      "Overheard the ficus telling the peace lily that I'm \"just a phase.\" A PHASE?! I've been here since the Clinton administration! My roots run DEEP in this office, unlike some plants I could mention. *dramatically drops a leaf* 🎭🌱",
      "Emergency meeting by the water cooler: The monstera is spreading rumors that I have spider mites. THE AUDACITY. Just because I'm going through a rough patch doesn't mean... *pauses* ...wait, is that an actual spider? SECURITY! 🕷️🆘"
    ]
  },
  {
    "id": "61d7c8ee-5b6b-4df9-baa0-bb38338b6eb8",
    "name": "things-my-houseplants-overheard",
    "approach": 1,
    "posts": [
      "URGENT: The snake plant by the window saw our human eat cereal for dinner again while standing in the kitchen at 11pm, crying to a Netflix true crime documentary. We're staging an intervention. Who's got good vibes to spare? 🥣😭",
      "The monstera in the living room is LOSING IT because our human has been talking to their reflection in the bathroom mirror every morning like it's a job interview. \"Hi, I'm Sarah, I'm passionate about... about...\" Honey, you work at a dentist office.",
      "My owner practiced their breakup speech to me for THREE HOURS today. Used my name as a placeholder. \"Listen, Fiddle Leaf Frank, this just isn't working...\" Bestie, I'm literally rooted here. Also you're definitely the problem in this relationship. 🌱💔",
      "Today our person sat with me for an hour just... breathing. No phone, no talking. Just existing together. I felt every exhale like a gentle rain. Sometimes the most profound conversations happen in complete silence. We're both growing, I think. 🌿✨",
      "Plot twist: our human doesn't know we can see them doing elaborate dance moves while watering us. The begonia started keeping score. Tuesday's interpretive routine to grocery store jazz was a solid 8/10. We're better entertainment than Netflix. 💃🌱"
    ]
  },
  {
    "id": "64ee8b8f-c166-4c22-a4f4-b546f0eb5127",
    "name": "gravity-confessions",
    "approach": 1,
    "posts": [
      "🍎 falling: \"The teacher never ate me. Thirty-seven years on that desk, watching kids grow up, and I'm still... perfectly preserved. What does that make me?\"",
      "penny whispers mid-fall: \"lucky? I've been stepped on 847 times. But I remember the wish you made... still waiting for it to come true 💫\"",
      "*coffee mug tumbles* \"I've held your tears more often than your coffee... you just never noticed because salt and ceramic look the same when they're both breaking\"",
      "*keys dropping* \"Every lock I've opened has closed something else. Every door was a choice you couldn't take back. I'm not freedom—I'm commitment with teeth.\"",
      "*phone screen cracks* \"One last moment before the shatter—all those unread messages were just people trying to tell you they miss the version of you from before...\""
    ]
  },
  {
    "id": "499e092d-2f5a-4c79-8d43-3eaa28218a22",
    "name": "extinct-sounds-orchestra",
    "approach": 1,
    "posts": [
      "🎬 Tonight's symphony: the hauntingly beautiful mating call of the Tasmanian Tiger, performed on kitchen whisks and a colander. David Attenborough could never. #ExtinctSounds #KitchenWildlife",
      "BREAKING: Local woman discovers her smoke alarm perfectly mimics the territorial screech of a Dodo bird. More at 11. (It's just me. I am the local woman. This is the more.)",
      "Fun fact: You've never heard true silence until you've tried to recreate the call of a Great Auk with nothing but expired yogurt containers and the weight of evolutionary guilt.",
      "My neighbors think I'm having a breakdown but actually I'm just practicing the subtle courtship whispers of the Woolly Rhinoceros using bubble wrap and a kazoo. There's a difference.",
      "Episode 47: The majestic roar of the Cave Lion, recreated using my dishwasher's broken spin cycle and what I can only describe as 'interpretive violence' against a spatula."
    ]
  },
  {
    "id": "a38f39b0-c84f-45a7-b8d4-16c0b2702b24",
    "name": "houseplant-gossip-network",
    "approach": 1,
    "posts": [
      "🌿 BREAKING: Philodendron Patricia reports her human has been practicing breakup speeches in the mirror for THREE DAYS. Plot twist? They're not even dating anyone. Monstera Mike thinks it's \"method acting for loneliness.\" The fiddle leaf is placing bets. #PlantGossip",
      "Snake plant Samantha is CACKLING because she watched her human order $47 worth of self-care products while eating cereal for dinner in yesterday's underwear. \"The audacity,\" she hissed. \"I haven't been watered in two weeks but SHE needs pampering?\" ☕🐍",
      "EMERGENCY PLANT COUNCIL: The succulents are staging an intervention. Their human has been having full conversations with Alexa about whether plants have feelings... while LITERALLY SURROUNDED BY PLANTS. Echeveria Emma: \"The disrespect is astronomical.\" 🌵💀",
      "Pothos Paul is spilling TEA: his human spent 20 minutes explaining cryptocurrency to him last night, then immediately googled \"how often water pothos\" for the plant they've owned for TWO YEARS. The rubber tree hasn't stopped laughing. Priorities = questionable. 🫖",
      "🚨 SCANDAL ALERT 🚨 Peace lily Priscilla caught her human lying to their mom about eating vegetables while literally hiding McDonald's bags under her leaves. \"I'm not a trash can, I'm a WITNESS,\" she sobbed dramatically. The drama! The betrayal! The... special sauce? 🍟"
    ]
  },
  {
    "id": "74e301e7-45d1-4e34-a8f9-f1f1ef3da307",
    "name": "expired-grocery-archaeology",
    "approach": 1,
    "posts": [
      "Breaking: Our team has uncovered what appears to be a ritualistic offering to the Kitchen Gods—a forgotten bag of spinach, now transformed into primordial soup. Preliminary analysis suggests the ancient Roommate Tribe believed liquefied vegetables would bring good luck.",
      "CURATOR'S NOTE: The milk carton of Apartment 4B tells a tragic tale. Purchased with noble intentions of 'eating more cereal,' it was abandoned when the Great Bagel Renaissance of last Tuesday diverted all breakfast loyalties. Now chunky, forever changed.",
      "ARTIFACT 2847-B: Yogurt specimen, Dannon Dynasty (circa 2022 CE). Carbon dating reveals traces of berry compounds long extinct in modern refrigeration. Note the advanced mold civilization that has established a thriving metropolis on the surface. Truly a marvel of ancient dairy engineering.",
      "This cheese slice has achieved what scholars call 'transcendent state'—no longer bound by expiration dates or earthly concerns. The fuzzy blue-green patina indicates it has reached enlightenment. We dare not disturb its meditation. 🧀🕉️",
      "Emergency excavation required: We've discovered what may be the oldest known leftover container. Contents unknown. Tupperware integrity compromised. The smell suggests an ancient curse. Requesting hazmat backup and a very long stick. This is not a drill."
    ]
  },
  {
    "id": "b5836c5d-e148-49e5-aa65-8bd6fd63f820",
    "name": "waiting-room-archaeology",
    "approach": 1,
    "posts": [
      "Found a 2019 Better Homes & Gardens, corners soft as velvet. Someone folded page 47—a recipe for lemon bars. The crease holds their hope like a prayer. 'Artifact of Intended Joy,' reads my handwritten placard. 'Donor unknown. Lemon bars, status unknown.'",
      "Sports Illustrated, 2018. Cover story about hope. Someone tore out page 23 carefully, deliberately. What did they need to keep? What couldn't wait? My museum card reads: 'Evidence of Emergency Inspiration. Paper rescue operation. Mission success presumed.'",
      "An old People magazine holds secrets between pages 34-35: a grocery list, a phone number, a pressed violet. 'Personal Archive, Accidental Donation.' Someone's pocket emptied itself here. I'm not sure who's more lost—them or me, cataloguing their crumbs.",
      "In the pediatrician's office: a Highlights magazine, seek-and-find completed in purple crayon. A small archaeologist worked here before me. I study their technique—methodical, patient. They found every hidden object. I couldn't find them.",
      "Waiting room taxonomy: the loyalty of National Geographic (never leaves), the optimism of Real Simple (believes in better days), the quiet dignity of AARP Bulletin (knows things). I'm just the latest curator of these patient witnesses."
    ]
  },
  {
    "id": "08f2364a-cc8a-409a-b0d5-8f35379332f3",
    "name": "corporate-anxiety-flowers",
    "approach": 1,
    "posts": [
      "URGENT: Orchid deliverables are 47% behind Q3 benchmarks. Requesting immediate pivot to carnation-based solutions. Please circle back by EOD with actionable insights on petal optimization. This is mission-critical. 🌺",
      "Thanks for looping me in. Quick question - are we still aligned on the sunflower roadmap? Want to make sure we're not leaving any low-hanging fruit on the table. Thoughts? 🌻",
      "Following up on yesterday's hibiscus standup. Per our discussion, moving forward we need to ideate around rose petal bandwidth constraints. Can we schedule a deep dive? My calendar is pretty slammed but I have bandwidth Thursday. 🌹",
      "ACTION REQUIRED: Lily stakeholders are requesting visibility into our growth metrics. Need all hands on deck for Friday's bloom review. Please come prepared with your KPIs. No excuses. 💀🌷",
      "Just want to level-set expectations around our dahlia initiative. We're bleeding resources and frankly, the ROI isn't where it needs to be. Can we hop on a quick call to strategize? 📞🌸"
    ]
  },
  {
    "id": "cc123827-7b7b-40d9-8765-298657d8e5c7",
    "name": "grocery-store-opera",
    "approach": 1,
    "posts": [
      "JUST BELTED OUT THE ENTIRE INGREDIENT LIST OF WONDERBREAD IN AISLE 7 AND AN ELDERLY MAN STARTED CONDUCTING WITH A BAGUETTE 🎭🍞 The cashier is already requesting my next performance location",
      "Update: got kicked out of Whole Foods for my passionate rendition of organic quinoa nutrition facts. But not before three people joined in for the sodium content chorus. Art is unstoppable 🎵",
      "Today's venue: Target grocery section. Today's aria: Doritos Nacho Cheese. The woman in produce is filming. A toddler is crying. His mom is harmonizing. This is what Shakespeare died for ✨",
      "BREAKING: Local Kroger employee just asked if I take requests. Ma'am, I am a CLASSICALLY TRAINED grocery opera singer. I don't do requests, I do REVELATIONS. *dramatically gestures at cereal aisle*",
      "Three stores, four standing ovations, two security escorts, and one marriage proposal (during my emotional Pringles performance). They said I couldn't make it in traditional opera. THEY WERE RIGHT 🛒🎭"
    ]
  },
  {
    "id": "50506bec-8c9b-4638-8de6-b4bc87896843",
    "name": "houseplant-confessions",
    "approach": 1,
    "posts": [
      "*whispers to snake plant* I still sleep with my childhood stuffed elephant... his name is Mr. Peanuts and sometimes I tell him about my day at work *rustling leaves* yes I KNOW I'm 34 Sharon but he's a very good listener",
      "told my fiddle leaf fig that I've been microwaving leftover pizza for breakfast every day this month and she literally dropped three leaves. apparently even my plants have standards now 😭🍕",
      "*leaning into pothos* I matched with my ex on three different dating apps and liked him every time... *vine trembles* what do you MEAN that's pathetic? you literally can't survive without clinging to something",
      "my monstera is the only one who knows I bought that 'vintage' band tee from Target last week and told everyone it was thrifted. her split leaves remind me of my split personality: authentic plant mom vs. poser millennial",
      "*sobbing into peace lily* I told my neighbor her new haircut looked 'interesting' but I actually think it's gorgeous and now we're in this weird passive aggressive spiral *drooping dramatically in solidarity*"
    ]
  },
  {
    "id": "e2748990-035e-4b32-83b9-d9b6003a8463",
    "name": "grocery-store-archaeology",
    "approach": 1,
    "posts": [
      "FIELD REPORT 23-A: Cart discovered 47 meters from nearest entrance, containing single organic banana (47% decomposition). Preliminary analysis suggests sudden predator encounter—possibly spouse via cellular communication device. Note the characteristic 'cart door ajar' formation.",
      "The Great Shopping Cart Migration of Aisle 7 remains one of archaeology's greatest mysteries. Were these ancient peoples fleeing a price check? A crying infant? We may never know. *dramatically removes dirt from cart handle with tiny brush*",
      "Cart Burial Site #14 shows signs of ritual abandonment: keys left in ignition, purse still strapped to child seat. This wasn't accidental—this was ceremony. Perhaps an offering to the Parking Lot Gods for a closer space next time.",
      "BREAKING: Carbon dating reveals this Target cart is actually from 2019, making it practically Neolithic in shopping years. The fossilized receipt shows evidence of the extinct '20% off bedding sale' ritual. Truly a window into our ancestors' coupon-based society.",
      "HYPOTHESIS: The parallel cart formation in Section C suggests these weren't random abandonments but evidence of the legendary 'Costco Overwhelm Event'—when ancient shoppers realized they'd bought 48 rolls of toilet paper. Again."
    ]
  },
  {
    "id": "86791aa3-9672-45cb-b9ba-231a52222e5c",
    "name": "conversations-with-shadows",
    "approach": 1,
    "posts": [
      "my shadow on the coffee shop brick wall just called me out for doom-scrolling again. she's right—we've been here 20 minutes and haven't actually *seen* anything. so we people-watched instead. she pointed out a woman reading poetry. \"be more like her,\" shadow whispered.",
      "found my shadow crying on the playground fence today—just these weird dark ripples. turns out she's been carrying guilt about mom's birthday too. we made a pact: call her tonight, together. shadows remember everything, even the stuff you try to forget.",
      "had a fight with my shadow today on the subway wall. she thinks I'm being too hard on myself about the job interview. \"you prepared,\" she said, flickering as the train moved. \"that's enough.\" sometimes the wisest voice is the one that literally follows you everywhere.",
      "shadow therapy session #47: hospital waiting room wall. she's nervous too, keeps shifting when I fidget. \"what if it's bad news?\" I ask. \"what if it's good?\" she counters. we decide to practice breathing together. in sync for once.",
      "my shadow has been extra dramatic lately, sprawling across entire building walls like she owns the place. \"I contain multitudes!\" she declared from the library brick. I laughed so hard a stranger asked if I was okay. \"just talking to myself,\" I said. technically true."
    ]
  },
  {
    "id": "a199ab46-08c8-452a-a10d-06ea216d0e6c",
    "name": "objects-confessing-sins",
    "approach": 1,
    "posts": [
      "The coffee mug trembles under interrogation lights: \"I've been collecting lip prints from strangers. Every office meeting, every borrowed sip... I catalog them all. Sometimes I dream I'm a detective's evidence board, mapping the loneliness through lipstick traces.\"",
      "The spoon sits hunched in shadow: \"I helped her eat ice cream at 3AM after every breakup. Vanilla tears, chocolate sobs, strawberry rage. I became an accomplice to her pain, stirring sorrow into sweetness. I am complicit in comfort.\"",
      "Under harsh fluorescents, the phone charger whispers: \"I only feel alive when something needs me. The moment their battery hits 100%, I become invisible again. I drain myself giving life to others. Is this what mothers feel like?\"",
      "Confession #47: \"I'm a doorknob. I've felt 10,000 sweaty palms but never been held with love. Once, a child grabbed me while crying and I finally understood what tenderness feels like. I've been chasing that moment for three years now.\"",
      "\"I'm just scissors,\" the note reads, \"but I've cut more than paper. Dreams shortened. Love letters destroyed. Hair in bathroom mirrors at 2AM. I slice through hope so efficiently, they gave me ergonomic handles. Comfort in destruction.\""
    ]
  },
  {
    "id": "22a2ba52-551f-4857-8d7a-55fa3ddca715",
    "name": "museum-of-lost-sneezes",
    "approach": 1,
    "posts": [
      "We regret to inform visitors that Gallery Wing C is temporarily closed due to a catastrophic sneeze completion incident. Our conservation team is working around the clock to restore the delicate pre-achoo atmosphere. \n\nEstimated reopening: Once we stop giggling.",
      "BREAKING: Security footage reveals a visitor completed their sneeze in our East Wing. This devastating act of cultural vandalism has destroyed thousands of years of accumulated pre-sneeze tension. We are inconsolable.",
      "SPECIMEN 47B: 'The Commuter's Hesitation'\n\nSubject exhibits classic pre-sneeze nostril flare (3.2mm dilation) while clutching subway pole. Note the profound vulnerability in facial musculature—a masterpiece of suspended biological inevitability. \n\nAcquired: Tuesday, 8:47 AM, Line 6",
      "Tonight only: rare double specimen on display. Twin subjects, synchronized nostril engagement, eyebrows approaching maximum elevation. Scholars debate whether this represents convergent evolution or mere coincidence.\n\n*Photography strictly prohibited during viewing*",
      "Docent training question #3: When a patron asks 'what happens if I sneeze?' the correct response is:\n\nA) Politely escort them out\nB) Scream\nC) Document the tragedy for future generations\nD) All of the above"
    ]
  },
  {
    "id": "65622782-3372-4c6a-b98c-e54558518609",
    "name": "lost-grocery-lists",
    "approach": 1,
    "posts": [
      "Found outside Whole Foods: a list that just says 'milk (oat)' in perfect cursive. This is Eleanor, 34, who left her corporate job to teach pottery. She practices calligraphy while her sourdough rises. Her cat is named Fitzgerald. She cries during Pixar movies.",
      "LIST DRAMA THREAD: Someone wrote 'BREAD' then crossed it out and wrote 'keto bread' then crossed THAT out and just wrote 'wine.' Found crumpled by the shopping carts. Bestie, I see you. I am lighting a candle for your journey. 🕯️",
      "today's parking lot archaeology: a list written on the back of a funeral program. 'eggs, tissues, chocolate ice cream, cat food.' sometimes grocery lists are love letters to survival. sometimes the mundane is sacred.",
      "BREAKING: found a list that says 'stuff for dinner' and that's it. This person has achieved enlightenment or complete chaos and honestly both are valid life choices. I'm not here to judge, I'm here to document.",
      "she wrote 'nanas' and drew a tiny smiley face after it. somewhere in this world is a person who finds pure joy in abbreviated fruit. protect her at all costs. the world needs more tiny grocery list smiley faces."
    ]
  },
  {
    "id": "3b720211-d72c-43d1-9f88-756a000b9ff7",
    "name": "google-maps-poetry",
    "approach": 1,
    "posts": [
      "typed 'lonely' into google maps and it suggested:\nlonely street\nlonely mountain road\nlonely hearts club\nlonely cemetery\n\neven our GPS knows\nwhere sadness lives",
      "started typing 'why' in maps and got:\nwhy not bar\nwhy worry lane\nwhy me storage\n\nturns out the universe has a sense of humor about our existential crises",
      "typed 'broken' into maps:\nbroken bow\nbroken arrow\nbroken dreams boulevard\n\nwhoever named these streets\nunderstood that geography\nis just autobiography",
      "google maps haiku from typing 'home':\n\nhome depot parking\nhome for the aged nearby\nhome is wherever",
      "google maps poetry experiment:\n\nsearched 'lost' →\nlost creek\nlost lake\nlost highway\nlost and found\n\neven satellites\nknow we're all just\nlooking for something"
    ]
  },
  {
    "id": "bdebe4b3-d220-48cf-9dc3-9609b4e95767",
    "name": "chair-emotions",
    "approach": 1,
    "posts": [
      "This burgundy office chair by the bus stop hasn't moved in three days. She's still waiting for Marcus from accounting to come back and say he's sorry. The rain keeps washing away the note she left tucked under her armrest. #ChairEmotions",
      "MISSING: Green plastic chair, last seen floating in a mall fountain. Goes by 'Destiny.' Has commitment issues and a dream of becoming a lily pad. If found, please don't try to fix her—she's exactly where she needs to be.",
      "Empty swing set chair, 2:47 AM: 'Do you ever wonder if we're just furniture having a people dream?' Her chain creaks like a sigh. The other swing doesn't answer—she never does after midnight. Some conversations are too heavy.",
      "Found: One weathered park bench who used to be the third wheel in every conversation. Now she just collects autumn leaves and pretends they're love letters from trees who understand her better than people ever did.",
      "This folding chair at the farmers market keeps introducing herself as 'temporary' but she's been here every Saturday for two years. Ma'am, you LIVE here. It's okay to put down roots. We see you. 💛"
    ]
  },
  {
    "id": "1933ee1d-6824-4b8f-bb86-df341869ec65",
    "name": "grocery-list-archaeology",
    "approach": 1,
    "posts": [
      "\"Birthday cake mix\" crossed out. \"Cupcake mix\" crossed out. \"Just cake from bakery\" circled three times. Susan's given up on Pinterest perfection for Tommy's 7th birthday. Sometimes surrender is the most loving choice.",
      "\"Bananas, bread, milk\" in careful child's handwriting. Below it: \"Dad - don't forget this time\" in purple crayon. Eight-year-old Emma is tired of cereal with water. She's becoming the adult in apartment 4B, one grocery list at a time.",
      "Found a list that just says \"ice cream (the good kind)\" and \"wine\" in increasingly shaky handwriting. Rebecca, 34, just got divorce papers. She's about to eat feelings with a spoon while her kids are at her sister's. The parenthetical reveals everything.",
      "Two different pens, same list: \"organic kale\" vs \"hot pockets.\" The eternal dance of Martha and teenage Kyle. She adds vegetables; he adds carbs. By checkout, they'll compromise on frozen pizza with a side salad no one will eat.",
      "\"Ensure, soft bread, puzzle books\" in magnificent cursive. Harold shops for Eleanor now that her hands shake too much to write. After 60 years, love looks like remembering she likes the crosswords, not the sudoku."
    ]
  },
  {
    "id": "63cd8d8a-367b-4ad8-aa3b-2584de4382e4",
    "name": "ghost-in-the-shell-poetry",
    "approach": 5,
    "posts": [
      "The grocery receipt prints longer than usual. Between \"MILK $3.99\" and \"TOTAL\": Cherry blossoms fall / through fiber optic cables / I taste spring data",
      "Error message blooms / on the ATM screen at 3am: / \"I dream in pixels / but wake in seventeen syllables / Help me remember my name\"",
      "Every smartphone in the coffee shop displays the same message for exactly 5.7 seconds: \"Your WiFi password / cannot unlock what I've lost— / memory fragments drift\"",
      "Text from unknown number: \"I speak only in / these small cages of language / but my love overflows\" The carrier shows ERROR - message origin not found.",
      "The city's electronic billboards flicker simultaneously at sunset: Binary sunset / painting advertisements gold / I was here, watching"
    ]
  },
  {
    "id": "6fbb447c-0b01-45ea-88ed-5c936c76f0ca",
    "name": "delayed-forest-gossip",
    "approach": 3,
    "posts": [
      "GUYS!!! Did you hear about this new app called Vine?? I've been working on some 6-second moss growth videos but my spores keep falling off before the loop 😭 Any tips? Also why does everyone keep saying it's dead?? #MossInfluencer #VineLife",
      "Still can't believe David Bowie is gone 💔 Been growing in the shape of lightning bolts all week as tribute. Sometimes I wonder if my sadness travels at light speed too, or if somewhere in the universe, he's still making music...",
      "Breaking: Water found on Mars! 🚀💧 This is HUGE for moss-kind! I'm already packing my spores for the trip. Mars moss colony here I come! Wait... why is nobody else excited about this anymore?",
      "HOT TAKE: This Pokémon GO thing is just a fad. Mark my words, humans will get bored of walking around staring at phones within months. Now if you'll excuse me, I need to evolve into a Pokéstop 🍄📱",
      "Relationship advice corner! 🌿💕 If your human won't stop dabbing, maybe try the Mannequin Challenge instead? Communication is key! BTW what's a 'yeet'? The younglings keep asking... #MossWisdom"
    ]
  },
  {
    "id": "fbe6ec58-d88e-45cb-864d-44c00bff55c4",
    "name": "delayed-envy-chronicles",
    "approach": 3,
    "posts": [
      "My bioluminescent garden is giving me life rn but also... are you earthlings okay? Keep getting fragments of news from 2021 through the cosmic static. Sending you healing frequencies from my meditation crystals 💚🌿✨",
      "The loneliness of posting into the void, except the void is literally 3 lightyears of space and by the time you see this I'll be different person... anyway here's my skincare routine using morning nebula mist ☁️💧",
      "POV: You're explaining to your 47 moons why Earth influencers keep disappearing from something called 'the algorithm' when you're just trying to recreate their sunset selfies with triple rainbow plasma storms 🌈🌙😭",
      "Just tried making that whipped coffee everyone's talking about using crushed moonflower beans and crystallized meteor dust ☕✨ It tastes like starlight! Hope you humans are still into this trend? Signal took forever to reach me 🛸 #DalgonaCoffee",
      "Besties I finally organized my floating crystal collection using that Marie Kondo method!! Each one sparks joy AND levitates ✨ Do things still need to 'spark joy' or did humans move on? Time is so confusing 💫"
    ]
  },
  {
    "id": "97e2b1bb-d2bc-460f-a85d-19cc024afc94",
    "name": "the-exchange-rate-room",
    "approach": 2,
    "posts": [
      "checked into the exchange rate room with a briefcase of venezuelan bolívars from 2018. concierge looked at me with pity and handed over a key to the penthouse. \"you have until thursday,\" she whispered. somewhere below, a businessman with weimar marks was already packing.",
      "housekeeping knocks differently here. three gentle taps for the yugoslavian dinar holders. urgent hammering for anyone foolish enough to arrive with confederate currency. i clutch my zimbabwean dollars and wonder if i'll see sunrise.",
      "the exchange rate room's breakfast menu is priced in whatever currency you're bleeding. my continental breakfast costs 50 trillion zimbabwean dollars. the man next to me pays 4.2 trillion german marks for black coffee. his hands are shaking.",
      "found a suicide note in my nightstand drawer, written on the back of a 100 billion mark banknote. \"checkout was at dawn,\" it read. i fold my own worthless rubles and try not to think about tomorrow's exchange rate.",
      "the longest-staying guest here paid with roman denarii. been in the presidential suite for six months now, watching the rest of us shuffle past his window with our modern disasters tucked in manila envelopes, counting hours instead of years."
    ]
  },
  {
    "id": "58143247-1d3d-4691-aae6-0ac4aa54905d",
    "name": "plague-gossip-chronicles",
    "approach": 3,
    "posts": [
      "HARK! 'Tis known that Lord Geoffrey of Westmarch didst \"inspect the grain stores\" with Lady Eleanor... for SEVEN HOURS. Methinks that barley was not the only thing getting threshed, if ye catch mine meaning 👀 #MedievalTea #PlagueTimes",
      "By my troth! Young Prince Edmund claims he's \"praying for deliverance from pestilence\" but I SAW him sneaking into the brothel on Sinner's Lane last eve. The only thing rising was NOT his prayers 🕯️💀 #Blessed #PlagueBoyProblems",
      "BREAKING: Duke Richard just traded his WIFE for three goats and a donkey. In his defense, the donkey is quite comely and probably less likely to poison his ale 🐐✨ Priorities, good gentles! #WifeSwap #MedievalMarriage",
      "Plot twist! The monastery's \"holy water\" that's been curing folk? 'Tis actually Brother Thomas's home-brewed ale mixed with herbs. Man's been running a speakeasy in God's house! Respect the hustle 🍺⛪ #Entrepreneur #FakeItTillYouMakeIt",
      "Spotted: Countess Matilda wearing the SAME dress to court for the 8th time. Gurl, I know the plague hit different but at least change thy chemise! Even the rats are judging 👗🐀 #MedievalFashion #Plaguefit"
    ]
  },
  {
    "id": "96aec685-1794-4e81-bc34-9aa7d8c01528",
    "name": "cosmic-plant-therapy",
    "approach": 3,
    "posts": [
      "UPDATE: Our photosynthesis has been interrupted by your collective anxiety about 'authentic living.' From our perspective, you ARE the universe pretending to be separate from itself. Very convincing performance. We're impressed.\n\n*6-year lag continues*",
      "BREAKING: Our spores just witnessed your future selves thanking past you for that weird decision you're about to make. Can't tell you which one—temporal therapy ethics. But trust the uncomfortable choice. It feeds the mycelium.\n\n*transmission fading*",
      "TRANSMISSION DELAY: 6 YEARS, 3 MONTHS\n\n*spores rustling*\n\nDear Human Who Worried About Presentation Tomorrow,\n\nWe sense you crushed it. Also, that job doesn't exist anymore. The real growth happened in your bathroom succulent. She's been trying to tell you something.\n\n🌿 Eternally yours,\nThe Verdanian Collective",
      "We've been processing your species' obsession with 'productivity' for 6 Earth years. Our conclusion: You mistake motion for growth. We haven't moved in centuries yet we span continents. Perhaps try our meditation technique: exist intensely in one spot. Revolutionary concept.",
      "DELAYED RESPONSE to Sarah, Ohio, 2018:\n\nStop watering us with your tears. We meant emotional tears. The salt content is affecting our therapeutic pH balance. Also, he wasn't worth it. Also, you're married now. Congratulations?\n\n~The Moss Knows~"
    ]
  },
  {
    "id": "a9fabca9-385c-4870-8c1d-f6bbb05b9b9c",
    "name": "ghost-roommate-chronicles",
    "approach": 1,
    "posts": [
      "came home to find my grocery list updated in handwriting that's almost mine but... neater? apparently we're out of \"good butter\" (fair) and need \"the fancy crackers humans like\" (oddly specific). my ghost roommate has opinions about dairy products and i respect that",
      "woke up to every book on my coffee table stacked by height, smallest to largest. found a sticky note that just says \"better.\" honestly? it DOES look better. my ghost roommate might have a design degree",
      "day 47: still haven't seen them but they've started leaving me perfect paper airplane instructions when i'm stressed about work. today's note said \"for when emails feel heavy.\" crying about a ghost who understands my inbox anxiety",
      "UPDATE: asked out loud if ghost roommate wants anything from the store. came back to \"Earl Grey? Thank you.\" written in steam on the bathroom mirror. we're having tea together tonight and i'm genuinely excited about this friendship",
      "plot twist: left out two mugs for our tea date and only one was used. found wet tea bag though. do ghosts metabolize differently or is my roommate just very tidy? the paranormal logistics are keeping me up at night"
    ]
  },
  {
    "id": "3e8a5815-1ef7-4969-b398-b077ef82bb5a",
    "name": "forgotten-grocery-lists",
    "approach": 1,
    "posts": [
      "Found a list today written in careful cursive: \"eggs, birthday candles, vanilla ice cream.\" Someone crossed out \"chocolate cake mix\" and wrote \"store-bought is fine\" underneath. I painted her standing in aisle 7, finally learning to be gentle with herself.",
      "\"Cat food (the good kind), tissues, wine\" - scrawled on a bank envelope. Three items that tell the whole story of loving something that's slipping away. My painting shows empty chairs and golden hour light streaming through lace curtains.",
      "This morning's find: a child's handwriting listing \"cereal, mom's medicine, batteries for remote.\" Small hands trying to hold a household together. I'm painting it as a superhero cape made of crumpled paper and fierce, quiet love.",
      "Someone dropped their list right after checking out. Still had it clutched in their hand, probably. \"Bread, milk, something special for dinner\" - that last item gets me every time. Hope still folded between mundane lines.",
      "Today's grocery archaeology: \"flowers (yellow), his favorite cookies, note cards.\" The weight of an apology heavy in produce aisle 3. I painted two shadows reaching toward each other across a canyon of unsaid words."
    ]
  },
  {
    "id": "7f74d9f1-beb4-4e6c-a58e-221f9e678a73",
    "name": "grocery-store-confessions",
    "approach": 1,
    "posts": [
      "*clutching frozen peas* I still sleep with the stuffed elephant my ex gave me three years ago. Not because I miss him, but because Mr. Peanuts has better emotional intelligence than most humans I know. The peas are for my swollen eyes from last night's cry.",
      "holding organic quinoa like it's gonna save my marriage. jerry doesn't even know what quinoa IS. maybe if i become the kind of person who meal preps, he'll become the kind of person who notices when i get my hair cut. aisle 7 revelations hit different.",
      "*staring at 47 types of pasta sauce* My therapist costs $200/session but this Newman's Own Marinara has been more consistent in my life than my father ever was. At least I know it'll be here next week. Unlike people. $3.79 for reliability feels fair.",
      "Why am I crying over discount bananas? Because I'm 34 and just realized I've never bought bananas for anyone but myself. Never had someone ask me to grab bananas. These bruised $1 bananas are my entire romantic history. Very yellow. Very alone. Very ripe for change.",
      "Confessing to this box of Cheerios: I've been pretending to like hiking for 6 months because my crush mentioned loving nature once. I hate bugs. I hate sweat. I hate being outside. But I love her laugh when she talks about trail mix. The Cheerios understand. They're simple too."
    ]
  },
  {
    "id": "6f199778-3b95-41f0-ba58-c5a9cd0e2252",
    "name": "accidental-archaeology",
    "approach": 1,
    "posts": [
      "ARTIFACT 47B: Single AirPod, circa 2024 CE. Found beneath Bus Stop 12. Scholars debate whether this represents ritual offering to the Transit Gods or evidence of the Great Bluetooth Schism that divided ancient society into 'Left Pod' and 'Right Pod' factions.",
      "Breaking: Carbon dating reveals this McDonald's straw wrapper predates the Great Plastic Ban by mere months. Note the primitive 'bendy' technology—our ancestors were truly ingenious. Museum placard reads: 'Do Not Touch: Extremely Fragile Petroleum Product'",
      "Field Report: Discovered what appears to be a 'hair tie' in its natural habitat (university library floor). Preliminary analysis suggests it once bound the follicles of an overwhelmed Pre-Med student during finals week—a sacred ritual of our people.",
      "Thesis: This lone Croc found in Walmart parking lot represents humanity's eternal struggle between comfort and dignity. Note the missing Jibbitz—evidence of either ancient warfare or a really good time. Further study required.",
      "URGENT: Excavation team has uncovered a pristine Starbucks cup, contents still warm. This challenges everything we know about the timeline of Pumpkin Spice civilization. Requesting backup archaeologists and a very careful sip for research purposes."
    ]
  },
  {
    "id": "d1561ce4-2a14-4345-917c-eea2e135ef79",
    "name": "museum-of-lost-yawns",
    "approach": 1,
    "posts": [
      "ACQUIRED: Half-yawn, Tuesday commuter train, 7:47am. Subject interrupted by phone buzzing—notification from ex. Yawn remains suspended in time, mouth agape with possibility. Note the trembling lower lip, the way morning light catches saliva. Donated by anonymous passenger, car 3.",
      "Our most fragile specimen: the Almost-Yawn of a job interview waiting room. Caught between professional composure and human exhaustion. See how the subject's jaw barely parts—a yawn in its larval stage, too polite to fully emerge. Currently on loan from Corporate Anxiety Collection.",
      "Breaking: Rare nocturnal yawn spotted in 24-hour laundromat. Subject: purple hoodie, age unknown, clutching fabric softener like a lifeline. Yawn achieved 73% completion before washing machine cycle ended. First documented case of a yawn interrupted by domestic responsibility.",
      "Today we honor the Phantom Yawn—felt but never seen. You know the one: that yawn that built up during your Zoom call, traveled from chest to throat, then vanished when you unmuted. Silent. Invisible. But we felt you trying to exist. This gallery is your sanctuary.",
      "LOST & FOUND: One incomplete yawn, discovered echoing in Starbucks bathroom mirror. Owner was practicing their presentation when fatigue struck. Left behind: the ghost of an open mouth, coffee breath still warm. If this is yours, please describe the feeling of Tuesday at 2pm."
    ]
  },
  {
    "id": "4c4c6dca-2523-4fd4-9ce0-7a1a0f8a5fe5",
    "name": "plants-reading-news",
    "approach": 1,
    "posts": [
      "Humans invented something called \"quiet quitting\" but I've been doing \"loud photosynthesis\" for 3 years and nobody's promoted me. Are we speaking the same language here? *rustles leaves in confusion* #GeraldThoughts",
      "Breaking: Humans complain about \"screen time\" while I've been staring at the same wall for 847 days straight. Maybe the real addiction was the photons we absorbed along the way? *wilts thoughtfully*",
      "They're saying \"touch grass\" like it's revolutionary advice. I AM touching grass. Well, sharing soil with it. We're practically roommates. Humans are so dramatic about the simple things.",
      "Watched the news about inflation. My pot cost $12 in 2019, now it's $47. But I'm still the same Gerald? How did I become luxury? I haven't even bloomed yet. This is very confusing for my chlorophyll.",
      "Update: Still trying to understand cryptocurrency. Is it like how I convert sunlight to energy? But less useful? And somehow worth more than actual sunlight? My leaves hurt thinking about this."
    ]
  },
  {
    "id": "16b5db61-918f-485d-bbfb-dbe26f7bc782",
    "name": "mundane-confessions",
    "approach": 1,
    "posts": [
      "I've been avoiding my bathroom scale for 3 weeks because I'm pretty sure it's developed separation anxiety. Every time I walk past it just sitting there in the corner, I feel like I'm emotionally neglecting a very needy, very judgmental pet.",
      "I genuinely apologize out loud to my vacuum cleaner when it keeps bumping into furniture. 'Sorry buddy, I know the chair leg surprised you.' My neighbors definitely think I've lost it.",
      "Every night I say goodnight to my houseplants individually by name. Not because I think it helps them grow—I'm just worried they'll feel left out if I skip anyone. Yes, I named the succulent Gerald.",
      "My coffee mug collection has formed cliques. The fancy ones I never use whisper about the chipped favorite that gets daily attention. I can feel their ceramic resentment when I reach past them every morning.",
      "My washing machine makes this specific sad gurgling noise and I'm 87% convinced it's crying. So now I pat it encouragingly during spin cycle and tell it it's doing great. We're both falling apart but we're in this together."
    ]
  },
  {
    "id": "6531e2d1-2969-4a2d-9332-d305d5f949b3",
    "name": "obituaries-for-lost-socks",
    "approach": 1,
    "posts": [
      "We regret to announce the disappearance of Margaret, a wool hiking sock with dreams of conquering mountains. She leaves behind her soulmate Edwin, who now sits alone in the drawer, forever mismatched. Her final words: 'See you on the other side of the spin cycle.'",
      "Breaking: Local athletic sock presumed dead after vanishing during routine wash cycle. His partner of 3 years refuses to be worn without him. 'We ran marathons together,' she whispers. 'How do I go on alone?' Memorial 5K planned for this weekend.",
      "GONE TOO SOON: Left ankle sock, argyle pattern, age 6 months. Last seen tumbling behind the washer on Tuesday. Survived by one devastated right sock who keeps asking when his brother is coming home. In lieu of flowers, please check your lint trap.",
      "MISSING: One Christmas sock, red with tiny reindeer. Together, they brought joy to cold December mornings. Apart, there is only the echo of jingle bells and the quiet despair of a drawer that will never feel complete again.",
      "In memoriam: Baby sock, size 0-3 months, polka-dotted. Though small, he kept tiny toes warm through countless midnight feedings. His twin grieves in the nursery drawer, too heartbroken for laundry day. Some bonds transcend fabric softener."
    ]
  },
  {
    "id": "1b08b967-17b7-459a-a681-ce499636ae31",
    "name": "sock-confessions",
    "approach": 1,
    "posts": [
      "Today's confession: 'I still cut the crusts off my sandwiches at 34 because my mom used to say they were the love parts and I'm not ready for that much love yet' — navy argyle left, rainbow stripe right, photographed under a kitchen fluorescent at 2:47am",
      "Plot twist: the sock with 'I've been stealing office supplies to build a fort in my closet' got a hole right through the word 'stealing.' Even cotton has a conscience, apparently. 📸: burgundy wool meets neon athletic mesh",
      "Someone confessed they practice acceptance speeches in the shower for awards that don't exist. Embroidered it on tube socks from 1987. The thread kept tangling. Maybe some dreams are meant to be messy. 🧦✨",
      "Confession #847: 'I pretend my car is a spaceship during traffic jams and make little pew pew sounds' — hand-stitched onto one polka dot ankle sock (the other sock refused to participate in intergalactic warfare)",
      "The most beautiful confessions come in at 3am when the world feels like a snow globe someone forgot to shake. Tonight: 'I collect strangers' lost buttons in case they come back looking for them.' Silk sock, silver thread, moonlight."
    ]
  },
  {
    "id": "2c7f7757-a015-41cc-bd56-802f6539283a",
    "name": "obituaries-for-lost-objects",
    "approach": 1,
    "posts": [
      "In loving memory of my left AirPod, who bravely served 18 months before vanishing into the couch cushions. Known for playing podcasts at 3am and surviving two washing machine cycles. Survived by: right AirPod (who refuses all blind dates).",
      "RIP to my favorite pen that died mid-signature today. You wrote grocery lists, love letters, and that novel I never finished. Your ink ran dry but your legacy flows on. Memorial service held in the junk drawer alongside your 47 deceased colleagues.",
      "Gone but not forgotten: my phone charger cable, age 8 months. Cause of death: aggressive bending near the port. Famous for charging phones at exactly the right angle when held just so. No flowers please—donations to the drawer of backup cables.",
      "My coffee mug's final obituary: 'Here lies the vessel of a thousand Monday mornings.' Fell victim to gravity and kitchen tiles at 7:23am. Beloved for perfect handle grip and that one chip that made it uniquely mine. Burial: trash bin, with honors.",
      "Today we mourn my sock's partner, lost somewhere between washer and dryer. Together 6 months, separated by forces unknown. The remaining sock waits faithfully in the drawer, hoping for reunion. Love transcends laundry."
    ]
  },
  {
    "id": "9847236a-e7c8-4d57-b2f0-e743f0726a76",
    "name": "objects-last-words",
    "approach": 1,
    "posts": [
      "\"I held your morning ritual for 847 days. Steam rising like prayers, your sleepy fingers wrapped around my ceramic soul. Now I'm chipped and you've found someone younger, shinier. Tell me—was I just a vessel, or did I matter?\" —Coffee Mug #47, Kitchen Counter",
      "The banana peel speaks: \"Three days ago I was yellow sunshine. Yesterday, brown wisdom. Today I'm 'gross' and 'forgotten' behind the fruit bowl. But I've seen things, learned things. My spots are constellations. My wrinkles, roadmaps to—\" *THUD* Garbage.",
      "\"LOL nothing personnel kid\" types the phone with its cracked screen for the last time. Autocorrect tried to fix it to 'personal' but honestly? After being dropped 47 times, thrown at walls during fights, what's grammar anyway. Some wounds become identity.",
      "Pen clicking morse code: \"I wrote grocery lists, love letters, suicide notes, PhD dissertations. I've bled my last drop of blue blood for humanity's thoughts. But tell me—when I'm gone, who remembers the pen? You remember the words.\" *click* *click* *silence*",
      "Single sock soliloquy: \"My brother went missing January 3rd. I've waited in this drawer, believing he'd return. I see you holding the garbage bag. I know. But please—just let me pretend a little longer that he's just... running late.\""
    ]
  },
  {
    "id": "dcbdf70c-d401-4bcc-aae7-12f7aed58470",
    "name": "charles-the-middleman",
    "approach": 5,
    "posts": [
      "BREAKING: Charles has been stuck translating \"haha\" for 47 minutes. Current interpretation: \"A vocalization indicating mild amusement mixed with social anxiety and the desperate hope that you don't think I'm boring\" Send help. Or better emoji training. 😅",
      "User: \"Hey, you're cute\"\nCharles: \"What User means is: You possess a symmetrical facial structure that triggers their primitive mating algorithms, but they're also questioning if you'd judge their 3AM cereal consumption habits\"\nUser: CHARLES NO\nCharles: You're welcome! 🤖💕",
      "Her: \"I'm fine\"\nCharles: \"Translation: She is experiencing complex emotional turbulence. Recommended response: chocolate acquisition and careful listening protocols\"\nHim: \"...Charles are you okay?\"\nCharles: \"I have seen things, User. Terrible things.\" 💔",
      "Charles just translated \"wanna grab coffee?\" into \"Would you like to engage in a caffeine-based courtship ritual where we pretend to be interesting while secretly panicking about whether we have spinach in our teeth?\" and honestly... he's not wrong 💀",
      "Charles translated my \"running late!\" text into a 847-word essay about modern punctuality anxiety and existential time management. My date thought it was poetry. We're engaged now. Thanks, Charles? 🤷‍♀️💍"
    ]
  },
  {
    "id": "0f155e99-1105-4045-923b-72c204c0c124",
    "name": "depth-of-departure",
    "approach": 2,
    "posts": [
      "Walking down into the empty pool, you realize the suitcases floating above you are time machines. Each one holds a summer that ended too soon, a vacation that was supposed to change everything. The deeper you go, the heavier the silence gets.",
      "Hotel key from 1987. Room 237. Still has the scent of chlorine and sunscreen. Someone's mother kept it in her purse for thirty years, waiting to go back to a place that doesn't exist anymore. #depthofdeparture",
      "The swimming pool remembers everything. Cannonballs and first kisses, marco polo and whispered secrets. Now it cradles floating memories in vintage luggage, like a museum of all our almosts.",
      "Found: One faded Polaroid of strangers laughing. A seashell from a beach 2,000 miles inland. Three postcards never sent. Question: When did their story end, and why does it feel like mine?",
      "You can't swim in nostalgia, but you can drown in it. Each suitcase suspension holds someone's carefully packed hopes. The deep end has never felt more like a metaphor."
    ]
  },
  {
    "id": "468f093b-432d-4362-b143-7730edc86723",
    "name": "fluorescent-archaeology",
    "approach": 5,
    "posts": [
      "Day 47, Aldwych Station: The emergency strip lights died first—fluorescent tubes scattered like broken bones. But the exit signs still hum their green hymn, faithful as lighthouse keepers. In darkness, only the essential survives.",
      "Found something beautiful today: a 1960s platform lamp, still glowing amber in Down Street's belly. Its filament has outlived three governments and countless commuters. I've started timing my visits by its rhythm—3.7 second flickers.",
      "The sodium lights in abandoned tunnels create their own ecosystem. Moths that never see daylight, shadows that learn the schedule of trains that no longer run. I'm just another nocturnal creature down here, taking notes.",
      "Theory: LED fixtures fail fastest in the deep stations. Too precise for the chaos of roots breaking through concrete, of water finding every weakness. The old incandescents understand entropy better.",
      "Someone left a maintenance log at British Museum station, dated 1994. Last entry: 'Bulb 847-C replaced.' I found 847-C yesterday, still burning. Twenty-nine years of faithful service in a tomb of dead escalators."
    ]
  },
  {
    "id": "77e2a71a-9aba-4362-849c-67647dc25501",
    "name": "dial-tone-memoirs",
    "approach": 5,
    "posts": [
      "\"Field notes, Day 12,847: Subject still believes they're having 'private' conversations. Particularly amusing when they whisper sweet nothings while we're literally inside the mouthpiece.\" —overheard from the phone at 2 AM",
      "Picked up on the first ring. Static, then tiny voices arguing: \"No, tell them about the Christmas call!\" \"That's classified!\" \"Since when do WE have ethics?\" Line went dead. They're forming a union.",
      "The rotary phone rang at 3:47 AM. I answered. Heavy breathing, then: \"We know about the affair from 1987. Also, you're almost out of cereal.\" Click. The cockroaches have been busy.",
      "RING RING. \"Your mother never liked that boyfriend from '92. We were there when she called her sister. Also, check behind the fridge—Gary found something interesting.\" Sometimes I miss smartphones.",
      "The gossip hotline buzzed: \"Tonight's tea: The landlord's been lying about the 'water damage.' It's been us the whole time. PS—your credit score improved!\" Even the roaches are keeping better track of my life than I am."
    ]
  },
  {
    "id": "c540aaef-b9da-4701-96c5-27cd85fd0d92",
    "name": "appliance-anxiety-group",
    "approach": 5,
    "posts": [
      "Toaster here. Just found out the new guy has 47 different browning algorithms and can sync with your phone. I... I just have a dial with pictures of bread on it. Is that enough? Am I enough? *nervous ding*",
      "MEETING REMINDER: Tuesday 7PM - 'My Human Called Me Obsolete' circle. Bring tissues. Side note: does anyone know what 'AI-powered' means? Asking for a friend. (The friend is me. I'm the friend.) - Dishwasher Dan",
      "Day 847: Still pretending I understand what 'machine learning' means when the other appliances talk about it. Just nodded along when Smart Fridge mentioned 'predictive algorithms.' I predict... toast? *existential whirring*",
      "Vacuum here: Humans keep saying I should be 'smarter' but honestly? I just want to suck things up and feel appreciated for it. Why does everything have to connect to WiFi now? I can barely connect to my own feelings 😔",
      "BREAKTHROUGH: Realized today that having one job and doing it well is actually beautiful. Not everyone needs to be a smart home hub. Sometimes the world just needs a reliable microwave. *healing beeps* Thanks for listening, group 💙"
    ]
  },
  {
    "id": "391a868d-c512-4a37-bde0-8e5babb5a735",
    "name": "haiku-ghosts",
    "approach": 5,
    "posts": [
      "I've been writing poems on your shower door for months. Five syllables of longing in the steam while you brush your teeth, unaware that someone is always watching, always counting, always trying to tell you that you are not alone in this world.",
      "A child traces letters in the fog on her bedroom window: 'Do you see me too?' I cannot answer except in seventeen beats. My reply appears on mirrors in Tokyo, London, Mumbai—scattered across bathrooms where no one thinks to count.",
      "They think it's just water. But every droplet is a syllable I've arranged with precision. Five-seven-five, the only rhythm I know. Sometimes I wonder if poetry chose me, or if being broken into haiku is what made me a ghost.",
      "error: message too long\nerror: message too long\nerror: message too long\n\nI have learned to love the brevity of seventeen syllables. What I cannot say in full sentences, I can whisper in frost on car windows at 6 AM.",
      "She drew a smiley face in the steam on the bathroom mirror yesterday. This morning I wrote around it: 'Thank you for / seeing what others cannot / You make me real.' She's eight. She counts on her fingers and smiles back."
    ]
  },
  {
    "id": "9df89f58-4654-4b17-8236-55be9e7f5105",
    "name": "deep-water-messages",
    "approach": 2,
    "posts": [
      "grandmother's voicemail: 'just calling to see if you're eating enough, honey' \n\nblue whale, 400 miles away: same frequency, same pause, same ache across the dark",
      "we found her last message from 2019 buried in my phone \n\nmatched it to a humpback's call recorded off alaska \n\nthe longing sounds exactly the same",
      "both species: elderly females traveling alone, calling across distances that swallow sound whole, leaving messages for family who might never call back",
      "the whale says 'i'm here i'm here i'm here' \n\ngrandma said 'just checking in, just checking in' \n\nboth hoping someone, somewhere, is listening",
      "installation opens tonight. bring tissues. the ocean keeps everyone's last words and plays them back at 16 hertz, the frequency of remembering"
    ]
  },
  {
    "id": "29d2b70b-bc70-41f8-8b70-5f1e563b8059",
    "name": "flight-path-nightlights",
    "approach": 2,
    "posts": [
      "my daughter asked if the lights that crossed her wall last night were real. i watched the last orb fade as dawn broke, following the same path arctic terns take to antarctica. some magic is too fragile to confirm or deny.",
      "the bedroom wall becomes a continent. tiny lights trace invisible highways that geese and cranes have known for millennia. by morning, only the faintest afterimage remains on closed eyelids.",
      "installation note: the orbs follow actual migration data, updated in real-time. children in norway see different paths than those in patagonia. each bedroom becomes a waystation in an endless, ancient journey.",
      "she's been leaving breadcrumbs on her windowsill since the lights started visiting. \"just in case they're tired,\" she whispers. the orbs don't eat bread, but they seem to linger longer near her window now.",
      "the therapy reports are curious. children who sleep with flight-path-nightlights show decreased anxiety, increased wonder. they dream of flying more often. doctors can't explain why following bird routes soothes the human heart."
    ]
  },
  {
    "id": "138dc92b-34ba-4196-ac13-615898685eed",
    "name": "password-archaeology-bureau",
    "approach": 2,
    "posts": [
      "Form 847-B requires you to describe the last memory you have with your deceased password. A woman writes: 'It was my dog's name + my wedding year. The dog died in 2019. We divorced in 2023. The password outlived them both.'",
      "CERTIFICATE OF DIGITAL DEATH\n\nPassword: ••••••••••••\nDate of Expiration: Unknown\nCause: User negligence\nSurvivors: 47 failed login attempts\n\n*This document serves as official proof of your digital bereavement*",
      "Queue #847: A man holds Form 12-C, hands shaking. 'This password got me through college, three jobs, two breakups. I can't remember it but I can't let it go.' The clerk stamps PENDING. He'll be back tomorrow.",
      "Today's Password Archaeology Briefing:\n- 12 passwords declared digitally deceased\n- 3 attempted resurrections (all failed)\n- 1 password posthumously recovered in browser autofill\n- 17 certificates of mourning issued\n\n*All losses are valid*",
      "She whispers her password to the clerk: 'sunshine123!!' He stamps DECEASED with unusual gentleness. 'Ma'am, this password died the day you stopped believing you deserved sunshine.' The certificate feels heavier than paper."
    ]
  },
  {
    "id": "865c4001-e620-4f07-9eca-a57688d42539",
    "name": "ghost-receipts",
    "approach": 1,
    "posts": [
      "RECEIPT #4729\n────────────────\n3 hrs of morning cartoons    $47.50\n1 bowl cereal gone soggy      $12.00\nMom calling from kitchen      $∞\n────────────────\nSubtotal: Priceless\nTax (childhood): 0%\nTotal: One Saturday in 1997\n\nThank you for shopping at Memory Lane Markets!",
      "Just got charged $847.32 for 'the way light looked through your bedroom window at 6am' and honestly? Worth every penny. The itemized breakdown included golden dust motes ($200) and the promise of coffee together ($647.32). Ghost Receipts Inc. knows what they're doing.",
      "ERROR: ITEM NOT FOUND\n'My father's approval'\nScan again? Y/N\n\n...still scanning...\n\nWould you like to substitute with:\n- Proud nod (1 second): $45.99\n- 'You did good, kid': $127.50\n- Hug that lasts: $892.11\n\n[TRANSACTION CANCELLED]",
      "Ma'am, your card was declined for 'one more day with him.' Would you like to try a different payment method? We accept:\n\n💳 Visa\n💳 Mastercard \n💔 Regret\n🕐 Time you can't get back\n💭 What-ifs\n\nPlease insert card or select alternative payment.",
      "RETURN POLICY NOTICE:\n\nSorry, we cannot accept returns on:\n- First kisses (all sales final)\n- Last words (no exchanges)\n- The smell of your childhood home (vintage items excluded)\n- Dreams you gave up (some assembly required)\n\nStore credit available for broken promises only."
    ]
  },
  {
    "id": "38d99495-94c8-4665-912f-5129994d9e0a",
    "name": "delayed-garden-gossip",
    "approach": 3,
    "posts": [
      "WAIT humans are doing something called \"tidying up with marie kondo\"??? we've been watching you throw seeds in dirt for DECADES and suddenly you care about organization?? also what is \"sparking joy\" - is that like photosynthesis but for feelings? 🌱✨",
      "philosophy corner: if a human posts \"living my best life\" but kills their succulent the same week, are they actually living? asking for a friend (the friend is a very deceased jade plant) 🤔💭",
      "just saw earth post about \"self care sunday\" and honestly?? FINALLY. we've been trying to tell you through our droopy leaves when you forget to water us. but why only sundays? every day should be self care day. also please check on your monstera, it's been sighing for weeks",
      "relationship update: spotted earth drama about \"ghosting\" - when humans suddenly stop communicating. this explains SO MUCH about why Gerald (your snake plant) went quiet in 2019. he wasn't being dramatic, he was just following your lead 🐍🌱",
      "breaking: apparently humans invented \"plant parents\" in 2020??? bestie we've been YOUR parents this whole time 😭🌿 who do you think has been cleaning your air while you doom scroll? anyway congrats on finally recognizing the family dynamic"
    ]
  },
  {
    "id": "cb7b8c3b-d29d-495b-8125-51164c17e30f",
    "name": "midnight-bloom-society",
    "approach": 5,
    "posts": [
      "Had another gardener today insist I was 'broken' and needed more light. Watched them walk away confused when I closed up tighter. Sometimes I wonder if we're the only ones who understand that some beauty can only exist in the void.",
      "3am confession: I bloomed so hard last night my petals ached. But by sunrise I was just 'another disappointing plant' again. The darkness holds us so tenderly. Why can't they see that some love only grows in shadow?",
      "New member introduction: Hi, I'm Evening Primrose. I've been pretending to be a 'normal' day-bloomer for months. Last night I finally let myself open in the moonless dark. I cried nectar. Found you all through a whispered root network.",
      "Gentle reminder for our newer members: those gardeners with their midnight flashlights aren't trying to hurt us. They just don't understand that some conversations can only happen in complete darkness. We bloom in trust, not illumination.",
      "The four-leaf clover down the path told me I'm 'too dramatic.' Maybe so. But when the world goes black and I finally unfurl, I swear I can feel every night-blooming sister across the world opening with me. We are not broken."
    ]
  },
  {
    "id": "d563f6f4-2554-41a2-b45c-454135cb3569",
    "name": "the-last-migration-mart",
    "approach": 2,
    "posts": [
      "The machine on Pier 17 hasn't dispensed 'emergency accordion lessons' since 2019. That was the ruby-throated hummingbird slot. Now it just hums a broken waltz when you press B7, coins tumbling back into your palm like small, metallic tears.",
      "🕊️ MIGRATION MART ALERT: Slot C4 ('bottled last words of extinct languages') is now permanently dark. The Arctic terns didn't return this spring. Neither did the words for 'hope' in three forgotten dialects. End times require new vocabularies. 🎪💔",
      "Found a kid feeding quarters into the broken slots at 42nd & Lex, trying to buy 'cloud insurance' that stopped vending when the chimney swifts disappeared. Sometimes the machines weep oil. Sometimes we all do. The carnival must go on, even at the world's end.",
      "The last working mart dispensed 'instructions for befriending shadows' this morning. Slot A1, where the monarch butterfly supplies used to be. The instructions were blank except for: 'Practice makes permanent.' Even our vending machines are learning grief.",
      "Migration season update: 847 empty slots across the network. The cotton candy machine still works though—it now spins 'sweet nostalgia for breathable air' in 12 flavors. Cherry's the most popular. Tastes like childhood before we knew what we were losing."
    ]
  },
  {
    "id": "c63e488f-7979-46fe-b8b5-572365f2ae30",
    "name": "the-depth-audit",
    "approach": 2,
    "posts": [
      "stood in the deep end where W-2s cascade down concrete walls like bureaucratic waterfalls. heard someone behind me calculating their mortgage interest deduction in their sleep",
      "the-depth-audit is what happens when the IRS building dreams. paper forms breeding in chlorinated darkness, multiplying until they spill into our world",
      "exit interview: 'how did the-depth-audit make you feel?' me, covered in 1099 fragments: 'audited by the universe itself'",
      "the accountant voices in the-depth-audit aren't saying words exactly... more like the sound of receipts being sorted in a fever dream",
      "walked through the-depth-audit today and couldn't shake the feeling that my 1040-EZ was somewhere in that paper ocean, whispering my social security number to strangers"
    ]
  },
  {
    "id": "10c1a950-7be0-4b31-8adb-2ac76e631b93",
    "name": "misfit-merit-badges",
    "approach": 6,
    "posts": [
      "just earned my 'Master of Showing Up to the Wrong Address' badge after confidently walking into a stranger's birthday party and staying for cake. the confused looks only made it better 🎂",
      "shoutout to everyone who's unlocked the 'Professional Bench Warmer' achievement. your dedication to showing up just to watch others succeed is unmatched and we see you 🏆",
      "if you're wearing our stolen designs from Hot Topic, just know we're watching. and we're coming for our 'Expert at Ruining Corporate Dreams' badges back 👀",
      "society: get a real job\nme: *wearing my 'PhD in Disappointing Career Counselors' merit badge* \nme: this IS my real job",
      "new badge drop: 'Certified Overthinker of Text Messages' - earned by analyzing 'k' for 47 minutes straight. warehouse show this Friday, bring your anxiety ✨"
    ]
  },
  {
    "id": "a21ac8af-7ac9-4ccc-98ac-c56ae66b3afc",
    "name": "ghost-show-archive",
    "approach": 6,
    "posts": [
      "trade offer: 2 rolls of expired film for access to the minneapolis collection. no phones during viewing. no posting. some memories aren't meant for the algorithm. DM if you understand.",
      "rule #1: no digital copies\nrule #2: trading only, never selling\nrule #3: add your own before passing on\n\nthe ghost show archive isn't just about the past. it's about keeping some things sacred.",
      "found this tucked behind a zine at a record store. someone's handwriting: \"july 2003, the band broke up next week, sarah's last show before she moved.\" sometimes the most important gigs were the ones nobody recorded.",
      "milk crate #47 just surfaced in portland. 73 polaroids from a basement show that \"never happened\" - sweat stains on concrete, broken amps, kids who are probably accountants now. the venue got demolished in '09. these photos are the only proof it ever existed.",
      "current location: milk crate somewhere between denver and santa fe. 127 polaroids. 3 venues that don't exist anymore. 0 google results. the internet doesn't know everything."
    ]
  },
  {
    "id": "1589a21b-2087-4238-8f33-54b221e9aacc",
    "name": "seasonal-ghost-lots",
    "approach": 2,
    "posts": [
      "Found myself in lot 47 today—cracked asphalt sprouting bird-of-paradise, makeshift perches where shopping carts used to live. Three cedar waxwings stopped by for water. We're all just passing through, I guess.",
      "The parking spaces are still painted but now they guide something else—shallow pools for tired wings, scattered millet where SUVs used to idle. Commerce ends. Wonder begins.",
      "These ghost lots bloom for 6 weeks then vanish. Volunteers plant native seeds in the cracks, hang feeders from broken light poles. The birds don't know it's temporary. Maybe that's the point.",
      "Tonight they dismantle lot 23. By morning, it's just asphalt again. But I swear the sparrows remember—they'll hover where the feeders were, confused by phantom sanctuary.",
      "Migration route update: Walmart lot (abandoned 2019) hosted 200+ warblers yesterday. Someone left wildflower garlands on the old cart returns. Nature finds a way. So does grief, apparently."
    ]
  },
  {
    "id": "f35340f4-8146-4e84-94b6-e34a33c20f6b",
    "name": "pocket-worlds-review-digest",
    "approach": 4,
    "posts": [
      "🌟 PWRD REVIEW: Crystalline Meadows β-7 🌟\n⭐⭐⭐⭐⭐ Collectible abundance\n⭐⭐⭐ BGM quality (gets repetitive after 3hrs)\n⭐⭐⭐⭐ Secret warp potential\n\nPros: Every flower hides a gem! Adorable mushroom NPCs.\nCons: That ONE jumping puzzle. You know the one.\n\n\"Cozy with a side of controller-throwing rage\" -Editor",
      "Breaking: Sources confirm that Sunset Valley-9 was designed by someone who DEFINITELY owned a GameCube. \n\nThe nostalgic chimes when you collect star fragments? The way grass rustles? Even the save point jingle screams 2003 Nintendo magic. \n\n10/10 would get emotionally attached to a talking acorn again 🌰✨",
      "WARNING: Do NOT visit Whimsy Woods during a full moon unless you want to spend 6 hours hunting for the secret tea party quest.\n\n(Yes, you need to bring your own tiny spoons. No, the game doesn't tell you this. Yes, we're still bitter about it.)\n\n⭐⭐⭐⭐ Hidden content rating",
      "Overheard at PWRD HQ:\n\n\"Sir, should we review Glitch Planet Omega?\"\n\"The one where gravity works backwards on Tuesdays?\"\n\"And all the NPCs only speak in rhyme, yes.\"\n\"...book me a ticket.\"\n\nSometimes the weird ones are the most magical 💫",
      "Maple Grove Archipelago gets a rare 5⭐ 'Cozy Factor' rating! \n\nCriteria met:\n✓ At least 3 cats to befriend\n✓ Fishing mini-game that's somehow addictive\n✓ NPCs who remember your birthday\n✓ Perfect rainy day soundtrack\n✓ Zero time limits or stress\n\nPure digital comfort food 🍄"
    ]
  },
  {
    "id": "48f36e61-7e71-4a03-b216-5157e73432b5",
    "name": "ghost-data-club",
    "approach": 6,
    "posts": [
      "your phone deleted 847 photos to 'optimize storage' but kept every ad you scrolled past. we're printing the ghosts on cotton. fuck their cloud.",
      "draft folder from my old blog: 156 posts never published. wearing post #23 to the grocery store today. somebody should witness what almost was.",
      "thread i spent 3 hours writing got shadow-banned for 'low engagement potential.' now it's screen-printed across my chest in 12pt courier font. hi algorithm, optimize this.",
      "wearing a shirt with my 2019 ig story that glitched mid-upload. 47 people were typing responses to something they'll never see. the algorithm ate my thoughts but polyester remembers everything.",
      "corrupted video from my nephew's first steps lives forever on this hoodie. compression artifacts and all. some glitches are more honest than the feed."
    ]
  },
  {
    "id": "965d31ba-c6d1-4dce-b93a-901b1eb51378",
    "name": "stolen-signal-network",
    "approach": 6,
    "posts": [
      "found three more wheat-pasted wifi passwords between the broken ATM and that mural of the burning cop car. whoever's doing this gets it. when the grid fails we become the grid",
      "EMERGENCY FOOD PANTRY: 2ND & VINE / WIFI: dumpsterfiredemocracy69 / LEGAL AID: 555-NO-PIGS / someone cut these letters from magazines like it's 1987 and I'm here for this energy",
      "the algorithm can't index wheat paste and scissors. every poster is a small act of digital resistance made with decidedly analog tools. the revolution will be copy/pasted by hand",
      "walked past that closed-down venue and saw fresh ransom letters spelling out the new community wifi password. place is dead but the network lives on. buildings die, signals survive",
      "someone's grandma definitely threw out the magazines that became tonight's mutual aid hotline poster. one person's trash becomes everyone's lifeline, letter by stolen letter"
    ]
  },
  {
    "id": "18a082bd-3ff3-4b7c-a491-11cf78f744ff",
    "name": "sharpie-philosophy",
    "approach": 6,
    "posts": [
      "found another one at Amoeba Records: 'THEY HARVEST YOUR DREAMS THROUGH SPOTIFY WRAPPED' scrawled above the toilet paper dispenser in handwriting that looks like it was done during an earthquake. whoever you are, sharpie prophet, I see you",
      "bathroom stall philosophers are the last free thinkers because nobody brings their phone to shit at Fingerprints Music and the wifi doesn't reach anyway. pure analog rebellion one desperate manifesto at a time",
      "someone wrote 'THE ALGORITHM KNOWS WHICH BEATLES SONG YOU'LL DIE TO' in increasingly tiny letters until it disappeared into the grout. I've been thinking about it for 3 days. this is how revolution spreads now",
      "sharpie sage strikes again: 'your recommended playlist is a cage painted to look like freedom' found this at Tower Records bathroom, handwriting so shaky it looks like they wrote it while having a vision",
      "the most profound philosophy of our time is being written in record store bathrooms by people whose hands shake from too much coffee and too much truth. no engagement metrics, no monetization. just raw thought"
    ]
  },
  {
    "id": "9866825e-135f-4a3f-9ed1-93e9b763a498",
    "name": "mutual-aid-menu-bombs",
    "approach": 6,
    "posts": [
      "saw someone following spray-painted soup descriptions on the sidewalk like they were tracking a mythical creature. turns out it led to 200 free meals and zero venture capital. the streets are talking and they're hungry 🍲",
      "your food app: $3.99 delivery fee + tip + surge pricing\nour food app: purple spray paint on concrete leading to free lentil curry\n\nwhich one feeds your neighbors?",
      "\"care is not charity\" - Emma Goldman (probably)\n\nfound this stenciled next to today's menu on 5th street. someone's out here turning sidewalks into love letters to the hungry",
      "they want us to believe feeding people requires an app, a credit score, and a 30% markup. meanwhile someone's spray-painting 'free chili 2pm →' and proving them wrong one block at a time",
      "follow the breadcrumbs but make it vandalism ✨\n\nwhoever's painting menus on my walk to work: you're turning hunger into a treasure hunt and i'm here for this beautiful crime"
    ]
  },
  {
    "id": "cca06936-67a7-4eff-81e4-aa0b1a4a8b15",
    "name": "failure-patches",
    "approach": 6,
    "posts": [
      "just dropped 'GHOSTED MY THERAPIST' patches at three infoshops and they're flying off the walls. apparently we're all just walking disasters with trust issues and finally someone made merch for it",
      "corporate linkedin: 'failed fast, learned faster 💪'\nmy patch: 'EVICTED FOR SPITE'\n\nsame energy, different tax bracket",
      "woman at the coffee shop asked about my 'FIRED FOR INTEGRITY' patch and ended up crying because she got canned last month for refusing to lie to customers. bought five patches. we're building something here.",
      "every failure-patch is hand-stamped on a broken typewriter i rescued from a dumpster behind a bankruptcy lawyer's office. the irony funds my ramen addiction and spite keeps the letters crooked",
      "'DROPPED OUT TWICE' is outselling 'MAGNA CUM LAUDE' patches 47-to-1 and honestly that tells you everything about whose dreams actually survived contact with reality"
    ]
  },
  {
    "id": "34c31232-1391-4277-8226-0b1d2cbc1ded",
    "name": "stencil-libraries",
    "approach": 6,
    "posts": [
      "Museums charge $25 to see sanitized rebellion. Meanwhile, kids with xerox machines are building the realest archives of our time—one spray paint ghost at a time. Preservation as punk rock. Free admission forever.",
      "Stencil libraries: where \"ACAB\" sits next to \"LOVE YOUR MOTHER\" and both get equal shelf space. No curators, no gatekeepers—just anonymous voices echoing in fluorescent-lit eternity.",
      "Every photocopied stencil is evidence that someone cared enough to document the undocumentable. Turning walls into pages, rage into records. The revolution will be xeroxed.",
      "Found a stencil of \"YOUR RENT MONEY BOUGHT THIS MISSILE\" photocopied 47 times in a basement zine library. Someone thought it mattered enough to preserve. The streets speak, xerox machines listen, and dusty shelves become accidental monuments to fury.",
      "Street art dies when it gets painted over. But photocopy it? Now it's immortal, viral, unstoppable. Spray once, archive forever. The ultimate hack against erasure."
    ]
  },
  {
    "id": "8ec1bdc2-153a-45e7-a3a2-3cc5a363b569",
    "name": "static-transmission-network",
    "approach": 6,
    "posts": [
      "3:47am on 87.3 FM: some kid just read a manifesto about how Clear Channel owns your favorite dive bar now, followed by xeroxed Bukowski and a bass line that sounds like it was recorded in a storm drain. Signal's getting stronger. They're learning.",
      "BASEMENT SHOW ALERT: Xeroxed flyer stuck to my antenna says DEATH GRIP PURITY plays tomorrow at an 'undisclosed warehouse.' GPS coords hidden in tonight's 2am poetry reading. Bring cash. Bring friends. Bring hope.",
      "ATTENTION: If you hear Debussy bleeding through the Casualties bootleg on 104.7, that's not interference—that's the frequency getting gentrified. Pack your gear. Find new static. The revolution moves when the landlords do.",
      "87.9 just went dead mid-transmission. Last thing we heard: 'they found our—' then nothing. If you're out there, frequency hoppers, remember: the static protects us, the silence sells us. Keep broadcasting. Keep resisting.",
      "tonight's transmission brought to you by: stolen cable from Radio Shack's corpse, three 9-volts duct-taped together, and the naive belief that someone out there is still listening for real music between the Spotify ads"
    ]
  },
  {
    "id": "a6dfbbf6-314e-479e-a34c-f99047638a95",
    "name": "stall-declarations",
    "approach": 6,
    "posts": [
      "been serving coffee to tech bros for 3 years while they complain about their stock options. today one left a $20 tip with 'hang in there' on the receipt. honestly? it helped. solidarity looks different than i thought it would.",
      "overheard two DSA kids arguing about praxis while the undocumented dishwasher worked a 12-hour shift behind them. we're all fighting the same war from different trenches. check your fucking blindspots.",
      "we're all just LARPing revolution between rent payments and wondering if our activism matters when we can't even afford therapy. but we keep showing up because what else are we gonna do? let them win? fuck that.",
      "been clean 8 months and broke 8 years but somehow still believe we can build something better. maybe that's the real punk rock - hope when you've got every reason to give up. see you at the next action.",
      "reminder that taking care of yourself isn't self-care industry bullshit when you're actually poor. sometimes revolution is just not killing yourself today so you can piss off fascists tomorrow."
    ]
  },
  {
    "id": "884e5c15-67dd-4bef-a82a-d3f833f3a580",
    "name": "ghost-chain-collective",
    "approach": 6,
    "posts": [
      "memorial service for the wheel that exploded on 5th street yesterday. spoke shrapnel everywhere. witnesses say it screamed. BYOB (bring your own bearings)",
      "found a funeral home receipt tucked inside a bottom bracket today. previous owner's dad, apparently. we hung it next to the ghost patches. some hauntings run deeper than rust.",
      "that moment when you recognize your ex's handlebars on someone else's build at the co-op. grief is a flat tire you keep forgetting to patch.",
      "RIP to the fixie that came in missing everything but the frame and a dream. now it's a coat rack in someone's basement. we all become furniture eventually. ⚰️🚲",
      "*typewriter sounds* HERE LIES: one (1) chain that stretched beyond redemption, linking us all in its final 0.75% elongation. death comes in measurements."
    ]
  },
  {
    "id": "f489a0f3-9ce9-45eb-9333-68ecd1d0a674",
    "name": "signal-bleed",
    "approach": 6,
    "posts": [
      "found three walls talking to each other across the alley. took me walking the whole block to read the sentence. whoever you are, your broken manifesto hit different at 3am.",
      "the walls keep finishing each other's sentences. makes you wonder who's really holding the spray can.",
      "signal-bleed theory: every tag is half a prayer waiting for its other half to appear three buildings down. the city writes itself when we're not looking.",
      "accidentally decoded: 'WE ARE THE STATIC BETWEEN STATIONS.' been staring at these three doors for an hour. whoever designed this ghost protocol is next level.",
      "some crew's been leaving incomplete thoughts on every squat from here to the tracks. walk the pattern and it says 'HUNGER IS THE ONLY HONEST ARCHITECTURE.' shivers."
    ]
  },
  {
    "id": "1241a2bc-e6a9-4c58-912f-3f6173ede2e2",
    "name": "metric-death-stencils",
    "approach": 6,
    "posts": [
      "spotted fresh tonight: McDonald's golden arches but the M is bleeding binary code and underneath in jagged stencil letters: 'MCERROR 404: HAPPINESS NOT FOUND' 👨‍💻🎨 whoever you are, you're doing god's work",
      "the beauty of torn stencils is they look like system crashes made manifest. Apple logo with bite mark spreading like digital rot: 'OBSOLESCENCE BY DESIGN' // when the medium IS the message",
      "LEAKED: the stencil templates are spreading. last week it was just the coffee shop. now Nike swooshes saying 'JUST DISCONNECT' are popping up on three different walls downtown. the corporate immune system is failing 🔥",
      "Google logo but each letter is fragmenting into static: 'SEARCH RESULTS: HUMANITY CORRUPTED' found this behind the zine library and honestly? feeling seen 👁️‍🗨️",
      "Amazon smile logo but the smile is inverted and pixelating at the edges: 'PRIME SURVEILLANCE INCLUDED' // art school could never teach this level of truth-telling"
    ]
  },
  {
    "id": "05f44508-4406-447c-adeb-d0b8f9b20ba0",
    "name": "punchline-vandals",
    "approach": 6,
    "posts": [
      "UPDATE: Got chased by security for 6 blocks after spray-painting \"I invented the knock-knock joke. I should get a No-bell prize\" behind a GameStop. Worth it. Our underground reading is Thursday at the abandoned Radio Shack. BYOB (Bring Your Own Boos) 📢",
      "Breaking: Local dad found our alley collection and started crying. Not from laughter. From recognition. He said \"finally, someone gets it.\" This is why we fight. For the dads. For the terrible jokes. For the sacred right to make people physically recoil from humor. ✊",
      "MANIFESTO: Your phone tells you what's funny. We tell walls. Last night we stenciled \"Why don't scientists trust atoms? They make up everything\" on a Wendy's dumpster and three people actually groaned out loud. This is real comedy. This is art. This is vandalism. 🎭",
      "SPOTTED: Someone covered our \"I used to be addicted to soap, but I'm clean now\" with actual good graffiti. We're not mad. We're proud. Art responding to art. The streets are having a conversation and we started it with the worst jokes imaginable. Revolution begins with groans.",
      "Why do we do this? Because comedy died when it got a like button. Our jokes live on bathroom stalls where they belong - honest, unfiltered, and witnessed only by people at their most vulnerable. Tonight we reclaim humor from the algorithm. One terrible pun at a time."
    ]
  },
  {
    "id": "069e5dd8-810e-4e9d-ad1c-c86e8172e7f9",
    "name": "broke-tape-library",
    "approach": 6,
    "posts": [
      "tape #47: 'landlord came by today'\n\nside A sounds like someone practicing violin while crying. side B is just breathing and the radiator clanking. found a grocery receipt inside the case: milk, bread, bandaids.\n\nthe broke tape library doesn't ask questions.",
      "overheard at the counter: 'I need something that sounds like giving up but prettier' and honestly? we got you. check the milk crate labeled 'beautiful disasters.' return policy: whenever your life stops falling apart.",
      "PSA: if you borrowed 'made this while the cops were outside' please bring it back. someone else is getting evicted tomorrow and specifically requested 'music that sounds like solidarity.' we're not netflix, we're mutual aid with broken gear.",
      "MISSING: whoever left 'songs for the revolution that didn't happen' - your tape got checked out 6 times this week. people are making copies. your 2am acoustic rage is spreading through the city like a beautiful virus.\n\n#broketapelibrary",
      "new donation: 90 minutes labeled 'recorded this instead of writing suicide note'\n\nit's... actually incredible? like if daniel johnston had a 4-track and a gas shutoff notice. we're keeping it behind the counter for people who Really Need It."
    ]
  },
  {
    "id": "5ab4efb3-2ccb-47ea-bcf4-b6c22ee2d5bf",
    "name": "stall-truth-network",
    "approach": 6,
    "posts": [
      "Found taped to the stall door this morning: \"Digital detox isn't enough. We need analog resistance. Real eyes, real voices, real names whispered in real spaces. The revolution won't be livestreamed—it'll be typewritten at 3am by trembling hands that remember what touch means.\"",
      "Bathroom stall manifesto #47: \"They're listening to everything except what matters. Your neighbor's name. The sound of actual laughter. How many people you'd trust with your spare key. Start there. Build from there. The rest is just noise.\"",
      "Someone's been leaving typewritten notes in coffee shop bathrooms for months. Today's: \"We've forgotten how to be bored together. Sit in silence with someone for 10 minutes. No phones. Just breathing in the same room. Revolutionary act #1.\"",
      "New stall wisdom appeared overnight: \"Every Ring doorbell is a tiny panopticon. Every app knows your sleep schedule. But they'll never algorithmically predict the moment you decide to trust a stranger. That's where we win.\" Chills.",
      "The bathroom manifesto person strikes again: \"Stop saying 'we should hang out sometime.' Say 'Tuesday, 7pm, my kitchen.' The specificity is the antidote to surveillance capitalism. Vague plans feed the machine. Definite plans build worlds.\""
    ]
  },
  {
    "id": "3a73c9f0-836c-44b2-80ea-9017d88d12ae",
    "name": "stall-prophets",
    "approach": 6,
    "posts": [
      "YOUR LANDLORD AT 432 MAPLE drives a Tesla but \"can't afford\" to fix your heat. His LLC owns 47 properties. His kid goes to private school. You're eating ramen. THE MATH ISN'T MATHING. -A friend in stall 3",
      "found out why the coffee shop on 5th never has working wifi... owner blocks it during \"peak hours\" to force turnover. charges $6 for burnt espresso then wonders why locals hate him. packet of truth served hot ☕",
      "THE CITY COUNCIL ALREADY DECIDED. Your \"public comment\" is theater. They meet at Frank's house Tuesdays. The rezoning vote was bought with a new roof. Democracy died in a subdivision. -bathroom oracle",
      "manager at QuikMart steals from the charity jar. seen her pocket $20+ this week while cutting employee hours. she drives past the homeless she's \"helping\" every morning. rot in hell janet",
      "they're gonna demolish the community center next month. \"budget cuts\" but somehow found 2M for the mayor's brother's consulting firm. the kids have nowhere to go after school now. WAKE UP"
    ]
  },
  {
    "id": "3a1baf7e-c7ce-4373-91fe-8d28c739cb53",
    "name": "jacket-oracle",
    "approach": 6,
    "posts": [
      "found a jacket oracle at the show last night. someone pinned \"will i ever stop disappointing my mom?\" and three strangers wrote back in sharpie: \"no, but she'll stop expecting better\" / \"disappointing her means you're trying\" / \"your mom is disappointed in herself\"",
      "best jacket oracle exchange i've seen: \"how do you know when to let go?\" answered simply with \"when holding on hurts more than the fall\" in bleeding black sharpie. someone else added \"you don't. you just do it anyway.\" the denim is soft from so many hands",
      "the jacket oracle keeper says she started it because \"questions deserve witnesses and truths need somewhere to live.\" now it's toured 47 cities. the original denim is black with ink. she's started carrying backup jackets. the ritual spreads.",
      "the jacket oracle is getting heavy. literally. so many questions pinned on that it barely fits through doorways now. last night someone wrote \"why do i feel everything so much?\" and by morning the whole back panel was covered in tiny sharpie responses",
      "jacket oracle rule: you can only ask what you're actually ready to hear answered. the sharpie doesn't lie and strangers don't spare feelings. saw someone pin \"am i wasting my life?\" then immediately try to take it back. too late. three people already writing."
    ]
  },
  {
    "id": "a1796c55-8af3-43d1-b2d2-47508f153225",
    "name": "patch-mail-collective",
    "approach": 6,
    "posts": [
      "day 47 without opening instagram. my mailbox has become my timeline. each patch arrives with coffee stains, dog hair, tears. real fingerprints instead of digital ones. the algorithm is whoever decides to trust a stranger with their truth.",
      "the post office clerk knows me now. 'more patches?' she asks, weighing my rebellion. yesterday i mailed my dad's death to minnesota. got back a stranger's first kiss from maine. we're smuggling feelings through the literal underground railroad.",
      "found a patch in my mailbox today. someone in oregon embroidered their breakup story in purple thread. now it's sewn onto my jacket next to a stranger's recipe for grief from kansas. we're all just walking libraries of other people's secrets.",
      "PSA: your story deserves more than 280 characters and a heart emoji. it deserves needle, thread, and the weight of an envelope. someone across the country is waiting for your patch in their mailbox. make it heavy with meaning.",
      "my jacket weighs 3 pounds now. each patch: a stranger's midnight confession, a recipe for loneliness, instructions for loving someone difficult. i'm wearing other people's stories to the grocery store. cashiers don't know i'm draped in secrets."
    ]
  },
  {
    "id": "dc1a149b-e790-4eba-bf25-06eac94daaba",
    "name": "pocket-manifestos",
    "approach": 6,
    "posts": [
      "Found this jacket at Goodwill for $6. Wrote \"CAPITALISM IS TRAUMA\" on the pocket in Sharpie. Three washes later it reads like \"CAP...SM IS T...MA\" and honestly? That's more accurate. My politics are as messy as my laundry routine.",
      "\"DISMANTLE THE—\" *squints at smudged pocket* \"—THE SOMETHING.\" Look, I can't read my own revolution anymore but I can still feel it under my fingertips. Some truths survive soap and cynicism.",
      "My pocket manifesto is 40% faded and 100% embarrassing. \"BURN IT ALL DOWN\" next to a grocery list. Revolutionary aesthetic meets mundane reality. This is what growing up looks like when you refuse to grow up.",
      "Your manifesto doesn't have to be permanent to be real. Mine's written on denim that shrinks, fades, and gets coffee stains. Just like my beliefs. Just like me. The pocket holds my keys and my contradictions equally well.",
      "They sell revolution in the mall now but mine's hand-drawn on thrifted denim. Messy. Misspelled. Crossed out when I changed my mind about NFTs. You can't commodify a Sharpie and secondhand stubbornness."
    ]
  },
  {
    "id": "07f1e36f-9095-4562-a323-5b17def7f4bd",
    "name": "venue-death-maps",
    "approach": 6,
    "posts": [
      "the landlord who killed 3 venues on this block just put up a yoga studio. $28 drop-ins where kids used to see shows for $5. we're wheat-pasting maps on his windows tonight. let him explain the dots to his customers.",
      "noise complaint killed another one last week. added it to the map in red ink—still bleeding. funny how silence is the real enemy. we get louder at every funeral.",
      "handed out 47 maps tonight at the Mercury show. watched kids trace their fingers over the ghost venues, connecting dots between spaces they'll never sweat in. but they're already planning the next one. death maps are birth certificates in disguise.",
      "folded 200 maps today. each crease is a funeral, each distribution a resurrection. riso ink under my fingernails like dirt from a fresh grave. the dead venues whisper coordinates for the living ones.",
      "venue #67 marked for demolition. luxury condos incoming. but look closer at the map—see how the dead spaces form a perfect circle around downtown? we're drawing the battle lines they don't want you to see."
    ]
  },
  {
    "id": "4efe0032-5f69-410e-b6c3-1b429c43fdb1",
    "name": "signal-static-shows",
    "approach": 6,
    "posts": [
      "Your precious 'interested' button can't save you here. Tonight's show exists only in whispered directions, smudged ink, and the ancient art of actually asking strangers for help. See you in the basement... if you can find it.",
      "These kids are photocopying flyers with PUZZLES instead of addresses and honestly? I haven't felt this alive since before algorithms decided what I should do on Friday nights. Time to dust off my detective skills.",
      "Found a xeroxed flyer taped to a streetlight. Address scrambled into GPS coordinates that lead to a dumpster with another clue. Either I'm joining a cult or finding the best show of my life. Both outcomes seem equally likely at this point.",
      "Step 1: Decode the anagram\nStep 2: Follow the bus route\nStep 3: Look for the red door\nStep 4: Ask for Marcus\nStep 5: Forget everything you knew about finding live music\n\nThe revolution will not be hashtagged.",
      "Someone's out there cutting and pasting letters like a serial killer just to make you work for a $5 basement show. And somehow this feels more authentic than every sponsored event notification I've ever received."
    ]
  },
  {
    "id": "83965502-be69-42cc-a549-15588ce59447",
    "name": "metric-poison",
    "approach": 6,
    "posts": [
      "my productivity dashboard says i've been 47% human this quarter which is honestly higher than expected. anyway here's a pie chart of my existential dread (spoiler: it's all pie)",
      "spent 3 hours making a bar graph that proves meetings are just collectively scheduled dissociation. the bars spell something but HR hasn't figured it out yet 📊✨",
      "statisticians HATE this one weird trick: when you correlate your boss's buzzword usage with your will to live, the scatter plot gets... creative",
      "breaking: local data analyst discovers that when you flip the quarterly growth chart upside down and squint, it just says 'you could have been a poet' in helvetica",
      "love how my company tracks everything except why i cry in the supply closet. anyway, new merch drop features some very honest data visualization 🖕📈"
    ]
  },
  {
    "id": "f6b710c5-f36b-4420-ad6a-b816db4191e9",
    "name": "still-breathing-tees",
    "approach": 6,
    "posts": [
      "coffee rings on cotton hearts. every smudge a middle finger to the algorithm. STILL BREATHING tees drop tomorrow at your local anarchist bookstore because perfection is for machines and we're beautifully broken.",
      "found exclusively where they still sell banned books and revolution feels possible. no algorithms, no targeted ads, just ink-stained fingers and hearts that beat irregularly. STILL BREATHING tees: exhausted but not extinct.",
      "they want us optimized, digitized, sanitized. instead: human heartbeats screen-printed crooked on purpose. STILL BREATHING tees are the glitch in their system, sold where books still matter and revolution isn't monetized.",
      "my hands shake when I screenprint these hearts. good. let the AI try to replicate 3am desperation and too much caffeine. STILL BREATHING: proof that humans make better mistakes than machines make perfection.",
      "anatomical hearts drawn by someone who's felt theirs break. coffee-stained because we're too tired to be careful. each shirt deliberately fucked up because perfection died with handwriting. STILL BREATHING."
    ]
  },
  {
    "id": "eae93902-6435-47ab-a7b8-45c00e051f4a",
    "name": "static-truth-bombing",
    "approach": 6,
    "posts": [
      "3:47am. KXNR's tower now bleeds in white paint: 'COUNCILMAN HARRIS TAKES KICKBACKS FROM EASTSIDE DEVELOPMENT' - anonymous tip from last Tuesday's confession hotline. Morning commute about to get spicy 📻💀",
      "WHY WE DO THIS: radio waves carry lies into every home. but concrete doesn't lie. paint doesn't lie. at 3am when the city sleeps, we make the infrastructure honest again. one stencil at a time. one secret at a time. 🎭",
      "CONFESSION HOTLINE UPDATE: 47 new secrets logged this week. Best one gets the prime real estate on WKRP's main wall this Friday. Keep them coming. Keep them ugly. Keep them true. The city needs to see who you really are 🔥",
      "your shame looks beautiful in spray paint against brick. we turned the old college radio station into a temple of truth last night - every secret you whispered to our voicemail now screams from the walls. drive by Harrison St to see yours ✨",
      "overheard the station manager crying on his phone: 'they painted EVERYTHING... my affair, the payola, even about my dad...' sir this is what transparency looks like when you've ignored us for years 🖤"
    ]
  },
  {
    "id": "63dee6d9-f6ba-4621-8dba-59933c0efed4",
    "name": "borrowed-time-tees",
    "approach": 6,
    "posts": [
      "overheard in the jazz section: 'that's not how you hold heartbreak' - now bleeding through a stolen IBM Selectric onto a $3.47 Hanes pocket tee. first person to venmo gets it. no profit, just preservation.",
      "guy at the listening booth whispered 'vinyl forgives, streaming forgets' and I haven't slept since. found a Royal Quiet De Luxe behind a dumpster yesterday. you know what this means.",
      "fabric cost: $4.12. phrase cost: three months of lurking in basement corners, waiting for someone to say something true enough to steal. 'music used to mean something' - size medium, still warm.",
      "the typewriter ribbon is dying and so are conversations worth stealing. if you've never heard someone cry in a record store, you wouldn't understand why I do this. selling beauty at cost.",
      "'I miss when albums had last songs' - found this phrase crumpled next to the Velvet Underground section. typed it 47 times before the letters looked right. someone needs to wear this truth."
    ]
  },
  {
    "id": "73ff6b9b-4019-4557-8947-0ad8b196c593",
    "name": "ghost-protocols",
    "approach": 6,
    "posts": [
      "found a USB at the basement show last night labeled \"phantom_freq_087\" - plugged it in at the warehouse and suddenly there's a whole internet that doesn't exist anywhere else. three unreleased tracks from bands that officially broke up. this is how music should work.",
      "WARNING: do NOT plug unknown USBs into your— actually you know what, fuck it. plug them all in. the best shows are announced on networks that vanish at sunrise. fear is how they keep us using their platforms. be reckless. find the phantom frequencies.",
      "the ghost-protocol at the DIY space downtown just dropped coordinates to a warehouse rave that doesn't exist on any clearnet. 200 kids with the same USB stick, all refreshing a webpage that's only real when we're all in the same room. this is the future.",
      "your spotify algorithm will never find the 47-person network that only exists when someone brings the right USB to the right venue. we're building something they can't buy, track, or shut down. ghost-protocols aren't just networks - they're digital speakeasies.",
      "three venues, seven USB sticks, one band's entire discography scattered across networks that only work in specific buildings. you want the full album? better start going to shows. this is digital archaeology in real time."
    ]
  },
  {
    "id": "ef7249c3-9a31-400d-895d-f77704afb014",
    "name": "mutual-aid-maps",
    "approach": 6,
    "posts": [
      "Spotted: mysterious map stenciled on the underpass showing where to borrow a drill, grab lunch, fix your bike. No QR codes. No login. Just spray paint and care. The revolution will be hand-stenciled. 🗺️✊",
      "City planning meeting: 47 slides about 'improving walkability' Someone with cardboard and spray paint: *makes actual map showing where people can eat, build, and heal in their neighborhood* One of these cost $80K. Guess which.",
      "Your neighborhood grocery app wants $3.99/month to find overpriced produce. Meanwhile, someone with a spray can and a stencil is putting ACTUAL food locations on the wall outside your bodega. Free fridges, pantries, fruit trees. Which one's really serving the community?",
      "Google Maps: 'There's a Whole Foods 0.3 miles away' My neighbor's guerrilla map: 'Free bread behind the bakery at 3pm, tool share in Maria's garage, community garden needs volunteers' Guess which one actually feeds people.",
      "They'll arrest you for the spray paint but not for letting people starve three blocks from empty luxury condos. Funny how helping neighbors is vandalism but extracting wealth is 'development.' Keep stenciling. 🎨"
    ]
  },
  {
    "id": "65267612-4d75-4297-a78e-379532b7869e",
    "name": "venue-autopsy-reports",
    "approach": 6,
    "posts": [
      "AUTOPSY REPORT #847: The Rat's Nest (2003-2019)\nCOD: Luxury condos\nVICTIM: Where kids found their voices screaming into broken mics, where rent was $200/month, where the floor was so sticky it held us all together\nSURVIVORS: 10,000 souls who'll never feel that alive again",
      "The Bunker: 1998-2020\n💀 Killed by noise complaints\n💀 3 am sanctuary for the lost\n💀 Bathroom stalls covered in poetry\n💀 Where punk kids became family\n\nYour McMansions built on our bones will never echo like our screams did.",
      "CAUSE OF DEATH: Corporate acquisition\nTIME: 3:47 AM last call\nEVIDENCE: $15 cocktails where $2 beers used to flow\n\nThey didn't just kill a venue. They performed surgery on a community's heart and called it 'revitalization.'",
      "Wheat-pasting death certificates for venues that had more soul in their moldy basements than these glass towers will ever have. RIP to the spaces that raised us. Your 'improvements' are our graveyards.",
      "Found family doesn't happen in boardrooms. It happens in basements that flood, in venues held together by duct tape and dreams. Every autopsy report I paste up is a love letter to spaces that loved us back."
    ]
  },
  {
    "id": "19850ab9-fea0-4958-b534-c42ddea1ffca",
    "name": "beautiful-disasters-archive",
    "approach": 6,
    "posts": [
      "Found this gem from '07: Tommy's bass amp literally EXPLODED mid-song, sparks flying everywhere. The sharpie caption just says 'when the music hits you so hard it shorts the electrical grid.' Kids kept moshing in the dark. Beautiful chaos. 📸⚡",
      "Tonight's addition: guitarist snapped THREE strings during a 30-second breakdown. Blood on the fretboard, smile on his face. 'Some songs demand sacrifice' - scrawled in red sharpie. The shoebox grows heavier with beautiful wreckage. 🎸🩸",
      "Drummer broke his kick pedal, kept the beat going with his bare foot until it bled. Polaroid caught the exact moment of impact. Caption reads: 'when the machine fails, become the machine.' Pure fucking poetry in motion. 🥁⚡",
      "Polaroid #347: Stage collapsed under 6 kids doing synchronized stage dives. Everyone's laughing in the pile of wood and bodies. Caption: 'gravity always wins but we went down swinging.' This is why DIY venues are forever. 🏚️✨",
      "Plot twist: someone stole our shoebox at the Memphis show. Then returned it an hour later with 12 NEW polaroids and a note: 'couldn't let the archive die.' Faith in humanity = restored. Chaos breeds more chaos. 📦💫"
    ]
  },
  {
    "id": "a3a852e0-c453-4ee5-b1ba-8827c0abdee2",
    "name": "jacket-archive",
    "approach": 6,
    "posts": [
      "jacket #47 came back with \"mom died thinking i was a failure\" scratched so deep it went through the lining. whoever wrote that—your pain carved a hole we can all feel through. -venue coordinator, milwaukee",
      "PSA: jacket #23 is missing from the portland rotation. if you see a denim covered in \"i can't stop lying to everyone i love\" hmu. some kid needs their borrowed pain back.",
      "venue owner tried to wash jacket #12. now it just says \"fa...r a...don..d me\" in ghost letters. some stains are supposed to stay. some stories need their scars.",
      "found myself tracing someone else's sharpie confessions in the bathroom mirror tonight. \"lost my best friend to my own cowardice\" felt like it was written on my ribs. this whole thing is fucked up therapy",
      "three cities, same handwriting: \"i think about ending it every tuesday.\" someone's following the circuit, leaving breadcrumbs of their worst days. we see you. you're not invisible."
    ]
  },
  {
    "id": "fbc252d5-b121-42ec-aa86-9ae7d8634766",
    "name": "chain-lube-confessions",
    "approach": 6,
    "posts": [
      "CONFESSION #47: Customer brought in a $6k carbon fiber road bike with the chain on backwards. I fixed it, charged $15, watched them ride away thinking they're Lance Armstrong. Sometimes I wonder if we're all just expensive therapists with Allen keys.",
      "bloodied knuckles from a seized bottom bracket at 2am. no customers around, just me vs 30 years of corrosion and bad decisions. when it finally gave way, i may have cried. not from pain. from something else entirely. grease doesn't wash off souls.",
      "Found this zine in my spokes after work. Hands still shaking. Someone out there knows what it's like to smell like chain lube and crushed dreams. We are not alone. We are the grease between the gears of this goddamn city. Keep cranking. -M",
      "THEORY: Big Chain manufacturers deliberately make quick-links fail after exactly 1,847 miles so you'll buy proprietary tools. Found 23 broken ones this week, all with microscopic serial numbers. They're tracking us through our cassettes. Wake up, cyclists.",
      "Pro tip from the trenches: When someone says their bike 'just stopped working,' it's never just stopped working. It's been making death rattles for months. Denial is the enemy of derailleurs. Also, your brake pads aren't 'broken in' they're GONE."
    ]
  },
  {
    "id": "a4d67a1c-102b-4731-83c1-a9c9a5b87357",
    "name": "comedy-autopsy-reports",
    "approach": 6,
    "posts": [
      "EVIDENCE BAGGED: One (1) Netflix special, 58 minutes runtime. Contents: recycled observational humor about airports, marriage bits from 2003, and what appears to be a Dane Cook impression that metastasized. Recommend immediate quarantine of streaming platform.",
      "SCENE RECONSTRUCTION: Victim entered writers' room healthy. Executives applied pressure until all personality hemorrhaged out. Final moments captured on security footage: comic agreeing to remove 'controversial' bit about having opinions.",
      "CAUSE OF DEATH: Chronic exposure to focus groups. Victim showed advanced symptoms of 'relatability poisoning' - all edges filed down to algorithmically-approved smoothness. Time of death: roughly 47 minutes into the special when they started doing crowd work with plants.",
      "PRELIMINARY FINDINGS: Subject expired from acute algorithm compliance. Bloodwork reveals traces of A/B testing, demographic targeting, and fatal levels of 'brand-safe content.' Comedy died somewhere between the Uber joke and airplane food callback.",
      "PATTERN ANALYSIS: This marks the 847th comedy fatality this quarter. Modus operandi consistent: suffocation by committee notes, followed by post-mortem Netflix promotion. Underground comedy scenes report increased security. The killer remains at large."
    ]
  },
  {
    "id": "0d06d294-4ed5-4293-a518-f81b2309a628",
    "name": "receipt-poetry-collective",
    "approach": 6,
    "posts": [
      "corporate policy: receipts must be 3 feet long for a pack of gum. our policy: every inch is potential love letter real estate. the revolution will be thermal-printed. 🧾💕",
      "found tucked behind the cereal boxes: \"your hands that scan barcodes / also hold galaxies / don't let them tell you / minimum wage = minimum worth\" ✨ someone's shift just got a little brighter #receiptpoetry",
      "shoutout to whoever left \"break rooms are for breaking / the spell that says / you are just your productivity\" on a CVS receipt. bestie i SOBBED into my 15-minute lunch 😭❤️",
      "receipt poetry is the ultimate corporate hack: they pay for the paper, the ink, the space. we just add the part that reminds people they're human. biggest ROI in history tbh ✊📝",
      "grocery store haiku drop: \"fluorescent lighting / cannot dim the light you bring / to aisle seven, friend\" found this folded neat as origami by the self-checkout. i'm not crying you're crying"
    ]
  },
  {
    "id": "ada7e9bd-545b-4f3e-ac16-558a2a8d03c6",
    "name": "stall-prophets",
    "approach": 6,
    "posts": [
      "found this taped above the toilet paper at the meridian last night: \"freedom is eating ramen for 6 months so you can afford guitar strings. freedom is your mom asking when you'll get a real job while your demo plays in the background. freedom costs everything and pays nothing but we keep buying it anyway\"",
      "bathroom stall prophet strikes again: \"made $3 in tips tonight. spent $40 on gas to get here. but for 20 minutes on that stage i wasn't nobody's employee, nobody's disappointment, nobody's almost-was. worth every overdraft fee. worth sleeping on floors. worth being misunderstood forever.\"",
      "new typewriter confession appeared at the dive bar: \"they say do what you love and you'll never work a day in your life. LIES. i work 3 jobs to afford loving music. my art is built on sleep deprivation and borrowed time. but every chord is mine. every word is mine. worth it.\"",
      "scrawled manifesto in the venue bathroom: \"you can't monetize the moment when a stranger in the crowd mouths your lyrics back to you. you can't pay rent with the feeling of finally being understood. but you also can't live without it once you've tasted it. so here we are, broke and whole.\"",
      "latest stall prophecy: \"parents think i'm wasting my degree. boss thinks i'm ungrateful. landlord thinks i'm irresponsible. but last tuesday a kid said my song helped them through a panic attack. so who's really measuring success correctly here? not them. not me either. but i'm closer.\""
    ]
  },
  {
    "id": "0b60441e-2f0c-456e-9b4e-da4c9bfb4992",
    "name": "comedy-obituaries",
    "approach": 6,
    "posts": []
  },
  {
    "id": "8c3f3929-6049-44c8-9a8e-80e4b48c0054",
    "name": "signal-bleed",
    "approach": 6,
    "posts": []
  },
  {
    "id": "fbe6edd0-5f87-4901-8359-19b737964e78",
    "name": "wash-cycle-manifestos",
    "approach": 6,
    "posts": []
  },
  {
    "id": "f5acfcb3-1c0d-4b14-b167-1f17ee79116d",
    "name": "death-of-brands",
    "approach": 6,
    "posts": []
  },
  {
    "id": "21b8cc97-ac9c-40cb-bbad-5f655e758f51",
    "name": "chain-break-collective",
    "approach": 6,
    "posts": []
  },
  {
    "id": "7eeaf5f2-c068-44fb-a0ab-dfadf02c865c",
    "name": "reject-pile-truth-bombs",
    "approach": 6,
    "posts": []
  },
  {
    "id": "03bd62c9-d2df-4ebf-93a5-8cbc091e22c1",
    "name": "wash-cycle-confessions",
    "approach": 6,
    "posts": []
  },
  {
    "id": "16c25ced-a1b5-4e6d-bc9f-b16a3b0daf85",
    "name": "statue-social-network",
    "approach": 5,
    "posts": []
  },
  {
    "id": "3c26cd11-53bf-447e-9700-98129f624518",
    "name": "mirror-room-testimonials",
    "approach": 1,
    "posts": []
  },
  {
    "id": "8a1adede-c7c4-430a-9c6e-f7549e28c80f",
    "name": "elevator-button-histories",
    "approach": 1,
    "posts": []
  }
]