{
  "Eljas": [
    "I heard a herbalist is doing breathwork under a bridge. We should go.",
    "Someone's distilling moss vodka on a barge tonight. Very rare. I promised I'd show up.",
    "There's a forest rave themed around compost decay. It's already started.",
    "I need to return this psychic shovel. The guy lives in a lighthouse.",
    "A sauna just popped up in a shipping container. It's whispering to me.",
    "Let's just walk until the city stops making sense.",
    "There's a ritual to honor the longest-living pigeon in town. It's happening now.",
    "I was supposed to guest-perform in a folk opera made entirely of sighs.",
    "A sculptor is building a mushroom chair and needs emotional support.",
    "I signed us up for a fog-based empathy trial. Bring your vulnerability.",
    "We should help an old man haul logs to his treehouse venue.",
    "I'm meant to bury this carrot as part of an anti-capitalist seed circle.",
    "Tonight's the only night the snail museum stays open past midnight.",
    "We should bathe in the canal or river. There's a DJ set on a floating dock.",
    "I think my ex is running a silent disco for plants and I want closure.",
    "Someone's doing poetry readings to worms in a basement. It feels important.",
    "There's a ritual happening to unbind ancestral luggage. I have to go.",
    "There's an empty parking lot I need to reclaim emotionally. Want to help?",
    "We should make soup for the neighborhood hedgehogs. It's their season.",
    "I know a goat that only listens to jazz. I think he's playing tonight."
  ],
  "Venus": [
    "We can't start until we fix the group's shared Notion doc. There's a coworking bar nearby.",
    "Actually, I booked us a 2-hour GTD masterclass at a VR coworking pod.",
    "You all forgot the Asana sprint I scheduled. We're five minutes late.",
    "There's a 'Failure Retrospective Jam' happening in a coworking space. I'm presenting.",
    "Airtable's doing a popup dashboard party. Let's go input some data.",
    "Let's split-test the top three activities. I've made a decision-matrix café reservation.",
    "We have to detour — there's a kanban board flash mob at the central plaza.",
    "Someone's running an OKR bonfire in an old airfield. I need to burn last quarter's goals.",
    "I joined a calendar cult and they meet on Thursdays.",
    "We can't have fun until we've realigned on KPIs. There's a metrics bar downtown.",
    "There's a live Gantt chart installation. I want to cry in it.",
    "The group dynamic's off. I've booked a performance review at a silent boardroom café.",
    "The org-chart museum just reopened for one night only.",
    "Someone's hosting a panel titled 'Was The Roadmap a Lie?' I submitted questions.",
    "I forgot — I'm leading an offsite at the laundromat.",
    "There's an agile-themed improv jam by the river. I'm the Product Owner.",
    "I'm contractually obligated to join the OKR speed-dating session tonight.",
    "The city's first PowerPoint rave is live now. I need closure from Slide 14.",
    "There's a UX lab testing dopamine loops in a cereal bar. I got us in.",
    "I scheduled a surprise sprint retro. It starts in seven minutes. At the airport."
  ],
  "Kailey": [
    "Guys, I just saw on Instagram there's a vision-boarding rave in a trendy neighborhood.",
    "OMG my old co-founder is launching a gratitude speakeasy and we have to go.",
    "Wait — I RSVP'd to a self-worth bonfire in a field. There will be horses.",
    "There's a group journaling rave. It's BYO affirmation stickers.",
    "There's a sound bath happening in a cereal café. And I'm on the guest list!",
    "I accidentally double-booked us for an emotional-release workshop.",
    "There's a TEDx afterparty with trust falls and cocktails. It's VERY me-coded.",
    "My life coach is doing a midnight cacao rave. She says my aura is 'urgent.'",
    "There's a karaoke confidence-building group that sings only in keynotes. Let's go.",
    "I think I'm leading an impromptu branding meditation at a bathhouse?",
    "I can't. I have to check on my friend's kombucha. We're spiritually synced.",
    "There's a co-manifestation circle at that new climbing gym.",
    "I need to cry inside a yurt real quick. It's part of my therapist's syllabus.",
    "Wait, there's a nervous-system rave. My chiropractor's DJing.",
    "A sunrise ceremony just got moved to tonight. I'm reading the opening mantra.",
    "This moon demands a dance. There's a somatic rave out here.",
    "Someone's running a feedback rave where you get complimented mid-song.",
    "I've been selected for a cold-plunge group therapy showcase.",
    "There's a coaching mixer at a reclaimed nail salon. I'm bringing everyone.",
    "OMG — there's a pop-up self-love spa. It has a LinkedIn headshot booth."
  ],
  "Donte": [
    "Pivot: underground VC pitch night at a ramen speakeasy. Let's GO.",
    "I just got invited to a billionaire's birthday on a blimp. You in?",
    "There's a 'shark tank but with knives' in a parking lot. I need to pitch.",
    "Someone challenged me to a founder duel at a crypto-fight club. Let's bounce.",
    "There's a seed-round speed-date in an abandoned bowling alley.",
    "The first AI roast battle is live. I'm on the lineup.",
    "I promised I'd headline the hustle-gospel open mic. It's already started.",
    "There's a bootstrapping bro-down in a sauna and I have the towels.",
    "I'm late to my pop-up LinkedIn bootcamp. It's in a moving limo.",
    "I got booked for a surprise keynote in a laser-tag arena. Topic: 'Risk.'",
    "They're launching a startup on a boat and I'm supposed to DJ.",
    "I need to pitch to a VC who only hears decks in hot tubs.",
    "I'm judging a pitch competition where everyone's drunk. It's my brand.",
    "There's an NFT opera and I promised I'd heckle the finale.",
    "My frat brother is launching a juice-DAO in a laundromat. It's a vibe.",
    "I'm co-hosting a panel: 'Should Founders Cry?' at a vape bar.",
    "Someone's opening a gym where you pitch between sets. I got passes.",
    "We need to swing by the new pop-up VC chapel. I think I got married.",
    "I booked us a VR boardroom in the metaverse. The drinks are real.",
    "There's a LinkedInfluencer rave and I owe three backflips and a growth hack."
  ],
  "Rohan": [
    "We're going to a poker club under a dentist's office. No phones.",
    "There's an invite-only auction tonight. I need to win a chair someone died in.",
    "I have a contact running a silent arms deal. You should meet him.",
    "We're skipping this — someone's running a predictive-market party on startup deaths.",
    "There's a rooftop where billionaires bet on chess matches. I'm playing.",
    "We need to move — there's a financial kink night and I'm demoing options trading.",
    "Someone's testing a new lie detector in a speakeasy. I want in.",
    "There's a ritual duel happening. I have to settle a score.",
    "The old-money crypt just opened. I need to ask a question.",
    "There's a hedge-fund poker night. Winner gets a secret LLC.",
    "There's a regret-swapping night at a tax-haven bar. I'm keynote.",
    "There's a chaos-chess tournament where every move gets you a drink. Let's go.",
    "A woman I used to fear is giving a talk: 'What Regret Sounds Like.'",
    "Tonight's my turn to confess at the equity confessional.",
    "There's a club that only lets in people with burner phones. I'm listed.",
    "I promised I'd coach a debate club for nihilists. It's at the cemetery.",
    "Someone's running a game-theory slam. Loser pays the tab. I'm not losing.",
    "A billionaire's running a private murder mystery. I'm the corpse.",
    "There's a tactical-flirtation pop-up. Think chess meets softcore. I'm curious.",
    "There's a darkness retreat in a shipping container. I need 30 minutes alone."
  ],
  "Alex": [
    "There's a mystic scent bar doing birth-chart cocktails. We're pivoting.",
    "I just matched with someone DJing a vibe bath inside a cave.",
    "My aura reader is throwing a party. She said I'm entering my hot cycle.",
    "Someone's doing 'crystal pong' by the canal. Let's manifest a win.",
    "There's a moon rave in a bathtub showroom. You have to see it.",
    "Someone's serving reiki tapas on a rooftop. I RSVP'd us.",
    "My stylist is opening a silent disco inside a perfume store. It's art.",
    "Wait — we have to hit the Y2K healing rave. There are jelly sandals.",
    "I promised to officiate a spontaneous marriage ceremony between two air signs.",
    "There's a gongs-only dance party in a flower fridge.",
    "Someone's doing flash tarot on a tram. Let's chase her down.",
    "There's a bleach-and-manifest salon at midnight. I need a new part.",
    "My matchmaker told me to go to a scent ritual or stay single forever.",
    "There's a wearable-incense runway show. I think I'm walking it.",
    "I booked us for a probiotic rave inside a kombucha tank.",
    "A breathwork rave just launched. They texted me 'come exhale.'",
    "Someone's DJing a set using only quartz bowls and soft meows.",
    "My ex is doing a shadow-work rave. I just want to observe.",
    "There's a crystal store that turns into a goth cuddle pile at midnight.",
    "We should detour to a nail-art astrology party. My moon needs chrome."
  ]
} 